{
"station":
[
    { "name": "Techno Style", "streamURL": "https://onlineradiobox.com/json/hu/technostyle/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/26405.v1.png", "desc": " techno", "longDesc": "Minden, ami Techno! - Az igazi Technosok itt vannak! Kuldetesunk a Magyar Techno Kultura eletben tartasa! 100% ?T?CHN? A-Zig Csatlakozz Te is!" },
{ "name": "Cool FM", "streamURL": "https://mediagw.viacomkft.hu/stream/coolfm", "imageURL": "https://traderblog.net/images/magyarorszag/23935.v9.png", "desc": " adult contemporary", "longDesc": "COOL FM Ц no.1 hit music A legkedveltebb radio. Hetente tobb, mint 110 ezren hallgatjak a legfrissebb zeneket, a legfontosabb hireket es informaciokat." },
{ "name": "Nota FM", "streamURL": "https://onlineradiobox.com/json/hu/nota/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/48264.v9.png", "desc": " folk, community", "longDesc": "#mulatasi - A legnagyobb mulatos sztarok nalunk szolnak!" },
{ "name": "Part FM", "streamURL": "https://onlineradiobox.com/json/hu/partfm/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25248.v3.png", "desc": " new age, entertainment, information, community", "longDesc": "Radionk forumot biztosit a helyi kozossegeknek, civil szervezeteknek, a lokalpatriota torekveseknek. Kiemelten foglalkozunk az infrastrukturalis fejlesztesekkel, a kornyezetvedelemmel, a balatoni gazdasag alapjat kepezo turizmussal, az agazatban erintett cegekkel, hirdetve azt a pozitiv es kovetendo eletszemleletet, amit az itt elok erre epitett szellemisege tud kozvetiteni." },
{ "name": "Radio 88", "streamURL": "https://onlineradiobox.com/json/hu/radio88/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25255.v1.png", "desc": " top40, entertainment, information", "longDesc": "A Radio 88 Szeged legmeghatarozobb mediuma. Magyarorszag legregebb ota fennallo kereskedelmi radioja 1990-ota szorakoztatja Szeged es kornyekenek hallgatoit. A radio regebben Vasar Radio neven volt elerheto." },
{ "name": "Radio Inside", "streamURL": "https://onlineradiobox.com/json/hu/inside/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24411.v4.png", "desc": " dance, trance, house", "longDesc": "Radio Inside is a web based internet radio station from Budapest that plays Best House, Dance and Trance radio genre of music." },
{ "name": "Kek Duna Hot", "streamURL": "https://onlineradiobox.com/json/hu/kekduna/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25154.v7.png", "desc": " pop, top40, 90s, 00s, 80s", "longDesc": "Napjaink kedvencei es a legjobb zenek a 80-as, 90-es es 2000-es evekbol." },
{ "name": "Gold", "streamURL": "https://stream1.virtualisan.net:6202/live.mp3", "imageURL": "https://traderblog.net/images/magyarorszag/25731.v3.png", "desc": " 70s, 60s", "longDesc": "A Rdaio Gold a regi idok adoja, ahol a 60-70-es evek legnagyobb orokzold slagereit jatsszak egesz nap. A magyar es kulfoldi legendas pop, rock &amp; roll klasszikusok meg a 80-as evekben szuletett generacio szamara is ismert felvetelek. A kizarolag az interneten hallgathato Radio Gold nonprofit mukodesu, amely az Egri nyitott kapu alapitvany jovoltabol johetett letre. Radio Gold szlogenje: Nagy idok nagy slagerei a 60-70-es evekbol." },
{ "name": "Bartok Radio", "streamURL": "https://icast.connectmedia.hu/4741/mr3.mp3", "imageURL": "https://traderblog.net/images/magyarorszag/24403.v2.png", "desc": " jazz, classic", "longDesc": "A Bartok Radio a Magyar Radio csatornaja. Elsosorban komolyzenet, jazzt, valamint irodalmi muveket kozvetit." },
{ "name": "Best FM", "streamURL": "https://onlineradiobox.com/json/hu/bestfm995/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/81740.v1.png", "desc": " dance, pop, top40, hits", "longDesc": "Best FM - A legjobb zenek!" },
{ "name": "Klasszik", "streamURL": "https://onlineradiobox.com/json/hu/klasszik/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24412.v1.png", "desc": " pop, classic", "longDesc": "A zenei arculat a 35 evesnel idosebb klasszikus zeneszeretok izlese alapjan alakult ki. A frekvencian a korai barokktol a 20. szazad elejeig tarto idoszakban szuletett legnepszerubb klasszikus zenei darabok kerulnek adasba. Ezen felul pedig napjaink nepszeru filmzenei is szerves reszet kepezik a zenei repertoarnak. Rovid, informativ szoveges erdekessegek (leginkabb kulturalis es tavol-keleti temaban) parosulnak a legismertebb klasszikus zenei, filmzenei, crossover es musical tetelek, szamok sugarzasaval." },
{ "name": "POWER DANCE FM", "streamURL": "https://onlineradiobox.com/json/hu/powertrance/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/23959.v7.png", "desc": " dance, pop, hits", "longDesc": "Best Dance Music" },
{ "name": "Forras Radio", "streamURL": "https://onlineradiobox.com/json/hu/forras/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25647.v1.png", "desc": " news, talk, top40", "longDesc": "A Forras Radio 2009-ben azzal a cellal jott letre, hogy Tatabanya es Komarom tersegeben eloknek egy minosegi helyi radiot nyujtson. Az orszagos hirek mellett nagy hangsulyt fektetnek a helyi lakosokat erinto esemenyekre es rendezvenyekre. Mindemellett a legkedveltebb zeneket jatsszak az elmult 20-30 ev es a napjaink slagereibol." },
{ "name": "Argentine Tango", "streamURL": "https://onlineradiobox.com/json/hu/argentinetango/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/23949.v2.png", "desc": " top40, 50s, tango, 40s", "longDesc": "Argentine Tango Radio Budapest plays danceable argentine tangos, valses, and milongas from the Golden Age of Tango, all day long. Musical selection is provided by DJ Balazs Gyenis." },
{ "name": "Luxfunk", "streamURL": "https://onlineradiobox.com/json/hu/luxfunk/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25249.v3.png", "desc": " r'n'b, rap, hip-hop, soul", "longDesc": "Luxfunk Radio is the first and the only Internet radio in Hungary that plays Funky music of high standard. Primarilly they offer you classical funky, rap, soul and rnb. The best songs of the last three decades are being played 24 hours a day. This is the Luxfunk Radio's main station. Here you can listen to Funk, Soul, RnB and Hip-Hop classics and specialities, what's more, a lot of adaptations. The radios's basic style are Funky and Soul, because we love and absolutely respect the talented musicians behind the instruments." },
{ "name": "Ingress FM", "streamURL": "https://onlineradiobox.com/json/hu/lnchd1003/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24198.v6.png", "desc": " news, talk, folk, information", "longDesc": "A Lanchid Radio Budapest 2007. marcius 15 - en szolalt meg regionalis adokent a fovarosban az FM 100,3 MHz -en. 24 oras programjaval a vetelkorzeteben eloket latja el aktualis hirekkel, informaciokkal, praktikus szolgaltatasokkal, tematikus magazinokkal es igenyes zenevel. Az elmult evekben videki varosokban ( Balatonfured, Dunaujvaros, Gyor, Kaposvar, Keszthely, Pecs, Siklos, Szeged, Szekesfehervar, Szigetvar, Szombathely, Tatabanya, Zalaegerszeg ) is elkezdte sugarzasat, az ott eloket is bevonva musoraba." },
{ "name": "BDPST ROCK", "streamURL": "https://onlineradiobox.com/json/hu/bdpstrock/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/81686.v8.png", "desc": " rock", "longDesc": "A BDPST ROCK egy dallamos rockot, felnott, hangszeres zenet jatszo allomas. Celunk, hogy megmutassuk, milyen egy igazan igenyes, rockzenei radio." },
{ "name": "Buddha FM", "streamURL": "https://onlineradiobox.com/json/hu/buddhafm/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25767.v1.png", "desc": " meditation", "longDesc": "A Buddha FM Magyarorszag elso buddhista radioja, amelyben helyet kap a buddhizmus osszes iranyzata Delkelet-Azsian at, Tibeten es Del-Korean keresztul, Japanig valamint kiemelt figyelmet szentelnek az europai, azon belul is a kulonbozo magyarorszagi buddhista kozossegeknek." },
{ "name": "MixRadio", "streamURL": "https://onlineradiobox.com/json/hu/mixradio/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/73102.v3.png", "desc": " dance, pop, top40, hits", "longDesc": "Mix Radio is an internet radio station from Budapest, Hungary providing Electronic-Dance music and information." },
{ "name": "Radio Antritt", "streamURL": "https://onlineradiobox.com/json/hu/antritt/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25267.v2.png", "desc": " pop, oldies, adult contemporary", "longDesc": "Radio Antritt offers their students a colorful mix of songs from 80s to today. Our target group is between the ages of 25-50, which covers a fairly wide scope, and therefore offer a musical compilation is not an easy task. Antritt Radio - Music at its finest! mottonkbol turns out to be the primary target of the radio in the well-known, well-liked by the general public music." },
{ "name": "Petofi Radio", "streamURL": "https://onlineradiobox.com/json/hu/magyarpetofi/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24382.v4.png", "desc": " talk, top40, acoustic, entertainment", "longDesc": "A Petofi Radio a Duna Media (regebben a Magyar Radio) egyik csatornaja. A Petofi Radiorol az is elmondhato, hogy a fiatalok radioja. A radio musoraiban a zene kapja a foszerepet. A zenei kinalata Europa es a vilag minden tajanak legfrissebb es legsikeresebb zenei anyagat mutatja be kulon sulyt helyezve a fiatal hazai tehetsegekre. A zene mellett az eletmoddal kapcsolatos, valamint kulturalis es kozeleti informaciok is kapnak helyet." },
{ "name": "Retro Radio", "streamURL": "https://onlineradiobox.com/json/hu/retro995/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/66135.v12.png", "desc": " news, retro, hits", "longDesc": "A Retro Radio az egyetlen magyarorszagi orszagos kereskedelmi radio, amely az egykori Danubius Radio es Class FM frekvenciain sugaroz. Eredetileg Budapesten, 2017. december 18-an indult a Radio Q musorat felvaltva, orszagosan 2018. junius 15." },
{ "name": "Klubradio", "streamURL": "https://onlineradiobox.com/json/hu/klub/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24193.v6.png", "desc": " news, talk, information", "longDesc": "Klubradio 92,9 Mhz - tenyek, velemenyek - feketen, feheren. Magyarorszag egyetlen Дtalk and newsФ (tenyek-velemenyek) radioja. A Klubradio 40 fele interaktiv, tematikus magazinmusort kinalo musorszerkezete egyedulallo a hazai radiospiacon! Eros hir- es informacioszolgaltatas, tajekoztatas, kozszolgaltatas Ц kozelet, kozlekedes, idojaras, gazdasag, kultura. Tematikus musorkinalat Ц fogyasztovedelem, konyvek, ingatlan, utazas, auto es kozlekedes, eletmod, kozelet, szorakozas. Kozvetlen beszelgetos magazinmusorok - a hallgatok es a szakertok bevonasaval." },
{ "name": "Jazzy", "streamURL": "https://onlineradiobox.com/json/hu/jazzy/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25409.v1.png", "desc": " lounge, soul, smooth jazz, swing", "longDesc": "Magyarorszag egyetlen radioja, ahol a smooth jazz nagyagyui mellett hallhatok a soul, a lounge, a swing es a jazz jeles zeneszei!" },
{ "name": "Civil", "streamURL": "https://onlineradiobox.com/json/hu/civil/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24405.v2.png", "desc": " news, talk", "longDesc": "Rad is szuksegunk van! A Civil Radio 1995-tol letezo kozossegi radio, amelynek egyik legfontosabb celkituzese, hogy hangot adjon a hangtalanoknak Ц vagyis teret adjon minden olyan temanak, megszolalasi lehetoseget adjon minden olyan tarsadalmi csoportnak es kozossegnek, amelyek nem kapnak figyelmet a tomegmediumokban." },
{ "name": "Callisto", "streamURL": "https://onlineradiobox.com/json/hu/callisto/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/23956.v3.png", "desc": " 90s, 80s", "longDesc": "Callisto Radio is an Internet Radio station broadcasting from  Hungary, providing 90's, 80's Hit Music." },
{ "name": "Vorosmarty", "streamURL": "https://onlineradiobox.com/json/hu/vorosmarty/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25265.v1.png", "desc": " top40", "longDesc": "A Vorosmarty Radio kialakulasa, mukodese tobb szempontbol is kulonleges, igazi kuriozum. A kezdetektol fogva kozszolgalatikent mukodo ado letrejotte, mai mukodese is mondhatni kuldetes. A radio tortenete egeszen a forradalmi idokig nyulik vissza, hiszen 1956-ban mar letezett radioado Vorosmarty Radio neven, Szekesfehervaron." },
{ "name": "Szent Istvan", "streamURL": "https://onlineradiobox.com/json/hu/szentistvan918/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25082.v4.png", "desc": " christian, culture, religious", "longDesc": "A Szent Istvan Radio (SZIR) egy magyarorszagi regionalis, katolikus beallitottsagu radio. Egri kozponttal, napi 24 oraban, regionalis kozossegi musorszolgaltatokent mukodik. Musoridejeben fokent kozszolgalati es vallasi jellegu musorok hangzanak el, amelyek atfogjak a mindennapi elet egeszet, a gazdasag, a tarsadalom es a kultura minden lenyeges kerdeserol szolnak. Elsosorban az emberi hangra epit, a szoveg aranya a zenehez kepest 53,45%. Uzemeltetoje a Magyar Katolikus Radio Alapitvany, melyet a Magyar Katolikus Puspoki Konferencia alapitott 2005-ben." },
{ "name": "Radio M", "streamURL": "https://onlineradiobox.com/json/hu/radiom/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25724.v3.png", "desc": " pop, top40", "longDesc": "A Ma es a holnap ritmusa, ez a Radio M. Mar a szlogen is sugallja, a miskolci Radio M-nel a hallgatok ele tarjak a legujabb zenei ujdonsagokat, de a kinalatban megtalalhato a minden korosztalyt kielegito slagerek az elmult evekbol. A megyeszekhely mellett Tiszaujvarosban, Kazincbarcikan es Ozdon is foghato a Radio M, de internetkapcsolattal a vilag barmelyik pontjarol hallgathatjuk." },
{ "name": "Folkradio", "streamURL": "https://stream.folkradio.hu/folkradio.mp3", "imageURL": "https://traderblog.net/images/magyarorszag/24905.v4.png", "desc": " folk", "longDesc": "Folkmusic of the Carpathian Basin - Folkradio is a not-for-profit, radio service featuring traditional folk music. It primarily broadcasts Hungarian folk music, but also music of other peoples and ethnic groups living in the Carpathian Basin." },
{ "name": "VidamCsapat Radio", "streamURL": "https://onlineradiobox.com/json/hu/vidamcsapat/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/48295.v2.png", "desc": " rock, pop, talk, hits", "longDesc": "Udvozol mindenkit a VidamCsapat! Ez az oldal azert jott letre, hogy hallgatoink figyelemmel tudjak kiserni, hogy kedvenc musorvezetojuk mikor van musorban. De termeszetesen szeretettel varnak titeket a tobbiek is." },
{ "name": "Parlamenti Radio", "streamURL": "https://onlineradiobox.com/json/hu/parlamentiadasok/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24408.v1.png", "desc": " news, talk, information", "longDesc": "Parlamenti adasok is an internet radio station from Budapest, Hungary, providing News and Entertainment. As part of Magyar Radio Zrt., Parlamenti adasok provides programs in the large variety of languages in Hungary, including Roma, Croatian, Armenian, Ukrainian, Slovak, Ruthenian, Bulgarian, and Slovak." },
{ "name": "Live Radio - Retro Klub", "streamURL": "https://onlineradiobox.com/json/hu/liveretroklub/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/73105.v4.png", "desc": " retro, 90s, 80s, 70s", "longDesc": "Magyar online retro zenei radio" },
{ "name": "Diveky Radio - Made in Hungary", "streamURL": "https://onlineradiobox.com/json/hu/divekyradio/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24394.v8.png", "desc": " rock, folk, hungarian", "longDesc": "MADE IN HUNGARY! Magyar pop es rockzene Illes-Metro-Omega-tol napjainkig! A Radio-D tehat valtozatlanul 12 onallo zenei radio gyujtemenye, melyeket az azonos szerkesztesi elv: az ertekrend, a minoseg, a reszletes es attekintheto megjelenes fog ossze. Adoink az adott mufaj legertekesebb es legkozkedveltebb felveteleit sugarozzak, de igyekeznek feltarni a meltatlanul elfeledett remekmuveket is. Meggyozodesunk, hogy a mostani, adok kozotti konnyu valtas lehetosege is kozelebb hozza a kulonbozo stilusok kedveloit mas mufajok megismeresehez." },
{ "name": "KORONAfm100", "streamURL": "https://onlineradiobox.com/json/hu/koronafm100/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24947.v1.png", "desc": " rock, top40, variety", "longDesc": "1999. aprilis 1-jen indult a kalocsai Korona Radio 24 oras musora az FM 100 MHz-en. A KORONAfm100 stabja azota igyekszik Дhiteles, partatlan es szorakoztatoФ programjaval szinezni a mintegy 50 kilometeres hallgatoi korzeteben elok mindennapjait." },
{ "name": "Manna FM", "streamURL": "https://icast.connectmedia.hu/4780/live.mp3", "imageURL": "https://traderblog.net/images/magyarorszag/76583.v4.png", "desc": " pop", "longDesc": "A Manna FM a budapesti regio uj kozossegi radioja a 98.6 frekvencian. Pozitiv hangvetelu tartalmakkal, jo es friss zenekkel toltjuk fel a napjaidat." },
{ "name": "Speed FM", "streamURL": "https://onlineradiobox.com/json/hu/speedfm/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/62907.v7.png", "desc": " dance, electronic, pop", "longDesc": "Speed FM - Mindig veled" },
{ "name": "Szent Korona", "streamURL": "https://onlineradiobox.com/json/hu/szentkorona/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25732.v3.png", "desc": " rock", "longDesc": "A 2006-ban megalakult Szent Korona Radiot sokan a nemzeti radikalis radiokent emlegetik. A radio alapveto celja, hogy nepszerusitse a magyar kulturat, ennek erdekeben magyar nepdalokat, magyar koltok es irok muveit mutatjak be. A zenei kinalatra is jellemzo a hazafias hozzaallas, foleg olyan zenekarok dalai alkotjak a kinalatot, melyek a magyar nemzeti erzetet kifejezo dalokat jatszanak. Mufaj szempontjabol leginkabb a rock, azon belul is a nemzeti rock dominal, emellett ugyanakkor megjelennek a nepzenek is." },
{ "name": "Aktiv", "streamURL": "https://onlineradiobox.com/json/hu/aktiv/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25273.v3.png", "desc": " pop, news, adult contemporary, information", "longDesc": "Az AKTIV Radio 1995-ben indult el helyi radiokent Szolnokon az FM 92.2 MHz-es, frekvencian az elso idoszakban 12-20 ora kozotti musoridoben. A radio a sikeres palyazat utan 1999. marcius 7-tol folyamatos 24 oras musort allit elo es sugaroz hallgatoinak. A musorstrukturara jellemzo, hogy reggel 6 oratol este 20-22 oraig elo musorral, orankent illetve a reggeli musorunkban felorankent helyi hireket es informaciokat mondanak, jatekokkal es az itt elo embereket erdeklo es erinto rovid magazinmusorok szerepelnek a kinalatban." },
{ "name": "Hit Radio", "streamURL": "https://stream1.hit.hu:8080/high", "imageURL": "https://traderblog.net/images/magyarorszag/24467.v4.png", "desc": " christian", "longDesc": "A Hit Gyulekezete online radioja, kereszteny zenevel, hiteleti hirekkel, elo musorokkal, igehirdetessel varja a hallgatokat mindennap! A legfrissebb hiteleti hireket mutatja be honlapunk a vilag minden tajarol." },
{ "name": "Trend FM", "streamURL": "https://onlineradiobox.com/json/hu/trendfm/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24443.v4.png", "desc": " news, business", "longDesc": "A magyar gazdasag es a vilaggazdasag friss hirei, reszvenyarfolyamok, tozsdei hirek, BUX, kamat es ado informaciok." },
{ "name": "Cegled", "streamURL": "https://onlineradiobox.com/json/hu/cegled/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24900.v3.png", "desc": " top40, variety", "longDesc": "Cegled, interaktiv, szorakoztato kereskedelmi radioja az FM 92.5-n!" },
{ "name": "Radio 7", "streamURL": "https://onlineradiobox.com/json/hu/radio7/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24911.v9.png", "desc": " news, talk, top40, variety", "longDesc": "Koszontunk a mi vilagunkban! Szereted a 90-es, 2000-es evek es napjaink slagereit? Szeretned tudni, mi tortent Vasarhelyen, Makon es a regioban? Egy igazi baratra vagysz, aki vidamma varazsolja a reggeli ebredesed, elrepiti a munkaidod es hazakiser delutanonkent? Aki non-stop fergeteges hangulatot varazsol az otthonodban, az irodadban vagy epp az autodban? Aki megsugja, hol keszulnek rolad draga fenykepek a 43-ason, merre szamits forgalmi dugora a 47-esen, milyen ruhat adj a csalad kicsi kincseire es idonkent fantasztikus ajandekokkal, nyeremenyekkel lep meg?" },
{ "name": "Radio 451", "streamURL": "https://onlineradiobox.com/json/hu/radio451/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/26357.v7.png", "desc": " pop, news, talk", "longDesc": "2012. augusztus 3-an egy uj, helyi kereskedelmi radio kezdte meg mukodeset Szentesen, Radio 451 neven. A korabbi Ц akkor mar 3 eve uresen allo Ц Radio Szentes frekvenciajan, a 106.1-en szol a Szentesen es vonzaskorzeteben elokhoz a Radio 451, a terseg helyi radioja." },
{ "name": "Sirius", "streamURL": "https://onlineradiobox.com/json/hu/sirius/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25073.v3.png", "desc": " education, entertainment, information, student radio", "longDesc": "Sirius Radio 91.1 is a broadcast Radio station from Kiskunfelegyhaza, Bacs-Kiskun Province, Hungary, providing the needs of students and of course the entertainment and informing." },
{ "name": "Duna World Radio", "streamURL": "https://onlineradiobox.com/json/hu/dunaworldradio/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24407.v2.png", "desc": " news, ethnic, entertainment", "longDesc": "Duna World Radio is an internet radio station from Budapest, Hungary, providing News and Entertainment. As part of Magyar Radio Zrt., Duna World Radio airs newscasts, talk shows and entertainment content from the network's station as a connection to the Hungarian Diaspora." },
{ "name": "Radio Most", "streamURL": "https://onlineradiobox.com/json/hu/most/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24948.v4.png", "desc": " rock, pop, news, talk, top40", "longDesc": "Radio Most Kaposvar is a broadcast radio station in Kaposvar, Hungary, providing News, Talk and Top 40, Rock, Pop music." },
{ "name": "Fezen Radio", "streamURL": "https://onlineradiobox.com/json/hu/fezen/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25260.v10.png", "desc": " rock, top40, adult contemporary", "longDesc": "A Fezen Radio egy ugynevezett kiskozossegi ado, melyet A Tehetseges zeneszekert Alapitvany mukodtet." },
{ "name": "Amadeus", "streamURL": "https://onlineradiobox.com/json/hu/amadeus/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25277.v2.png", "desc": " rock, pop, metal, top40, 90s, 80s", "longDesc": "Szolnok leghallgatottabb radioja a felnott lakossag koreben - Garantaltan 14 dal minden oraban, a 80-as 90-es evek legnagyobb slagerei kozul!" },
{ "name": "Europa Radio", "streamURL": "https://onlineradiobox.com/json/hu/europamiskolc/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25138.v7.png", "desc": " culture, world", "longDesc": "Europa Radio 90.4 is a Hungarian radio station broadcasting from Miskolc, Hungary, Station Airs World and Culture Music." },
{ "name": "Taska", "streamURL": "https://onlineradiobox.com/json/hu/taska/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25264.v2.png", "desc": " dance, pop, talk", "longDesc": "A 97.5 Taska Radio Szekesfehervar kiskozossegi diakradioja, helyileg a Lanczos Kornel Gimnaziumban mukodik. A stab tagjai Szekesfehervar altalanos iskolaibol es gimnaziumaibol kerulnek ki." },
{ "name": "Radio 24", "streamURL": "https://onlineradiobox.com/json/hu/radio24/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25946.v3.png", "desc": " pop, news, talk", "longDesc": "Radionk Kozep-Magyarorszag legnagyobb lefedettsegu kereskedelmi radioja, 120 kilometer atmeroju korben hallhato Fejer, Bacs-Kiskun, Tolna es Pest megyeben. Osszesen tobb mint 300 000 hallgatohoz jutnak el nap mint nap eletunk zenei!" },
{ "name": "LeoMusic Radio", "streamURL": "https://onlineradiobox.com/json/hu/leomusic/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/47933.v5.png", "desc": " pop, news, talk", "longDesc": "A Leo Music Radio minden korszak radioja es foleg azoke akik csak szorakozast es a jo hangulatot valasszak, vagyis a te Radiod :)" },
{ "name": "Panda Radio", "streamURL": "https://onlineradiobox.com/json/hu/panda/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/48267.v3.png", "desc": " rock, pop, 90s, 80s, 70s, 60s, hits", "longDesc": "A kanizsai Panda radio informativ, szorakosztato, kommercialis jellegu fuggetlen (magan) radioallomas, mely 1997-ben kezdte meg mukodeset. 80 km sugaru lefedettseget biztositva, a nap 24 orajaban kozvetit musorokat magyar es szerb nyelven." },
{ "name": "Z-Radio", "streamURL": "https://onlineradiobox.com/json/hu/zradio/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25151.v1.png", "desc": " electronic, top40", "longDesc": "Z-Radio egy internetes radio - Mert a radio nekunk szol! 24 oras adas! Webradio, internetradio, kivansagmusor." },
{ "name": "Radio Groove", "streamURL": "https://onlineradiobox.com/json/hu/groove/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/69756.v2.png", "desc": " disco, pop, classic rock, funk rock", "longDesc": "Hallgasd online a Radio Groove-ot, Magyarorszag uj zenecsatornajat! A radio keszitoi ismert, elismert szakemberek, tobb evtizedes tapasztalattal. Az elmult evekben hallhattad munkatarsaikat es musoraikat, tobbek kozott a Radio Extrem, az Aktiv Radio, a Dio Radio, a Frisss FM, a Fehervar Radio, a Radio 6, a Slager FM frekvencian. A Groove-on a hianypotlo zenei valogatas mellet orankent hireket, es napkozben zenei rovatokat hallhatsz." },
{ "name": "Up&amp;Down You Rock Radio", "streamURL": "", "imageURL": "https://traderblog.net/images/magyarorszag/58281.v18.png", "desc": " rock, hard rock, metal", "longDesc": "Rock forever live" },
{ "name": "Enying FM (Radio E)", "streamURL": "https://onlineradiobox.com/json/hu/enyingfm/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/26295.v7.png", "desc": " dance, trance, house, lounge, urban", "longDesc": "Radio Enying FM streaming from Enying town, Hungary since 1st december, 2012 of the direction of Deep House, Nu disco, Tech House, Chill House, Indie Dance, Trance and Lounge and we reaching more and more listeners. We are on our own way, not following other station's trend. In the year 2017 the time has come to make a full re-branding. From this time we using our shortened name, Radio E. We are the people who reject all the musical pornography that haunts us, and want to know only useful information, not any gossips, fake news. Down with the stereotypes! Radio E - This place is your House!" },
{ "name": "Soulconnexion Radio", "streamURL": "https://onlineradiobox.com/json/hu/soulstation/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/48289.v2.png", "desc": " soul, funk", "longDesc": "Soul es funk zenei adattar, aktualitasok, informaciok" },
{ "name": "Szarvas", "streamURL": "https://cloudfront44.lexanetwork.com:1540/radioszarvas.mp3", "imageURL": "https://traderblog.net/images/magyarorszag/26374.v2.png", "desc": " pop, top40", "longDesc": "Radio Szarvas is an international online radio station playing Top 40/Pop music format for a global audience. Radio Szarvas are an independent station for the online generation, connecting those who already have a strong connection with Szarvas, Hungary." },
{ "name": "Helikon", "streamURL": "https://onlineradiobox.com/json/hu/helikon994/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24950.v1.png", "desc": " pop, top40", "longDesc": "A Helikon Radio 2001. ota sugarozza zenes kereskedelmi musorat a nap 24 orajaban." },
{ "name": "Dance FM", "streamURL": "https://onlineradiobox.com/json/hu/beatbird/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/48302.v1.png", "desc": " dance, electronic", "longDesc": "Hallgasd online a Dance FM vagy regi neven BeatBird FM radiot! A Radio 2009 marcius 1-jen indult hodito utjara. A radio megalmodoi mindannyian lelkesek, fiatalosak, illetve nagyon fontos szamukra a hobbijuk, ezert belevagtak a radio letrehozasaba. Alapelveik koze tartozik, hogy minden korosztalyt kellokepp tudjanak szorakoztatni, emellett igenyek szerint beszelgetos, kviz illetve hasonloan interaktiv musorok hallhatok a radion. A BeatBird Radio csapata egy egeszen kulonleges csapat. Egyikuk az arammal jatszadozik, figyel, hogy mindenhol legyen, eleg feny :)." },
{ "name": "Mez Radio", "streamURL": "https://onlineradiobox.com/json/hu/mez/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/26334.v5.png", "desc": " top40, variety", "longDesc": "Mez Radio is a music radio station. Mez Radio broadcasts to the regions 24 hours a day, 12 months of the year. With a great mix of Top 40, Pop. Mez Radio has something for all discerning music lovers." },
{ "name": "Eper FM", "streamURL": "https://onlineradiobox.com/json/hu/eperfm/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24444.v2.png", "desc": " classic, alternative, education", "longDesc": "A Radio nem nyeresegerdekelt kiskozossegi radio. A Radio celja tudomanyos, muveszeti, kulturalis ismeretterjesztes, (tav-)oktatas, es a belvaros szellemi eletenek formalasa, tukrozese, forum teremtese az itt tanulok es oktatok szamara. Kiemelten fontos celunk a vetelkorzetben elok tajekoztatasa az itt folyo tudomanyos, kulturalis es muveszeti tevekenysegrol, az ELTE diakeleterol." },
{ "name": "Magyar Katolikus Radio", "streamURL": "https://onlineradiobox.com/json/hu/magyarkatolikus/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24445.v2.png", "desc": " talk, christian, education", "longDesc": "A Magyar Katolikus Radiot a Magyar Katolikus Puspoki Konferencia 2004-ben hozta letre azzal a cellal, hogy a magyar tarsadalomban a kereszteny vilagnezetet, eletfelfogast megerositse es terjessze. Kozszolgalati musorstrukturajaval segit eligazodni es tajekozodni a kozelet szamtalan teruleten es a mindennapok kerdeseiben. A katolikus egyhaz tanitasanak hirdeteseben szerepet vallal, a magyar es az egyetemes kultura, valamint anyanyelvunk ertekeinek megorzeseben hataron innen es tul." },
{ "name": "Balaton", "streamURL": "https://onlineradiobox.com/json/hu/balaton/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/26183.v2.png", "desc": " pop, top40", "longDesc": "Balaton Radio broadcasts a diverse range of locally and nationally produced programs, both music and spoken word, in hi fi stereo. Balaton Radio broadcasters believe in providing real music variety, so listeners can enjoy a vast catalogue of known and unknown tracks, from Country to Dance, Hip Hop to Classical, Jazz to Alternative, Rock to Folk, Blues to Ethnic, and much more." },
{ "name": "Magic Disco Radio", "streamURL": "https://onlineradiobox.com/json/hu/magicdisco/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/77381.v3.png", "desc": " 90s, 80s, 70s", "longDesc": "Hallgassa meg a Magic Disco Radio radiot online. Magyar zenei radio 70-80-90x. Nagy energia, Uj Italo, STB. A Magic Disco Radio radioallomasa az elmult evek stilusaban mukodik. Musorszoro orszag - Magyarorszag." },
{ "name": "Trio FM", "streamURL": "https://onlineradiobox.com/json/hu/trio/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25952.v3.png", "desc": " pop, top40", "longDesc": "Trio Radio live broadcasting from Jaszbereny, Hungary. Trio Radio is a one of the most famous online radio station on Jaszbereny, Hungary. Trio Radio broadcast Top 40, Pop music." },
{ "name": "Sunshine FM", "streamURL": "https://onlineradiobox.com/json/hu/sunshinefm/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24468.v2.png", "desc": " variety", "longDesc": "A Sunshine Radio egy magyarorszagi kereskedelmi radio Nyiregyhaza 30 km-es korzeteben. A radio 2001. augusztus 28-an indult a 99.4 MHz frekvencian. A radio 33, 4%-os eleresevel Nyiregyhaza leghallgatottabb radioja volt. Vegul a radio szerzodeset az ORTT 1529/2003. (IX.4.) hatarozataban foglaltak alapjan felmondta, majd az NHH 2005. aprilis 7-en lefoglalta a radio allomasat. A radio 2006. oktober 5-en vegul kethetes probaadassal ujraindult uj tulajdonosi hatterrel, elsodleges celcsoportja pedig a 19-49 ev kozotti korosztaly lett." },
{ "name": "Retro Music Radio", "streamURL": "https://onlineradiobox.com/json/hu/retroszeged/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/57564.v18.png", "desc": " rock, pop, retro, 70s", "longDesc": "2019 Januar 28 Indult a Retro Music Radio azzal cellal, hogy a Retro Zenere ehes embereket kielegitse a legjobb slagereivel, es persze a fiatalokat sem felejti el a radio, hisz napjaink zenei is megtalalhatoak a Radio kinalataban." },
{ "name": "Gong Radio", "streamURL": "https://onlineradiobox.com/json/hu/gong/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25630.v2.png", "desc": " news, talk, top40", "longDesc": "A Gong Radio egy kecskemeti szekhelyu radio, mely a nap 24 orajaban sugaroz es arra torekszik, hogy a terseg hallgatosaganak mindig naprakesz informaciot nyujtson. Zenei kinalatat ugy allitjak ossze, hogy azzal a legtobb hallgato izleset elnyerjek, napjaink slagerei mellett az elmult evtizedek slagerei is felcsendulnek. Az 1996-os indulasa ota egyre nagyobb teruleten erheto el, remenyeik szerint hamarosan mar az egesz Duna-Tisza kozben foghato lesz a Gong Radio." },
{ "name": "Tilos Radio", "streamURL": "https://onlineradiobox.com/json/hu/tilos/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24194.v1.png", "desc": " rock, jazz, talk, alternative", "longDesc": "A Tilos Radio egy budapesti nonprofit radio. A musorkeszitok a legkulonbozobb polgari foglalkozasuak, talan eppen ujsagirobol es mediaszakemberbol van koztuk a legkevesebb. A radio hallgatottsaga pontosan nem ismert, de az elmult evekben tobb radiohallgatasi szokasokat vizsgalo kozvelemeny kutatasba is bekerult a Tilos Radio. Ennek alapjan a Tilos hallgatottsag folyamatosan emelkedik es napi szinten 30 000 hallgatoval, havi szinten pedig 100 000-nel is tobb egyedi hallgatoval rendelkezik." },
{ "name": "Diablo Radio", "streamURL": "https://onlineradiobox.com/json/hu/diablo/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/47675.v2.png", "desc": " rock, metal", "longDesc": "Neha jo egy kicsit rossznak lenni!" },
{ "name": "Retro Star Radio", "streamURL": "https://onlineradiobox.com/json/hu/retrostar/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/75457.png", "desc": " retro, 90s, 80s, 70s, hits", "longDesc": "Idezzuk fel a 80-as,90-es eveket!" },
{ "name": "Gyor Plusz", "streamURL": "https://onlineradiobox.com/json/hu/gyorplusz/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24909.v1.png", "desc": " adult contemporary", "longDesc": "A GYOR+ Radio 2011. novembere ota sugarozza adasat a 100.1 MHz-es hullamhosszon Gyorben es 30-40 km-es vonzaskorzeteben." },
{ "name": "Mex Radio", "streamURL": "https://onlineradiobox.com/json/hu/mex/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/72555.v3.png", "desc": " dance, pop, hits", "longDesc": "Magyarorszag legujabb online radioja, a Mex Radio Teged is var!" },
{ "name": "Pecs FM", "streamURL": "https://onlineradiobox.com/json/hu/pecsfm/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/76609.png", "desc": " dance, pop, hits", "longDesc": "Rengeteg dalt jatszunk a '90-es evekbol, meg tobbet a 2000-es evekbol, es az egeszet megfuszerezzuk az arra erdemes uj slagerekkel." },
{ "name": "Radio Clasic", "streamURL": "https://onlineradiobox.com/json/hu/clasic/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/48307.png", "desc": " classic, instrumental", "longDesc": "Clasic Radio is a multicultural, diverse radio station from Budapest featuring classical music in all its forms! Classics to contemporary music and more." },
{ "name": "SuperDj Radio", "streamURL": "https://onlineradiobox.com/json/hu/superdj/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/72768.v7.png", "desc": " dance, pop, funk", "longDesc": "A 80-as, a 90-es, es a 2000-es evek legnagyobb slagerei a nap 24 orajaban. Tobb alkalommal elo musor. Tovabbi reszletek  weboldalunkon." },
{ "name": "Royal DJ Party", "streamURL": "https://onlineradiobox.com/json/hu/royaldjparty/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/48288.v1.png", "desc": " dance, electronic", "longDesc": "Royal DJ Party Aki zenevel indul az eletbe, bearanyozza minden kesobbi tevekenyseget, az eletnek olyan kincset kapja ezzel, amely atsegiti sok bajon. A zene taplalo, vigasztalo elixir, es az elet szepseget, s ami benne ertek, azt mind meghatvanyozza." },
{ "name": "RadiOzora - Trance", "streamURL": "https://trance.out.airtime.pro/trance_a", "imageURL": "https://traderblog.net/images/magyarorszag/24380.v2.png", "desc": " electronic, trance, downtempo, chill-out", "longDesc": "We are all connected through the same frequency. We are psychedelic music lovers, festival organizers, musicians, DJs, activists, we are all part of a great international family. Our aim is to provide a nonstop psychedelic music experience for our community and to keep us connected all year long." },
{ "name": "Rock Records Radio", "streamURL": "https://onlineradiobox.com/json/hu/rockrecords/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/65968.v5.png", "desc": " rock, metal", "longDesc": "Online rock radio a nap 24 orajaban. Celunk, hogy ismert zenekarok mellett teret adjunk a most indulo magyar rockegyutteseknek is." },
{ "name": "Hits Radio", "streamURL": "https://onlineradiobox.com/json/hu/hits/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/47923.v1.png", "desc": " oldies, hits", "longDesc": "HITS Radio a Retro Retroja!" },
{ "name": "TOP FM radio", "streamURL": "https://onlineradiobox.com/json/hu/topradio/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/71113.v14.png", "desc": " 90s, 00s", "longDesc": "Hallgasd, Erezd, Elvezd! A siker receptje egyszeru: vegy egy nagy adagot nagy kedvencek a 90-es evekbol es fuszerezd meg egy csipetnyit az ezredfordulo nagy slagereivel ill. az aktualis kedvencekkel!" },
{ "name": "Tamasi Radio", "streamURL": "https://onlineradiobox.com/json/hu/tamasi/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25950.v4.png", "desc": " pop, top40", "longDesc": "Tamasi Radio 101.9 is a broadcast Radio station from Tamasi, Hungary, provides Top 40/Pop Music." },
{ "name": "Erdely Radio", "streamURL": "https://onlineradiobox.com/json/hu/erdely/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/65845.png", "desc": " pop, hits", "longDesc": "Koszontjuk a ErdelyiRadio honlapjan! 2015.05.02-an elkezdte sugarozni musorait. Az Erdely Radio A zene nyelven szol hozzad! Hallgassa Erdely Radio evek legjobb dalait! Legendas kulfoldi slagerek szolalnak meg a popzene aranykorabol, legjobb napjaibol. Maradjon velunk es valogasson nagy idok nagy slagereibol! Mondja el baratainak, ismeroseinek is, hogy varja a sok felejthetetlen slager!" },
{ "name": "Szentendre", "streamURL": "https://onlineradiobox.com/json/hu/szentendre/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25824.v1.png", "desc": " news, top40, variety", "longDesc": "A varosban elok a fovaros kozelsege miatt elsosorban a kulonbozo mediumokban sugarzott kozponti, orszagos jelentosegu hirekre kivancsiak, ugyanakkor tajekozodni szeretnenek a legfontosabb helyi esemenyekrol, tortenesekrol is. Radionkban rendszeresen beszamolunk a varos esemenyeirol, torteneseirol. Studionkban beszelgetunk a helyi kozelet kepviseloivel. Mindemellett termeszetesen fontos szerepe van a zenenek is, nagy hangsulyt fektetve a magyar eloadok slagereire." },
{ "name": "MiRadionkat", "streamURL": "https://onlineradiobox.com/json/hu/miradionkat/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25764.v4.png", "desc": " rock, pop, acoustic", "longDesc": "Hallgasd online a MiRadionkat, mely egy 2013. augusztus 29-en indult internetes radio. A radio munkatarsai kozott vannak 20 eves FM radios multtal rendelkezo es szarnyaikat most bontogato ifju kollegak is. A musorokat het allando musorvezeto kesziti. Minden nap 21 oratol tematikus zenei musorok hallhatok, melyekben radiosok (Adamik Tibor, Molnar Aniko, Andreko Geza, Toth Gabor, Patai Bori), illetve zeneszek (Borsodi Laszlo, Hevesi Imre) szerkesztik a musorokat." },
{ "name": "Vertes Center", "streamURL": "https://onlineradiobox.com/json/hu/vertescenter/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/48294.v2.png", "desc": " pop, hits", "longDesc": "Elj szinesen!Ф Ц A Vertes Center megujult szlogenjevel es vidam, elenk szineivel eletet visz a szurke hetkoznapokba." },
{ "name": "Topaz Disco Radio", "streamURL": "https://streamingv2.shoutcast.com/ATopazDiscoRadio", "imageURL": "https://traderblog.net/images/magyarorszag/66524.v8.png", "desc": " r'n'b, disco, pop, soul, 70s, funk", "longDesc": "They play all the best hits of disco music, including the most representative genres of the era, such as Funk, Hustle, Soul, Bump, R &amp; B, Groove, Hi_Energi, Eurodisco, Italo and Reggae, as well as other dance styles of the 70s and early 80s ." },
{ "name": "Lakihegy", "streamURL": "https://onlineradiobox.com/json/hu/lakihegy/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25620.v1.png", "desc": " pop, news, top40", "longDesc": "Hirek, programok, erdekessegek helybol, helyben eloknek. A Lakihegy Radio a Csepel-sziget egyetlen kereskedelmi adoja; Dunaharaszti, Dunavarsany, Szazhalombatta, Szigetszentmiklos es Tokol onkormanyzatanak hivatalos, szerzodeses radioja." },
{ "name": "Music Center Radio", "streamURL": "https://onlineradiobox.com/json/hu/musiccenter/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/48260.v2.png", "desc": " pop", "longDesc": "Ezt a Radiot azert hozzuk letre,mert szeretjuk a zenet,es ezt szeretnenk megosztani a kedves hallgatokkal!" },
{ "name": "Planet-FM", "streamURL": "https://onlineradiobox.com/json/hu/planet/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/48271.v1.png", "desc": " folk, hits", "longDesc": "Udvozlom a Planett-FM NONSTOP  zene!" },
{ "name": "Maxi", "streamURL": "https://onlineradiobox.com/json/hu/maxi/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/26329.v2.png", "desc": " pop, top40", "longDesc": "A MaxiRadio az FM 92.4 MHz-en a varosban sugarozva valamint, hatarok nelkul az interneten foghatoan Gyongyos elso, kozossegi, nonprofit radiojakent, a Gyongyosiek fuggetlen, elfogulatlan szolgalataban mukodik, immar 2014. aprilis ota." },
{ "name": "Panda Radio Szeged", "streamURL": "https://onlineradiobox.com/json/hu/panda1035/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/76796.png", "desc": " dance, rock, pop, country", "longDesc": "Panda Radio Szegedi Studio Hatarok nelkul Ц Hirben es Zeneben! Tekerjen a tobbitol jobbra Fm 103,5 MHz Az Fm 103,5 MHz nem ismer hatarokat." },
{ "name": "Pannonia Radio", "streamURL": "https://onlineradiobox.com/json/hu/pecs/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25758.v5.png", "desc": " pop, news, top40, entertainment", "longDesc": "Pannonia Radio (ex Pecs Radio) az oszinte Radio. Tajekoztat, velemenyez, de fokent szorakoztat. Jo zenekkel, erdekes musorokkal kivan a hallgatok kedvebe jarni." },
{ "name": "Nemzetisegi adasok", "streamURL": "https://onlineradiobox.com/json/hu/nemzetisgiadsok/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24441.v1.png", "desc": " news, top40", "longDesc": "Nemzetisegi adasok Magyar Radio Zrt. - Lakihegy (Budapest)is an internet radio station from Lakihegy, Budapest providing Music and News." },
{ "name": "Szunet Radio", "streamURL": "https://onlineradiobox.com/json/hu/szunet/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/66512.v7.png", "desc": " dance, pop", "longDesc": "Hallgass online barhol a vilagon!" },
{ "name": "CitroMix Radio", "streamURL": "https://citromix.eu/live.mp3", "imageURL": "https://traderblog.net/images/magyarorszag/67689.v8.png", "desc": " dance, electronic, house, rock, pop, jazz, funk", "longDesc": "Udvozlunk mindenkit kedves CitroMix Radio hallgatot. A CitroMix Radio egy online interneten hallhato szolgaltatas." },
{ "name": "FM90 Campus", "streamURL": "https://onlineradiobox.com/json/hu/fm90campus/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25829.v3.png", "desc": " rock, pop, blues, talk, top40", "longDesc": "A 2002. januar 7-en indult Friss Radio, 2013 oktoberetol valtozatlanul igenyes tartalommal, a megszokott szinvonalas musorokkal es kivalo zenekkel, megujult nevvel es meg nagyobb lendulettel szol a 90 MHz-en! Ha mindig friss es aktualis szeretnel maradni a Debreceni Egyetem es a varos eletevel kapcsolatban akkor valassz bennunket!" },
{ "name": "Webradio Balaton", "streamURL": "https://stream.laut.fm/balaton", "imageURL": "https://traderblog.net/images/magyarorszag/51954.v3.png", "desc": " hits", "longDesc": "Hore Deine Wunschmusik und erfahre taglich Neues rund um den See." },
{ "name": "Dunakanyar Radio", "streamURL": "https://onlineradiobox.com/json/hu/dunakanyar/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/71692.v1.png", "desc": " pop, news, talk, sports, entertainment, community", "longDesc": "A Dunakanyar FM 94,1 Radio elsosorban a tersegi hirekre epito, kozszolgalati musorrendu, Vac es szelesebb tersege egyetlen helyi kozossegi radioja. A radio arculatat alapvetoen harom tenyezo hatarozza meg: a helyi jelenlet, az elo musorok es a tobb mint 30 valtozatos musor. Erre epul a teljes musorfolyam, hogy mindenki, aki a vetelkorzetben hallgatja, ugy erezze, nem marad le semmirol sem, ami a varosban vagy a szelesebb tersegeben a mindennapi eletet befolyasolja." },
{ "name": "Nonstop Radio Magyarorszag", "streamURL": "https://onlineradiobox.com/json/hu/nonstop/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/81097.v3.png", "desc": " rock, pop, hits", "longDesc": "Nonstop Radio - csak zene, retrotol a mai slagerekig." },
{ "name": "Radio Maria", "streamURL": "https://onlineradiobox.com/json/hu/radiomaria932/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/23890.v11.png", "desc": " talk, christian, gospel, religious", "longDesc": "A Maria Radio egy katolikus beallitottsagu szervezet kommunikacios eszkoze. Ezt a radiot Magyarorszagon nem a magyar katolikus egyhaz mukodteti, hanem egy alapitvany, mely egy vilagi maganszemely tulajdonaban van. A tulajdonos onbevallasa szerint vilagi apostolkodas celjabol mukodteti a radiot. A radio egy pap iranyitasa alatt van, aki felelos a musorok tartalmaert. A radio fokepp onkentes munkavallalokkal mukodik, akik joszolgalati tevekenyseguket ingyen vegzik." },
{ "name": "Magyar Evangeliumi", "streamURL": "https://onlineradiobox.com/json/hu/magyarevangeliumi/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24410.v1.png", "desc": " religious", "longDesc": "A Magyar Evangeliumi Radio Alapitvany (MERA) egy felekezetkozi evangeliumi radio." },
{ "name": "Tordas Radio", "streamURL": "https://onlineradiobox.com/json/hu/tordas/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/48292.v1.png", "desc": " pop, hits", "longDesc": "A Tordas Radio Magyarorszag legregebbi faluradioja es legtovabb sugarzo kalozradioja volt." },
{ "name": "T-Radio", "streamURL": "https://onlineradiobox.com/json/hu/tradio/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25917.v4.png", "desc": " news, talk", "longDesc": "A Tradio egy olyan magyar radio allomas mely a magyar mentosoknek, tuzoltoknak szol, roluk szol. Friss oket erinto hirekkel, musorokkal varjak oket, akar munka kozben, akar ha eppen friss informaciot akarnanak szerezni az orszagos tortenesekrol." },
{ "name": "X Radio", "streamURL": "https://onlineradiobox.com/json/hu/xradio/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/48297.v4.png", "desc": " pop", "longDesc": "Erezd magad jol!" },
{ "name": "Civil Radio Miskolc", "streamURL": "https://onlineradiobox.com/json/hu/cirmi/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/47672.v3.png", "desc": " news, talk", "longDesc": "A CiRMi radiomusorait napi, tematikus strukturaban sugarozzuk: civilseg, eselyegyenloseg, hatranyos helyzet, zold temak, es allatvedelem, kozelet, kultura, fiatalsag." },
{ "name": "Bravo Hits", "streamURL": "", "imageURL": "https://traderblog.net/images/magyarorszag/26185.v2.png", "desc": " pop, top40", "longDesc": "Bravo Hits Radio plays the hit songs from their popular Hungarian singers. Their playlists are full decorated with Hits music from their hot top musical charts. There are plenty of songs and popular singer in Hungary and Bravo Hits Radio selects those songs which are trending at the moment." },
{ "name": "Bridge fm Hungary", "streamURL": "https://onlineradiobox.com/json/hu/bridgehungary/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/70829.v22.png", "desc": " pop, entertainment, dance pop", "longDesc": "Bridge fm Hungary Hungarian Radio from Almasfuzito Internet Radio Station Hungarian cabaret music and foreign radio plays local radio." },
{ "name": "Radio Orient Press", "streamURL": "https://onlineradiobox.com/json/hu/orientpress/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/71748.v3.png", "desc": " news, talk", "longDesc": "A Radio Orient Budapest 18. keruletenek hivatalos interneten hallgathato radioja, mely nem csak a 18., hanem mas keruletek onkormanyzatainak, kormanyhivatalainak, hatosagainak uleseit dokumentalja es kozvetiti a hallgatosag szamara, egyeb mas musorok mellett." },
{ "name": "Radio Rakospalota", "streamURL": "https://onlineradiobox.com/json/hu/rakospalota/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/73688.v12.png", "desc": " dance, pop, top40", "longDesc": "Kedvenceid egy helyen! Netradio. Neked." },
{ "name": "Radio 64 ch1", "streamURL": "https://onlineradiobox.com/json/hu/64ch1/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/74466.v8.png", "desc": " dance, rock, disco, pop, information, italan", "longDesc": "Beszelgetos musorok, Hirek, Magazinok, Tudomanyos osszeallitasok, Portrek es mas kozossegi es kistersegi musorok a nap 24 orajaban sok zenevel." },
{ "name": "Spitit FM", "streamURL": "https://stream1.hit.hu:8080/spirit1", "imageURL": "https://traderblog.net/images/magyarorszag/81559.v3.png", "desc": " pop, news, talk", "longDesc": "Kozeleti, szorakoztato, spiritualis." },
{ "name": "FRED FILM RADIO", "streamURL": "https://onlineradiobox.com/json/hu/fredfilm/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/46853.v1.png", "desc": " news, talk, entertainment", "longDesc": "FRED Film Radio - the only multi lingual online radio station that brings you the insight on film festivals and film events all around the world!" },
{ "name": "Efj Radio", "streamURL": "https://onlineradiobox.com/json/hu/efj/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/69323.v6.png", "desc": " dance, pop, techno", "longDesc": "Efj Radio - a radionk 2011 olta keszte meg a Radio mukodeset ra 2015 ben mar studionkent vezetjuk az elo adast 06:00-03:00 ig ami aszt jelenti hogy musorvezetok es egyarant / DJ ek szorakoztatja a hallgatokat erdemes minket hallgatni es webkameran nezni mert mi mindig a jo zeneket es slagereket jatszunk mert ez efjradio ami mindig jo zene szol a nap 24 orajaban!" },
{ "name": "Radio Oranzs", "streamURL": "https://onlineradiobox.com/json/hu/oranzs/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/48277.v1.png", "desc": " pop, news, talk", "longDesc": "Az Oranzs Radio egy fiatalos, dinamikusan fejlodo, energikus kozosseg. Stabunk nagy resze epitokari hallgato, de akad koztunk vegzett mernok, valamint mas kar hallgatoja is. Musoraink palettaja igencsak szines, mindenki megtalalja kedvenc zenejet nalunk." },
{ "name": "Radio 2", "streamURL": "https://onlineradiobox.com/json/hu/radio2/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/83705.v2.png", "desc": " dance, electronic, house, r'n'b", "longDesc": "Radio 2 - Kedvencekre Hangolva!" },
{ "name": "Forrasmedia Radio", "streamURL": "https://onlineradiobox.com/json/hu/forrasmedia/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25511.v3.png", "desc": " pop, top40", "longDesc": "A Forras Media Studio musorai a Biblia evangeliumat - kiemelt hangsullyal Jezus masodik eljovetelet - hirdeti a TV-es radioadasokon keresztul." },
{ "name": "Erd Most", "streamURL": "https://onlineradiobox.com/json/hu/erdmost/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/74369.v1.png", "desc": " pop, news, talk", "longDesc": "Az ErdMost.hu mind arculataban, mind tartalmaban szines, ergonomikus, izgalmas formaban tajekoztatja az Erden es a regioban eloket, az oket erinto legfontosabb hirekrol, esemenyekrol. Az ErdMost.hu a regio meghatarozo mediuma, amelyre hivatkozik az orszagos sajto, de cikkeiben, tudositasaiban targyalt temait rendszeresen idezik erdi es kornyekbeli internetes forumokon is." },
{ "name": "Radio Space", "streamURL": "https://onlineradiobox.com/json/hu/radiospace/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/78292.v8.png", "desc": " pop, hip-hop, hits", "longDesc": "Radio Space online radioallomas kiterjedt lejatszasi listaval rendelkezik, amely jo hangulatban tartja az egesz napot a dalok lejatszasaval. Radio Space csak a legjobb kezfogasu zenet jatszik a fulehez." },
{ "name": "AdventNET Radio", "streamURL": "https://onlineradiobox.com/json/hu/adventnet/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/74580.v4.png", "desc": " talk, christian, religious", "longDesc": "Celkozonsegunket kepezik mindazok az emberek, akik nem erzik jol magukat ebben az embertelen vilagban, akik valami tobbet es jobbat keresnek, mint ami a vilagbol reajuk omlik. Musoraink nagy reszet oktatasi, nevelesi, az egeszseges eletmodra osztonzo es lelki tanitasokat kozlo eloadasok teszik ki, melyek segithetnek egy magasabb rendu Ц nem a tomeggel valo egyutt sodrodas jellegu Ц elet eleresehez." },
{ "name": "Periszkop", "streamURL": "https://onlineradiobox.com/json/hu/periszkop/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25243.v1.png", "desc": " adult contemporary", "longDesc": "A Periszkop Radio (roviden: Peri) egy nonprofit kiskozossegi radio. Zomeben reteg- es kortars zenei musorokat sugaroz, valamint nem titkolt celja befogadni mindazon zenei szelsosegeket, melyek Magyarorszagon kikerultek a mediabol. Szekhelye Pecsett van, musorkeszitoi azonban a profilbol adodoan tavoli varosokbol es kulfoldrol is kuldenek adasokat." },
{ "name": "RoyalMusic Radio", "streamURL": "https://onlineradiobox.com/json/hu/royalmusic/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/76932.v5.png", "desc": " electronic", "longDesc": "Radionk celja minel szelesebb zenei korosztaly kiszolgalasa!Remeljuk radionk elnyeri a tetszeseteket...  Udvozlettel a Royal Music radio csapata." },
{ "name": "Crazy FM", "streamURL": "https://onlineradiobox.com/json/hu/crazyfm/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/26186.v3.png", "desc": " top40, variety", "longDesc": "Crazy FM is broadcasting from Miskolc, Hungary and playing house music 24 hours. This hungarian radio is now very popular." },
{ "name": "Tarjan Radio", "streamURL": "https://onlineradiobox.com/json/hu/tarjan/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/71341.v6.png", "desc": " dance, pop, top40", "longDesc": "Tarjan Radio | Salgotarjan, Nograd megye kedvencei nalunk szolnak! | Nektek szol, barhol, barmikor, ONline | Minden nap 8-20-ig" },
{ "name": "FreshFM", "streamURL": "https://onlineradiobox.com/json/hu/freshfmhungary/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/62376.v5.png", "desc": " dance, rock, top40", "longDesc": "FreshFM - Osszekot a zene! Magyarorszag kedvenc profi kiskozossegi radioja varja lelkes radiozni vagyok jelentkezeset. Termeszetesen privat uzenetben. Facebook elerhetosegunk: www.facebook.hu/freshfmhungary Kellemes radiozast kivanunk! :)" },
{ "name": "I Love Pecs Radio", "streamURL": "https://onlineradiobox.com/json/hu/ilovepecsradio/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/75461.png", "desc": " dance, pop, hip-hop, hits", "longDesc": "Az I love Pecs Radio csak hazai eloadok dalait forgatja, azok kozul is az ertekes, mondanivaloval rendelkezo, underground, alternativ rock, hip-hop es popzeneket, hiszen ezekben a stilusokban alkot a pecsi zenekarok tobbsege." },
{ "name": "Up&amp;Down Music Radio", "streamURL": "", "imageURL": "https://traderblog.net/images/magyarorszag/74875.v7.png", "desc": " dance, electronic, house, disco, retro, dj", "longDesc": "The latest hits, Disco feeling, entertainment" },
{ "name": "Bajai", "streamURL": "https://onlineradiobox.com/json/hu/baja/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/23893.v4.png", "desc": " pop, top40", "longDesc": "Bajai Radio is a broadcast radio station from Baja, Bacs-Kiskun Province, Hungary providing World music and program." },
{ "name": "Picur", "streamURL": "https://onlineradiobox.com/json/hu/picur/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24409.v1.png", "desc": " talk, children, adult contemporary", "longDesc": "Picur Radio is an internet radio station from Budapest, Hungary providing Music, stories, songs, rhymes for kids throughout the day with high quality and Adult Contemporary music too." },
{ "name": "Som", "streamURL": "https://onlineradiobox.com/json/hu/som/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25730.v2.png", "desc": " pop, top40", "longDesc": "Az FM 99.5 frekvencian elerheto Radio Som Fehergyarmat elso radiojakent ismert, ugyanakkor a kornyezo telepuleseken is hallhato az adas. A Radio Som igen valtozatos musorkinalattal igyekszik lebilincselni hallgatoit mar 2011 ota. Minden reggel 6 orakor kezdik az adast a 10-ig tarto reggeli musorral, amiben zene, hirek es horoszkop is hallhato. Termeszetesen nem hianyozhatnak a kinalatbol a magazinmusorok sem, amibol komolyabb es konnyedebb hangvetelu is megtalalhato a kinalatban." },
{ "name": "Drava Hullam", "streamURL": "https://onlineradiobox.com/json/hu/aqua/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/23896.v1.png", "desc": " soft", "longDesc": "A barcsi helyi kommunikacio ket alappillere a Hid Televizio es a Drava Hullam. A Drava Hullam az FM 102,7 frekvencian korulbelul 25000 embert er el Del-Somogyban." },
{ "name": "Party-Radio", "streamURL": "https://stream.party-radio.eu:2053/live.mp3", "imageURL": "https://traderblog.net/images/magyarorszag/82452.png", "desc": " pop, talk", "longDesc": "hungarian radio station proposing a big variety of music, fun and shows." },
{ "name": "Credo", "streamURL": "https://onlineradiobox.com/json/hu/credo/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/26253.v3.png", "desc": " news, talk, top40, gospel", "longDesc": "A szombathelyi Credo Radio egy, az evangelikus hit alapjait, tanait es ertekeit kozvetito radio. Bar egy vallasos radiorol van szo, musorai megsem merulnek ki a vallasi temakban, hanem ennel joval messzebbre nyulnak, mint peldaul zenei elemzes, allatok bemutatasa stb." },
{ "name": "Csillagpont", "streamURL": "https://onlineradiobox.com/json/hu/csillagpont/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25910.v2.png", "desc": " talk, adult contemporary", "longDesc": "A Csillagpont Radio mint az orszag elso es egyetlen tematikus egeszseg radioja 2010-2017 kozott kiskoztossegi radiokent, a miskolci FM 94 MHz-en volt hallhato. 2018. marcius 8-atol a miskolci FM 103 MHz-en hallhato Csillagpont Radiot a ДB.-A.-Z. Megye BetegeiertФ Alapitvany mukodteti." },
{ "name": "Smile", "streamURL": "https://onlineradiobox.com/json/hu/smile/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24431.v2.png", "desc": " pop, news, top40", "longDesc": "A Radio Smile Kiskunfelegyhaza varos helyi (kozossegi) radioja, amely immaron 10 eve, 2008 novembere ota hallhato Kiskunfelegyhazan az FM 89.9 MHz-en es kistersegeben, valamint Online. Musorkinalata szorakoztato, kulturalis, magazin es zenei musorszamokbol all, de termeszetesen betolti a helyi radio alapveto funkciojat is: a terseg legfrissebb, legfontosabb hireirol hitelesen informalja a hallgatokat. Szerkesztett musoraink 0-24h-ban hallhatoak." },
{ "name": "Music Radio Online Hungary", "streamURL": "", "imageURL": "https://traderblog.net/images/magyarorszag/76849.v6.png", "desc": " dance, electronic, trance, house, techno", "longDesc": "Music Radio - Kedvencekre Hangolunk!" },
{ "name": "Lepes Radio", "streamURL": "https://onlineradiobox.com/json/hu/lepes/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/26325.v1.png", "desc": " pop, news, top40", "longDesc": "Egy Lepessel Kozelebb Hozzad!" },
{ "name": "Radio Bezs", "streamURL": "https://onlineradiobox.com/json/hu/bezs/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25746.v2.png", "desc": " pop, top40", "longDesc": "Hallgasd online Magyarorszag elso noknek szolo internetes radiojat a Radio Bezst. A Bezs 2015 februar 2-an indult utjara, melynek alapitoja Fodor Janos. A radio celja a noi kozosseg epitese. A 30 feletti gondolkodo noket probalja megszolitani. Azonban remelik, hogy egyre tobb ferfi is hallgatja majd a radiot, hogy tobbet megtudjanak a nokrol." },
{ "name": "Momo", "streamURL": "https://onlineradiobox.com/json/hu/momo/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25753.v3.png", "desc": " top40, children", "longDesc": "A Momo Radio egy szorakoztato, jatekos, ismeretterjeszto radio ovodasoknak, es kisiskolasoknak. A Momo Radio azzal a cellal jott letre, hogy az interneten keresztul, a zenek es a mesek altal fejlessze a gyermekek kreativitasat es fantaziajat, valamint nepszerusitse a magyar gyermekzeneket, meseket, mesejatekokat." },
{ "name": "Egerszeg Radio", "streamURL": "https://onlineradiobox.com/json/hu/egerszeg951/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/76997.v2.png", "desc": " dance, pop, news, hits", "longDesc": "Az EGERSZEG RADIO legfontosabb celkituzese a helyi lakossag friss es hiteles informaciokkal valo ellatasa. Radionk segitsegevel a leggyorsabban tajekozodhatnak a hallgatok arrol, hol van utlezaras a varosban, hol neheziti baleset a kozlekedest, milyen rendezvenyek lesznek a vonzaskorzetben, milyen donteseket hozott a varos kozgyulese, hogyan fejlodik a gazdasag, mi tortenik a helyi intezmenyekben." },
{ "name": "Up&amp;Down Disco Radio", "streamURL": "https://streamingV2.shoutcast.com/UP-DOWNDISCORADIO", "imageURL": "https://traderblog.net/images/magyarorszag/78914.v9.png", "desc": " dance, house, disco, techno, hip-hop, lectro", "longDesc": "The latest hits, Disco feeling, entertainment Our goal is to present fresh hits, party hits, and disco successes." },
{ "name": "Alpha", "streamURL": "https://onlineradiobox.com/json/hu/alpha/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25944.v2.png", "desc": " jazz, news", "longDesc": "Az Alpha Radio tematikus musorszerkezettel az allattarto es allatszereto fehervari lakosoknak szol, legfokeppen allatokrol , azok tartasarol, betegsegeikkel kapcsolatos teendokkel jo tanacsokkal latja el hallgatoit." },
{ "name": "Radio Daruvar", "streamURL": "https://onlineradiobox.com/json/hu/daruvar/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24901.v2.png", "desc": " talk, sports", "longDesc": "Radio Daruvar 2008th year full 40 years. Oldest in the Bjelovar-Bilogora. Founded May 1, 1968th year as urban radio stations." },
{ "name": "Mustar FM", "streamURL": "https://onlineradiobox.com/json/hu/mustarfm/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25933.v1.png", "desc": " variety", "longDesc": "A Kulturalis Eletert Kozhasznu Egyesulet 2006 januarja ota mukodteti a Mustarhaz Ifjusagi Informacios es Tanacsado Irodat. A Mustarhaz azzal a cellal jott letre, hogy segitse a varosban elo, tanulo fiatalok informalodasat es tanulasat, ertekes szabadidos lehetoseget, szorakozasi alternativat nyujtson szamukra, tamogassa onszervezodo csoportok letrejottet es mukodeset, reszt vegyen a helyi fiatalok eletenek formalasaban." },
{ "name": "Radio Orient", "streamURL": "https://onlineradiobox.com/json/hu/orient/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/48279.v1.png", "desc": " rock, pop, talk, classic, instrumental", "longDesc": "Radio Orient is a broadcast radio station in Budapest, Hungary, providing different genres of music." },
{ "name": "Sola Radio", "streamURL": "https://onlineradiobox.com/json/hu/sola/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/76368.png", "desc": " talk, gospel", "longDesc": "A SOLA Radio (Budapest 101,6 MHz) 24 oras vallasi musoranak celja a kereszteny hit es ertekrend alapjain szolgalni, tajekoztatni hallgatoit." },
{ "name": "Kerepes", "streamURL": "https://onlineradiobox.com/json/hu/kerepes/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24949.v3.png", "desc": " news, talk", "longDesc": "Kerepes Radio 97.1 is a broadcast Radio station from Kerepestarcsa, Hungary, providing Hungarian Folk, Dance, Pop and Hit Music." },
{ "name": "Sztrada Radio", "streamURL": "https://onlineradiobox.com/json/hu/sztrada/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/71615.v1.png", "desc": " dance, pop, talk, top40", "longDesc": "Mi szallitjuk leggyorsabban a jokedvet!" },
{ "name": "CEU Medieval", "streamURL": "https://onlineradiobox.com/json/hu/ceumedieval/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24401.v4.png", "desc": " easy listening", "longDesc": "CEU Medieval Radio is a non-profit webcast run by the members of Central European UniversityТs Medieval Studies Department to popularize medieval and early modern music, history, and culture. Enjoy our unique selection of authentic pre-1700 music." },
{ "name": "Sansz", "streamURL": "https://onlineradiobox.com/json/hu/sansz/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25823.v4.png", "desc": " christian", "longDesc": "Sansz 87.8 FM radio station live broadcast in Hungary, Religion sections." },
{ "name": "Sarvar Radio", "streamURL": "https://onlineradiobox.com/json/hu/sarvar/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/79607.v1.png", "desc": " pop, news, hits", "longDesc": "A Sarvar Radioval naprakesz lesz az aktualis programokrol, a helyi idojarasrol, kozlekedesi hirekrol vagy eppen az evfordulokrol!" },
{ "name": "Fresh Music Radio", "streamURL": "https://onlineradiobox.com/json/hu/freshmusic/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/75867.v1.png", "desc": " 90s, 80s, 70s", "longDesc": "A Freshmusic Radio valtozatos zenei palettaval rendelkezo radiova valt. Ahol megfernek egymas mellett a ma nepszeru zenei stilusok es a 70-es, 80-as, 90-es evek zenei." },
{ "name": "Hobby Radio", "streamURL": "https://onlineradiobox.com/json/hu/hobby/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/24904.v1.png", "desc": " top40, adult contemporary", "longDesc": "A Hobby Radio egy nonprofit medium, ahol az alabbi temakkal foglalkoznak: kultura, szocialisugy, fogyatekkal elo emberek mindennapjai, egeszsegugy; valamint az elmult evtizedek pop-rock slagerei egesz nap. Az oldalon online kivansagmusor is talalhato: amit kersz, az lesz a kovetkezo dal!" },
{ "name": "Pont", "streamURL": "https://onlineradiobox.com/json/hu/pont/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/26354.v1.png", "desc": " dance, electronic, top40", "longDesc": "Pont Radio station mostly time play Top 40, Pop, Electronic and Dance music. Pont Radio live broadcasting from Mezotur, Hungary. Pont Radio also play 24 hours various kind of music genres." },
{ "name": "PAKS FM", "streamURL": "https://onlineradiobox.com/json/hu/fortuna/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25170.v3.png", "desc": " news, sports, culture, entertainment", "longDesc": "Fortuna FM 96.3 is a broadcast radio station from Paks, Hungary providing local news, national cultural, political and sporting events, information and entertainment." },
{ "name": "Top", "streamURL": "https://onlineradiobox.com/json/hu/top/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25913.v1.png", "desc": " pop, top40", "longDesc": "Kazincbarcika es a kornyek radioja!" },
{ "name": "SpaceFM", "streamURL": "https://onlineradiobox.com/json/hu/space/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/76686.v3.png", "desc": " 90s, hits", "longDesc": "A SpaceFM egy kerekegyhazi szekhelyu online kozossegi radio, amely 2014. januar 6-an kezdte meg 24 oras musorszolgaltatasat az interneten. A radio fiatalos hangvetelenek koszonhetoen rovid idon belul nagy nepszerusegre tett szert Kerekegyhazan es kistersegeben, celcsoportunk elsosorban a 15-40 eves korosztaly. Zenei stilusunk elsodlegesen az uj evezred es napjaink slagereinek otvozete, megfuszerezvezve ezt az elmult evtizedek legnagyobb kedvenceivel." },
{ "name": "Up&amp;Down 4ever Rock Radio", "streamURL": "", "imageURL": "https://traderblog.net/images/magyarorszag/75916.v13.png", "desc": " rock, hard rock, rock'n'roll, metal, oldies", "longDesc": "Rock will live forever, because it can be renewed and born again. This is thanks to the creative artists." },
{ "name": "Dabas", "streamURL": "https://onlineradiobox.com/json/hu/dabas/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25621.v2.png", "desc": " pop, top40", "longDesc": "A Radio Dabas 2007 nyaran kezdte meg a mukodeset az FM 93.4-en. Az ado nem csupan Dabason, hanem annak 50 kilometeres korzeteben hallgathato. A radio alapveto celja, hogy a kornyek lakossaganak hiteles informaciokat nyujtson a terseg torteneseirol, a leheto leggyorsabban. A dolgozok fontos torekvese, hogy szorakoztato, erdekes, ugyanakkor elgondolkodtato musorokkal szolgalhassanak a hallgatok szamara. Emellett termeszetesen nem hianyozhatnak a jo es igenyes zenek sem, kiemelt figyelmet forditva a magyar eloadok dalaira." },
{ "name": "Regina radio", "streamURL": "https://onlineradiobox.com/json/hu/regina/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/80896.v4.png", "desc": " retro, 90s, 80s, 70s, 60s, 50s", "longDesc": "Az elmult evezred utolso fel evszazadanak kedvelt retro slagerei. Non-stop zene." },
{ "name": "Bredd Radio", "streamURL": "https://onlineradiobox.com/json/hu/bredd/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/47667.v8.png", "desc": " pop, news, talk, entertainment", "longDesc": "A Bredd Radio a nap 24 orajaban szorakoztatja hallgatoinkat zenevel, musorvezetokkel, sztarvendegekkel, eloadasokkal es video kozvetitessel!" },
{ "name": "Evergreen Radio HU", "streamURL": "https://listen.shoutcast.com/001evergreenradioworld", "imageURL": "https://traderblog.net/images/magyarorszag/84020.v3.png", "desc": " pop, retro, 90s, 80s, 70s, oldies, 60s, hits", "longDesc": "A halozat tagja az Evergreen radioallomasok online. A legjobb regi zene a '60 .-90-es evekbol." },
{ "name": "Magic world radio", "streamURL": "https://onlineradiobox.com/json/hu/magicworld/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/76994.v2.png", "desc": " dance, pop", "longDesc": "Stilusutazas Miss Bossal a Magic World Radioban - itt mindig a legjobb zenek szolnak" },
{ "name": "Synthwave Retrowave Radio", "streamURL": "https://onlineradiobox.com/json/hu/synthwaveretrowave/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/83562.v6.png", "desc": " retro, variety", "longDesc": "Synthwave, retrowave, outrun, darksynth, cyberpunk and some vaporwave musics on air." },
{ "name": "YO! Radio", "streamURL": "https://onlineradiobox.com/json/hu/yo/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25947.v2.png", "desc": " pop, top40, adult contemporary", "longDesc": "Valtozatos, YO! es ropogos! Ne habozz, hallgasd a YO!-t! Igazi fulbemaszo muzsikak a nap 24 orajaban napszaktol fuggetlenul! Szoval fiatalok es orok fiatalok nalunk mindenki megtalalja a kedvencet!" },
{ "name": "Online Music Radio", "streamURL": "https://onlineradiobox.com/json/hu/onlinemusic/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/81311.v4.png", "desc": " dance, electronic, house, club", "longDesc": "Music Radio Magyarorszag uj online radioja, ahol csak is a kedvenc zened szol ejjel-nappal.." },
{ "name": "Latszoter", "streamURL": "https://onlineradiobox.com/json/hu/latszoter/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/25272.v1.png", "desc": " folk, entertainment", "longDesc": "Latszoter Radio is a web based internet radio station from Szoke, Hungary." },
{ "name": "Up&amp;Down Top Rock Radio", "streamURL": "https://streamingv2.shoutcast.com/Up-DownTopRockRadio", "imageURL": "https://traderblog.net/images/magyarorszag/80180.v6.png", "desc": " rock, hard rock, metal", "longDesc": "Rock will live forever, because it can be renewed and born again. This is thanks to the creative artists." },
{ "name": "Richard Radio", "streamURL": "https://icecast.richardradio.hu:8443/live", "imageURL": "https://traderblog.net/images/magyarorszag/69091.v5.png", "desc": " dance, talk, top40", "longDesc": "2014. november 19-en alapitottuk a Richard Radiot, mely idokozben tobbszor atalakult, jelenleg non-profit egyesuleti formaban mukodik. Elsodleges celunk kezdetektol fogva valtozatlanul azt bizonyitani, hogy fiatalok altal, nonprofit formaban is lehet szinvonalas, nepszeru online radiot uzemeltetni. Tovabbi celunk az altalanos iskolas es kozepiskolas gyerekeknek a media teruleten megmutatkozo tehetsegenek felismerese, kibontakoztatasanak segitese,a media vilaganak bemutatasa es tevekenysegunk megismertetese.szeptemberben elismero oklevelet kaptunk, illetve a 2016-os adatok alapjan elnyertuk ДMagyarorszag Leghallgatottabb Online RadiojaФ megtisztelo cimet." },
{ "name": "Karakter radio", "streamURL": "https://onlineradiobox.com/json/hu/karakter/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/78899.v4.png", "desc": " rock, heavy metal, blues, alternative rock", "longDesc": "Rock, Heavy Metal 0-24h." },
{ "name": "Webcentrum", "streamURL": "https://onlineradiobox.com/json/hu/webcentrum/play?platform=web", "imageURL": "https://traderblog.net/images/magyarorszag/78842.v5.png", "desc": " dance, disco, pop", "longDesc": "Webcentrum Radio - Dance, eurodisco, pop" }
]
}
