{
"station":
[
{ "name": "DDM Radio", "streamURL": "https://onlineradiobox.com/json/ie/ddm/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7078.v6.png", "desc": " dance, electronic, trance, house, top40", "longDesc": "DDM Radio Ireland WE Play The Right Kind of Music All The Time We are Dublins Dance Machine. There Are Regular Guests on The Station So Tune in For This Truly Live Dance Experience. We Stream The Best Top40 Dance Tracks World Wide 24/7 DDM Radio Ireland is an Independent Non Profit Radio Station Based in Dublin Playing Nothing But The Best Dance, Trance, Top 40, House, Electronic, Eurodance &amp; New 24hrs a Day!!!!" },
{ "name": "Highland Radio", "streamURL": "https://pri.gocaster.net/highlandradio", "imageURL": "https://traderblog.net/images/ireland/7699.v2.png", "desc": " news, talk", "longDesc": "Ireland's No1 Local Radio Station and the only onair and online news service dedicated to Donegal, Derry and Tyrone. Your local news is free, no matter where you are!" },
{ "name": "Heartbeat FM", "streamURL": "https://onlineradiobox.com/json/ie/heartbeatfm/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7360.v4.png", "desc": " 80s", "longDesc": "Welcome to the on-line home of Heartbeatfm.net. Our playlist includes YesterdayТs Favourites mixed with todayТs new music! We call it УThe internetТs most romantic music mix!Ф Start your day the Heartbeat way. Heartbeat is the station that will pick you up and make you feel good ALL day! Make Heartbeat FM your number one internet station. Broadcasting online 24/7 365 days a year." },
{ "name": "Clare FM", "streamURL": "https://edge-audio-01-cr.sharp-stream.com/clarefm.aac", "imageURL": "https://traderblog.net/images/ireland/8031.v3.png", "desc": " news, sports, irish, adult contemporary", "longDesc": "Clare's number 1 radio station. Broadcasting to counties Clare, Limerick, Galway, and surrounds. All the latest news, sports, and entertainment. With the best music mix, and traditional irish music shows each weeknight." },
{ "name": "Tipperary Mid West Radio", "streamURL": "https://onlineradiobox.com/json/ie/tippmidwest/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7739.v2.png", "desc": " pop, news, country, sports", "longDesc": "Tipperary Mid West Community Radio is a radio station serving Tipperary, Cashel and south county Tipperary on 104.8fm, 106.7fm and online. We broadcast music, local news, gig guides, Tipperary death notices and a variety of programmes of interest to the local community." },
{ "name": "All Gold", "streamURL": "https://onlineradiobox.com/json/ie/allgold/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/8107.v5.png", "desc": " 90s, 80s, 70s, 60s", "longDesc": "All Gold Internet Radio plays Superhits from the 60's, 70's &amp; 80's. Online 24/7 from Dublin, Ireland. Music station playing all your favourite memories 24/7 commercial free. To maximise your listening experience we have carefully chosen all the music in our playlist. We have taken the best tracks from the Top 100 singles of each year from 1960 to 1989. Added to the mix are some of those big radio songs which were never quite the hits they deserved to be but are instantly recognisable." },
{ "name": "Absolute Irish Radio", "streamURL": "https://stream.audioxi.com/IRISHAAC", "imageURL": "https://traderblog.net/images/ireland/73968.v3.png", "desc": " folk, country", "longDesc": "Absolute Irish is IrelandТs newest radio station playing non-stop Country and Irish music. Reflecting the massive popularity of Irish country music, СAbsolute Irish' will broadcast from its base in Waterford 24 hours per day, seven days a week. Irish country music is huge and continues to sell out venues across Ireland. It is now a massive industry with growing followers, young and old, and will Ц no doubt Ц be very well received by music fans. With dedicated shows on most local radio stations across Ireland, Absolute Irish no doubt whet the appetite of Country and Irish music fans across Ireland. Absolute Irish Radio is playlisted to showcase the new and popular Country artists while playing the classic Irish songs that we all grew up listening to." },
{ "name": "Birdhill Radio", "streamURL": "https://onlineradiobox.com/json/ie/birdhill/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7733.v1.png", "desc": " pop, folk, country, top40", "longDesc": "Irish and Country Music Live Radio from Ireland playing the best folk radio web radio american country Live ireland Irish Radio Chat and news 24/7 Internet Radio Coutry folk dance music Birdhill Radio Birdhill Co." },
{ "name": "FM104 Radio", "streamURL": "https://wg.cdn.tibus.net/fm104MP3128", "imageURL": "https://traderblog.net/images/ireland/7126.v2.png", "desc": " rock, pop, top40, adult contemporary", "longDesc": "FM104 is a broadcast radio station in Dublin, Ireland, providing Top 40 Adult Contemporary Pop and Rock music." },
{ "name": "Ocean FM", "streamURL": "https://onlineradiobox.com/json/ie/ocean/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7597.v7.png", "desc": " adult contemporary", "longDesc": "Ocean FM is a full service local radio station providing programming that appeals to all adults with a particular focus on people aged 25 years and older. Our service is based on a philosophy of Уlocal firstФ with local news, sport, current affairs and talk programming forming the backbone of our programme schedule." },
{ "name": "1 Music", "streamURL": "https://s2.radio.co/s76d0d2fd1/listen", "imageURL": "https://traderblog.net/images/ireland/74252.v11.png", "desc": " electronic, hip-hop", "longDesc": "The World's New Music Station from Studios all around the Globe. New Music Now!" },
{ "name": "Galway Bay FM", "streamURL": "https://wg.cdn.tibus.net/galwaybay.mp3", "imageURL": "https://traderblog.net/images/ireland/7633.v2.png", "desc": " news, talk, adult contemporary", "longDesc": "Galway Bay FM is a broadcast radio station in Galway, Ireland, providing Community News and Entertainment on a variety of stations in the Galway area. The programming format is a mixture of music, news, sport, current affairs and local issues.[3] Programmes are generally in English, although the station features some Irish language programmes. There is an opt-out service with alternative programming for Galway city on weekday evenings using the 95.8 MHz frequency." },
{ "name": "Ireland&#39;s ABC Christmas", "streamURL": "https://onlineradiobox.com/json/ie/christmas/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7933.v2.png", "desc": " christmas", "longDesc": "ABC Christmas brings the best Christmas songs from the 40s to today,24/7 Clutterfree ..We start on November 1st every year (since 2012) till early January...Christmas never sounded better... Christmas music comprises a variety of genres of music normally performed or heard around the Christmas season, which tends to begin in the months leading up to the actual holiday and end in the weeks shortly thereafter." },
{ "name": "Beat 102-103 FM", "streamURL": "https://stream.audioxi.com/BEATAAC", "imageURL": "https://traderblog.net/images/ireland/7794.v2.png", "desc": " pop, talk, top40", "longDesc": "Beat 102-103 Your Music Now : upbeat new and recent music with broad appeal to young adults combined with news and talk programming for South East Ireland.... The Уgo toФ multi-platform radio station for entertaining &amp; informing young adults in the South East which is irresistible to advertisers." },
{ "name": "Cork&#39;s Red FM", "streamURL": "https://edge.audioxi.com/RED", "imageURL": "https://traderblog.net/images/ireland/7654.v5.png", "desc": " pop, top40", "longDesc": "Cork's RedFM is an Irish radio station which broadcasts to Cork and the surrounding area, and is aimed at a youth audience. Breakfast with Ray &amp; Jay | Neil Prendeville| Philip Bourke| Dave Mac | Izzy | Colm and many more great shows." },
{ "name": "Classix", "streamURL": "https://onlineradiobox.com/json/ie/classix/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7852.v1.png", "desc": " dance, 90s", "longDesc": "We're an online radio station streaming only high quality, full length mixes of all the best '90s dance tracks. All the music in our library has been recorded and stored in the highest quality. In fact, we were right there in Abbey Discs every week religiously searching for the must have new releases. So, everything we play is from our own collections of CD singles, compilation albums and vinyl releases." },
{ "name": "Storm North East", "streamURL": "https://onlineradiobox.com/json/ie/stormnortheast/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/8162.png", "desc": " dance", "longDesc": "Hi and welcome to Non Stop Storm - The NW's and NE's ONLY locally sourced youth orientated radio station, broadcasting 24 hours a day, FROM the area, FOR the people of the area. Accept only the original, not cheap imports. Broadcasting continuously since 2002 From Paul van dyk to Afrojack to Hardwell and more we are the number one dance station in the North East." },
{ "name": "Funky Ass Tunes", "streamURL": "https://onlineradiobox.com/json/ie/funkyasstunes/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7280.v1.png", "desc": " lounge, soul, funk", "longDesc": "Funky Ass Tunes is an internet radio station from Dublin, Ireland, providing Funk, Soul, Rare Groove and Lounge music." },
{ "name": "WLR FM", "streamURL": "https://stream.audioxi.com/WLRAAC", "imageURL": "https://traderblog.net/images/ireland/7779.v5.png", "desc": " rock, news, talk", "longDesc": "WLR FM is one of Ireland's quality local Radio Stations and the domint media force in the South East. The station's share of the radio audience is considerably larger than that of the tiol channels and the quality and diversity of programmes attracts over 71% of all adults each week. WLR FM broadcasts 24 hours a day from state of the art studios in both Waterford City and Dungarvan." },
{ "name": "Easy Radio", "streamURL": "https://onlineradiobox.com/json/ie/easy/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7444.v3.png", "desc": " pop", "longDesc": "Easyradio Lovesongs FM 91.6 is a broadcast radio station from Dublin, Ireland, providing Easy Listening, Love music. At present no other station is providing the music content that we are providing and as long as this remains the case we see no reason why we should not remain on-air. Easy Radio Ц Great music is just." },
{ "name": "RTE Radio 1", "streamURL": "https://onlineradiobox.com/json/ie/rtradio1/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7146.v5.png", "desc": " news, talk, sports", "longDesc": "RTE is Ireland's national Public Service Broadcaster, serving the public by telling the stories of Ireland's relationship with itself and with the rest of the world. RTE Radio 1 features News and Current Affairs, sport, arts, business &amp; documentaries." },
{ "name": "Irish Pub Radio", "streamURL": "https://onlineradiobox.com/json/ie/irishpub/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7928.v12.png", "desc": " folk, ethnic, irish, balada", "longDesc": "Irish Pub Radio is based in the heart of Ireland. Broadcasting Irish Music digitally via the internet , 24 hours a day to Irish Pubs all over the world. Irish Pub Radio plays Irish Folk &amp; Ballads worldwide. Music telling stories about Ireland's people, places &amp; the situations they sometimes find themselves in." },
{ "name": "All 80s", "streamURL": "https://onlineradiobox.com/json/ie/all80s/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7019.v1.png", "desc": " top40, 80s", "longDesc": "All 80s is a broadcast radio station from Dublin, Ireland proving 80's and Top 40 music." },
{ "name": "Zenith Classic Rock", "streamURL": "https://onlineradiobox.com/json/ie/zenithclassicrock/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7798.v6.png", "desc": " classic rock", "longDesc": "Zenith Classic Rock is run by true Classic Rock enthusiasts Е.well, we like to think so !!!Alright, the format isn't purely 'Classic Rock', itТs more a fusion, a hybrid, a mish-mash (a carefully constructed one) of Classic Rock tracks, album tracks, songs that mean something to people of a certain age that listened to Radio Caroline, some of the Irish 80s pirates and maybe 70s American FM radio. So sue us!!!" },
{ "name": "Ciao World Radio", "streamURL": "https://stream.radiojar.com/2sfp8mz5tyduv", "imageURL": "https://traderblog.net/images/ireland/54295.v2.png", "desc": " country, 90s, 00s, 80s, 70s, oldies, 10s, hits", "longDesc": "Playing the best hits from across the decades!" },
{ "name": "Rebel Ska and Reggae", "streamURL": "https://onlineradiobox.com/json/ie/rebelskareggae/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/79552.v3.png", "desc": " reggae, ska", "longDesc": "The best reggae, ska and rocksteady!" },
{ "name": "Radio Kerry", "streamURL": "https://edge.audioxi.com/KERRY", "imageURL": "https://traderblog.net/images/ireland/7745.v6.png", "desc": " pop, news, sports", "longDesc": "Radio Kerry is the local radio station for County Kerry. The weekly listenership is 88,000 or 76% of all adults in Kerry aged 15+ according to the latest IPSOS/JLNR listenership research. Providing Community News, Information and Entertainment." },
{ "name": "Live 95FM", "streamURL": "https://wg.cdn.tibus.net/Live95fm", "imageURL": "https://traderblog.net/images/ireland/7701.v3.png", "desc": " pop, talk", "longDesc": "Limerick's Live 95FM is the local radio station for Limerick City and County and its entire focus is on serving the needs and reflecting the concerns and interests of the people of the area and their interaction with the wider Mid-West region." },
{ "name": "Now FM", "streamURL": "https://onlineradiobox.com/json/ie/now/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/73574.v2.png", "desc": " dance", "longDesc": "Welcome to DublinТs newest radio station NOW FM! WeТve put together the hottest recommended DJТs in Dublin and giving them free reign to bring you the listener the best in dance and chart music. News? Nah, Music? Now Your Talking! More music less talking is our motto. We like to think people actually switch a radio station on to listen to music. ThatТs what we are all about." },
{ "name": "Gem Radio Gold", "streamURL": "https://onlineradiobox.com/json/ie/gemradiogold/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7430.v1.png", "desc": " classic rock, 80s, 70s", "longDesc": "Playing the best in New Wave, Punk and Alternative music from the 80's.The Sweet...remember them? What about Fleetwood Mac, Abba, The Rolling Stones, T-Rex, Spencer Davis Group?They're all here, on Gem Radio Gold." },
{ "name": "Kiss FM", "streamURL": "https://onlineradiobox.com/json/ie/kissfm/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7815.v4.png", "desc": " dance, pop, top40, adult contemporary", "longDesc": "Kiss FM Ireland is an internet radio station from Wexford, Ireland, providing Adult Contemporary Pop Dance music. Your Maximum Music Station Online Top-40 Dance station from Dublin Ireland 24/7 ClutterFree" },
{ "name": "Classic Dance Hitz", "streamURL": "https://streams.radio.co/s7a933605c/listen", "imageURL": "https://traderblog.net/images/ireland/71375.v2.png", "desc": " dance, electronic, trance, house, club", "longDesc": "Nonstop Dance classics 24/7" },
{ "name": "SPIN 1038", "streamURL": "https://stream.audioxi.com/SP", "imageURL": "https://traderblog.net/images/ireland/7190.v4.png", "desc": " electronic, pop, top40", "longDesc": "At SPIN 1038, everything we do is different. We strive to be different from any other radio station on the market. SPINТs style is unique, itТs young, lively and fun Ц when you hear it, youТll know itТs SPIN 1038. SPIN is an aspirational brand. We are cutting edge, innovative and vibrant. 10 SPIN Hits is the anchor of our programming Ц 10 Songs in a Row Ц not interrupted by ads or news. This means more music than any other radio station. SPIN 1038 also plays new music first and before anyone else. To put it simply Ц ItТs All The Hits Ц One Station." },
{ "name": "The Freak Radio", "streamURL": "", "imageURL": "https://traderblog.net/images/ireland/7602.v2.png", "desc": " rock, blues, metal, folk, alternative, punk", "longDesc": "Our mission is to bring you the very best Rock and Folk music. But our УformatФ also allows for related genres which we know will fit the mix. Hence the term Freaky Music. To be honest we felt that it would be too much of a mouthful to be saying Rock, Folk, Alternative, Punk, Blues, Metal etc. etc. etc." },
{ "name": "The 90s Network", "streamURL": "https://onlineradiobox.com/json/ie/the90snetwork/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7441.v3.png", "desc": " 90s", "longDesc": "One of the most unique radio stations in Dublin EVER. Playing your favourite 90's hits 24/7. Relive the magic, with a decade in rewind. We focus solely on the music and news of the 1990s. As our tag line says, we play a decade in rewind." },
{ "name": "Dublin City FM", "streamURL": "https://onlineradiobox.com/json/ie/dublincity/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7015.v2.png", "desc": " pop, news, talk", "longDesc": "Dublin City fm aims to provide a special interest radio service which stimulates, informs and entertains listeners in the greater Dublin area. Our strong blend of talk and music based programming reflects a broad base of DublinerТs concerns, interests and opinions. Programme themes and materials are sourced from local communities, special interest groups, local authorities and to a limited extent, national and international public service broadcasters, who reflect our core values and ethics." },
{ "name": "Country Hits", "streamURL": "https://streams.radio.co/sb0d3bb664/listen", "imageURL": "https://traderblog.net/images/ireland/80905.v5.png", "desc": " country, 90s", "longDesc": "Broadcasting from Ireland. Playing feel-good country hits from the '90s to now" },
{ "name": "IFusion Radio", "streamURL": "https://streamingv2.shoutcast.com/iFusionMusicRadio", "imageURL": "https://traderblog.net/images/ireland/7362.v5.png", "desc": " classic rock, jazz, progressive rock", "longDesc": "This Radio is dedicated to the promotion of all types of jazz fusion, jazz and progressive rock music as well as the artists and creators involved. As the radio name name suggests, fusion music would attract our attention but not exclusively. As well as pushing the envelope we explore the influences and developments in jazz and rock music." },
{ "name": "90&#39;s Nostalgia", "streamURL": "https://streamer.radio.co/s848724d59/listen", "imageURL": "https://traderblog.net/images/ireland/81243.v6.png", "desc": " trance, house, techno, 90s", "longDesc": "Non-stop 90's club classics. Everything from house, to trance, to rave to oldschool classics." },
{ "name": "Dublin&#39;s ABC", "streamURL": "https://onlineradiobox.com/json/ie/dublinsabc/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7082.v6.png", "desc": " rock, 90s, 80s, oldies", "longDesc": "ABCТs format was mainly to play pop music with a high content of oldies Memories from the 60's to the 90's which very few other stations were doing. We also broadcast other types of music in the evenings, including rock, reggae, jazz, traditional and Irish music,dance, indie and classical to name but a few." },
{ "name": "IRadio Northeast &amp; Midlands", "streamURL": "https://stream.audioxi.com/IRADNW", "imageURL": "https://traderblog.net/images/ireland/7131.v5.png", "desc": " pop, top40", "longDesc": "Radio is a regional radio station in the Republic of Ireland that broadcasts to the north-east, midlands, north-west and west of the state. The station is one of four regional youth oriented stations that were licensed by the Broadcasting Authority of Ireland to challenge the current duopoly in the 15 to 34 age bracket for those outside Dublin by national stations RTE 2fm and Today FM." },
{ "name": "Garden County Radio", "streamURL": "https://onlineradiobox.com/json/ie/gardencounty/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7129.v8.png", "desc": " talk, folk, irish", "longDesc": "Garden County Radio,broadcasts from Greystones.Your Kind of Music, Arts, Lifestyle for a 30+ Audience. 24/7 on tuneIn,Live &amp; Local on Weekends.Music Arts &amp; Lifestyle Channel. Garden County Radio broadcasts from Bray, Ireland, Providing best of Irish, Folk, Talk, Entertainment radio programs." },
{ "name": "KCLR", "streamURL": "https://onlineradiobox.com/json/ie/kclr/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7492.v7.png", "desc": " pop, news, sports", "longDesc": "KCLR Carlow 94.6 is a broadcast based radio station from Carlow that plays Variety genre of music.Local news, sport, music, entertainment and much more!" },
{ "name": "Extreme Fm", "streamURL": "https://onlineradiobox.com/json/ie/extreme/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/82833.v3.png", "desc": " dance", "longDesc": "Changing the way of dance radio today. Live to Dublin on 107.1 world wide via online radio box and our website." },
{ "name": "Kfm Radio", "streamURL": "https://onlineradiobox.com/json/ie/kfm/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7132.v2.png", "desc": " adult contemporary", "longDesc": "Kfm broadcasts on 97.6fm and 97.3fm to all parts of county Kildare 24 hours a day from the state-of-the-art Kfm Broadcast Centre, Newhall, Naas, Co. Kildare and around the world on this website. Our aim is to entertain and inform our listeners, with the best music, local news and current affairs plus top class live sports coverage." },
{ "name": "8Radio.com", "streamURL": "https://onlineradiobox.com/json/ie/8radio/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7018.v3.png", "desc": " rock, alternative, 80s, eclectic", "longDesc": "Quality music we like from Dublin, Ireland. Everything from PJ Harvey to the Human League. 8Radio.com is all about the songs - if we like them, we play them." },
{ "name": "Room 101", "streamURL": "https://room101.out.airtime.pro/room101_c", "imageURL": "https://traderblog.net/images/ireland/7588.png", "desc": " rock, metal, alternative", "longDesc": "Room 101 is an Internet Radio station broadcasting from Cork, Ireland, providing Rock, Metal and Alternative Music. Station has European Rock scene recognition, providing information, interviews and live reports." },
{ "name": "Spirit Radio", "streamURL": "https://onlineradiobox.com/json/ie/spirit/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7210.v1.png", "desc": " talk, christian, gospel", "longDesc": "Upbeat and uplifting, entertaining and inspirational, Spirit Radio plays the best contemporary Christian music Ц plus a selection of positive mainstream hits. Spirit Radio aims to reach across all religious and denominational boundaries in Ireland creating a positive and uplifting attitude across community divides through careful selection of our religious and secular music and talk programming." },
{ "name": "Cork City Community Radio", "streamURL": "https://onlineradiobox.com/json/ie/corkcommunity/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7918.v4.png", "desc": " pop, news, talk", "longDesc": "Cork City Community Radio was founded lovingly by fellow Corkonians, both native and new, with the intention of creating a community radio station that gives a voice to the community, its businesses, local organisations, charities and community programmes. Our mission is to create a better sense of community for the Cork area and enliven its residents of all ages, genders and nationalities." },
{ "name": "Ballina Community Radio", "streamURL": "https://pj1019.radioca.st/streams/128kbps", "imageURL": "https://traderblog.net/images/ireland/7917.v4.png", "desc": " pop, news, talk", "longDesc": "The Broadcast Commission of Ireland, (BCI) has adopted this definition; СA community radio station is characterised by its ownership and programming and the community it is authorised to serve. It is owned and controlled by a not-for-profit organisation whose structure provides for membership, management, operation and programming primarily by members of the community at large. Its programming should be based on community access and should reflect the special needs of the listenership it is licensed to serve.Т" },
{ "name": "Cork&#39;s 96mf", "streamURL": "https://onlineradiobox.com/json/ie/corks/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7644.v6.png", "desc": " news, oldies, sports, irish, adult contemporary", "longDesc": "Cork 96FM - Programmes, presenters, news and information. Live broadcast available. Enjoy Saturday Night Heat, Nite-Time 96, and broadcasts like Oldies and Irish, among others." },
{ "name": "Power FM", "streamURL": "https://onlineradiobox.com/json/ie/powerfm/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7140.v1.png", "desc": " dance, electronic", "longDesc": "For over twenty years Power FM has been broadcasting dance and electronic music from Dublin, Ireland. It continues to bring quality, fresh dance music to the listeners of Dublin city and beyond." },
{ "name": "Midlands 103", "streamURL": "https://direct.sharp-stream.com/midlands103.mp3?device=websiteplayer", "imageURL": "https://traderblog.net/images/ireland/7778.v2.png", "desc": " pop, news, sports", "longDesc": "Welcome to Midlands 103 - The Midlands Premier Radio Station Midlands 103 is the independent local radio station serving midland counties Laois, Offaly and Westmeath, reaching 125,000 adults every week." },
{ "name": "Non Stop Storm FM", "streamURL": "https://onlineradiobox.com/json/ie/nonstopstorm/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7374.png", "desc": " electronic, rock, top40", "longDesc": "The NW's and NE's ONLY locally sourced youth orientated radio station, broadcasting 24 hours a day, FROM the area, FOR the people of the area. Accept only the original, not cheap imports." },
{ "name": "SPIN South West", "streamURL": "https://stream.audioxi.com/SW", "imageURL": "https://traderblog.net/images/ireland/7710.v4.png", "desc": " pop, top40, adult contemporary", "longDesc": "At SPIN South West, everything we do is different. We strive to be different from any other radio station on the market. SPINТs style is unique, itТs young, lively and fun Ц when you hear it, youТll know itТs SPIN South West. We are cutting edge, innovative and vibrant. 10 SPIN Hits is a key part of our programming Ц 10 Songs in a Row Ц not interrupted by ads, waffle or news. SPIN South West plays new music first, before anyone else. No.1 For Music &amp; Entertainment - SPIN South West" },
{ "name": "C103 (North)", "streamURL": "https://wg.cdn.tibus.net/C103", "imageURL": "https://traderblog.net/images/ireland/7647.v4.png", "desc": " country, 80s, 70s, oldies", "longDesc": "C103 (North) FM 103.0 is a broadcast Radio station from Cork City, Ireland, providing Oldies, Classics and Country Music." },
{ "name": "Dundalk FM", "streamURL": "https://onlineradiobox.com/json/ie/dundalkfm/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7603.png", "desc": " adult contemporary", "longDesc": "Dundalk FM 100Тs mission statement states that it is a not-for-profit, independent, friendly community development organisation giving voice to all in Dundalk and surrounding area. We are committed to educate, entertain and inform through our wide range of programmes." },
{ "name": "Northern Sound", "streamURL": "https://edge.audioxi.com/NORTHERNSOUND", "imageURL": "https://traderblog.net/images/ireland/7720.v3.png", "desc": " news, sports, adult contemporary", "longDesc": "Local and National News, Agricultural News and Sports are the flagship areas of our overall programming service with a strong impetus towards talk and as always quality music. Northern Sound presents local voices for local issues, bringing you the best in Irish, at the heart of the community, The Pulse for all your communication." },
{ "name": "EAST COAST FM", "streamURL": "https://onlineradiobox.com/json/ie/eastcoast/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7107.v1.png", "desc": " pop, top40", "longDesc": "Wicklow's Number 1 radio station with local news, sport, talk and More Music Variety. The programming is varied and includes daytime entertainment and chat, specialist music programmes." },
{ "name": "Connemara Community Radio", "streamURL": "https://onlineradiobox.com/json/ie/connemara/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7509.v1.png", "desc": " pop, news, talk", "longDesc": "Connemara Community Radio - 87.8 FM is a broadcast radio station on the Connemara Community Radio group from Clifden, Ireland providing Community news, information, events and music.Connemara Community Radio is a community-based and run radio station broadcasting for 10 hours per day throughout the north-west Connemara region of Ireland." },
{ "name": "Amazing Radio", "streamURL": "https://onlineradiobox.com/json/ie/amazing/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/30762.v4.png", "desc": " electronic, indie", "longDesc": "Amazing Radio is a new kind of radio, with 100% new music and a mix of new and established music gurus talking between the songs, definitely the first one where all the music comes from new and emerging artists And itТs the first national UK radio station to be based outside of London." },
{ "name": "ShannonSide FM", "streamURL": "https://edge.audioxi.com/SHANNONSIDE", "imageURL": "https://traderblog.net/images/ireland/8015.v5.png", "desc": " news, talk, sports", "longDesc": "Shannonside FM broadcasts to counties Longford, Leitrim and Roscommon. Local and National News, Agricultural News and Sports are the flagship areas of our overall programming service with a strong impetus towards talk and as always quality music." },
{ "name": "Klubb FM :: TURN US ON", "streamURL": "https://onlineradiobox.com/json/ie/klubbfm/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7494.v6.png", "desc": " dance, electronic, trance, house, top40", "longDesc": "Playing todayТs biggest hits during the day, and the best Trance &amp; EDM anthems at nightЕ24/7. Some of the World's top DJs come to Klubb FM throughout the week with their bespoke radio shows. Check us out on www.KlubbFM.com to find out more." },
{ "name": "South East Radio", "streamURL": "https://onlineradiobox.com/json/ie/southeast/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7812.v1.png", "desc": " adult contemporary", "longDesc": "Independent local radio for County Wexford, Ireland. Broadcasting from our digital state of the art studios on Custom House Quay in Wexford town." },
{ "name": "Claremorris Community", "streamURL": "https://s2.radio.co/sddd96b52a/listen", "imageURL": "https://traderblog.net/images/ireland/7506.v3.png", "desc": " rock, pop, news, talk, irish", "longDesc": "The station aims to reflect the diversity of cultures within our catchment area. We promote community development in all its aspects, with a combination of information, light programming, music and programmes of regional and local interest. It is intended that we cater for and reflect the new multicultural community in Claremorris. We aim to develop programmes and training that encourage disadvantaged groups to express their beliefs, values and needs for a better understanding within our community." },
{ "name": "Irish Radio International", "streamURL": "https://onlineradiobox.com/json/ie/international/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7589.v1.png", "desc": " news, talk", "longDesc": "Irish Radio International has been developed by radio professionals and enthusiasts from Ireland. We are broadcasting content of interest to ex-patriot Irish abroad as well as to New Irish and their friends and family in their home countries." },
{ "name": "Absolute Gold Radio", "streamURL": "https://onlineradiobox.com/json/ie/absolutegold/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/76372.v5.png", "desc": " 90s, 00s, 80s, 70s, 60s", "longDesc": "Playing the tracks of your years from 60s 70s 80s 90s 00s Also Award winning presenters from Geoff Dorsett, Clive Brady, Spencer James. Music for every tastes..." },
{ "name": "UCB Ireland", "streamURL": "https://onlineradiobox.com/json/ie/ucbireland/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7264.v3.png", "desc": " talk, christian", "longDesc": "UCB is a Christian media ministry in Ireland formed to promote the good news of the Kingdom of God. We strive for excellence and integrity in communicating the reality of life in Jesus Christ in all that we do. We prayerfully and faithfully serve God, and will testify to peopleТs lives being changed for good." },
{ "name": "Charityradio.ie", "streamURL": "https://onlineradiobox.com/json/ie/charityradio/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7043.v3.png", "desc": " talk, 80s, 70s", "longDesc": "CharityRadio.ie is an online radio station, we broadcast 24?7 from Dublin, Ireland with a great mix of Music, Interviews and Free charity promotion and advocacy. Our team of 20+ unpaid volunteers devote their time and energy to delivering high-quality radio shows ranging from music shows to interview and interactive specialist shows covering Charity news, mindfulness, technology and SME/Business advice. Our focus is to deliver attractive programming and audience for our free charity and community sponsorship &amp; advocacy." },
{ "name": "Redrock Radio", "streamURL": "https://stream.zeno.fm/za82a7zu2qruv", "imageURL": "https://traderblog.net/images/ireland/81434.v3.png", "desc": " country", "longDesc": "playing the best of country and irish music" },
{ "name": "UDMI", "streamURL": "https://onlineradiobox.com/json/ie/udmi/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7922.v2.png", "desc": " dance, electronic, house", "longDesc": "A Dublin based Radio Station Broadcasting from Various parts of Ireland and the U.K Playing the very best in House, Progressive, Trance and Oldskool Classics With Top Dublin DjТs, Ken Brady, Al Fitz, Senan Shortt, and others... Ц Playing all the Classics from all the Old Legendary Dance Clubs in Ireland From The Asylum, Sides, Olympic ,The Ormond, The Temple of Sound, The Harp, Tin Pan Alley, The Temple Theater, Sir HenryТs and the all Rest." },
{ "name": "Energy 94", "streamURL": "https://onlineradiobox.com/json/ie/energy94/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7120.v2.png", "desc": " dance, house, r'n'b, club", "longDesc": "All day, everyday we bring you the best mix of Dance &amp; Chart Music. Our DJs are some of the most dedicated and professional in Dublin and strive to bring you what you want to hear, from Dance, Chart and RСnТB to Hard House &amp; Club Classics." },
{ "name": "Frission Radio", "streamURL": "https://onlineradiobox.com/json/ie/frission/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/51276.v3.png", "desc": " electronic", "longDesc": "A music discovery platform built by a global collective of music fanatics. We curate great music in all its unique forms. Broadcasting live, 24/7." },
{ "name": "Louth Meath FM", "streamURL": "https://wg.cdn.tibus.net/LMFM", "imageURL": "https://traderblog.net/images/ireland/7661.v3.png", "desc": " news, sports, adult contemporary", "longDesc": "We are LMFM the Voice of the North East on 95.5,95.8 &amp; 96.5FM - the Home of Seamus &amp; Chris, the Michael Reade Show, Country Express, Late Lunch, News, Sport." },
{ "name": "Nearfm", "streamURL": "https://onlineradiobox.com/json/ie/near/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7133.v5.png", "desc": " news, talk", "longDesc": "Near fm broadcasts 24 hours a day over 365 days per year. We operate an open access policy and run at least two community radio courses a year for new volunteers. The station encourages groups to use community media as a tool in their development work and aims to reflect the issues, events and stories important in the local area." },
{ "name": "Reggae Ireland Radio", "streamURL": "https://streamingv2.shoutcast.com/reggaeireland3", "imageURL": "https://traderblog.net/images/ireland/68630.v8.png", "desc": " reggae", "longDesc": "Reggae Ireland Radio is a Dublin Based Online radio station play Reggae music 24/7" },
{ "name": "Limerick City Community Radio", "streamURL": "https://onlineradiobox.com/json/ie/lccr/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7703.v1.png", "desc": " pop, news, talk", "longDesc": "Limerick City Community Radio's Mission Statement is as : Limerick City Community Radio recognises the right of all to access to community radio and offers its facilities to the community of Limerick to enable that society to express itself freely and without editorial interference, subject to the law and accepted standards of taste and decency so as to promote cultural diversity, community integration and identity, thereby creating an informed, democratic, peaceful, tolerant and pluralist community; Limerick City Community Radio seeks to ensure that all residents of Limerick have the opportunity to participate in its ownership which shall be democratically managed and shall actively seek out the participation by all in its programming for the benefit, entertainment and development of the community." },
{ "name": "Open Your Mind Radio", "streamURL": "https://onlineradiobox.com/json/ie/openyourmind/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7932.v1.png", "desc": " news, talk", "longDesc": "Open Your Mind radio was setup to discuss all matters relating to, what we preceive, as reality.  We try and cover most, if not all, topics regarding this subject matter and hope to build up a vast knowledge of information to help people understand and make them aware of things going on nationally, internationally and across the world.  We aim to have interviews with guest speakers and add some humour and satire into the show as some of the things that we will discuss will be just plain laughable." },
{ "name": "ULFM", "streamURL": "https://onlineradiobox.com/json/ie/ulfm/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7705.v3.png", "desc": " pop", "longDesc": "ULFM is University of Limerick Student Radio station from Limerick, Ireland. ULFM is the University of Limerick's new full time student radio station. Broadcasting Monday-Friday, 11am-11pm Monday Thursday and 11am-4pm Friday. AutoDJ outside of these times." },
{ "name": "Phoenix FM", "streamURL": "https://onlineradiobox.com/json/ie/phoenixfm/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7139.v5.png", "desc": " news, talk", "longDesc": "92.5 Phoenix FM is the officially licensed Community Radio for Dublin 15. The output of the station, under the terms of our broadcasting license, is mainly talk based with an emphasis on local news and community affairs." },
{ "name": "Dublin South", "streamURL": "https://onlineradiobox.com/json/ie/dublinsouth/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7103.v4.png", "desc": " news, talk", "longDesc": "Dublin South FM 93.9 is a broadcast radio station from Dublin, Ireland, providing a platform to the community,for local issues and history, and air shows that cover a broad range of interests, from movies to science. Dublin  South community radio has been created and is run without distinction of race, creed, sex, caste, colour or age. We seek to achieve and maintain the highest principals of democratic and moral broadcast standards." },
{ "name": "Phantom FM", "streamURL": "https://onlineradiobox.com/json/ie/phantom/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/8019.png", "desc": " rock, indie, alternative", "longDesc": "Phantom 105.2 broadcasts rock and independent music to Dublin  and beyond via the web, 24 hours a day. Our formula is simple - we don't play disposable rubbish! Put this together with an emphasis on local artists, with real music fans behind the microphone and plenty of listener input." },
{ "name": "Eirewave", "streamURL": "https://eirewave.ice.infomaniak.ch/eirewave-128.mp3", "imageURL": "https://traderblog.net/images/ireland/71648.v1.png", "desc": " pop", "longDesc": "EIREWAVE proposes to play only contemporary Irish music and promote new Irish acts." },
{ "name": "Pond Radio", "streamURL": "https://stream.radio.co/s748bd9d9b/low", "imageURL": "https://traderblog.net/images/ireland/7592.v4.png", "desc": " 90s, 80s, 70s, 60s", "longDesc": "Best from the decades. Enjoy hits from the 60's to the 90's and much more." },
{ "name": "Harmony", "streamURL": "https://onlineradiobox.com/json/ie/harmony/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/79555.v5.png", "desc": " oldies, hits", "longDesc": "Beautiful Music!" },
{ "name": "Cruize Radio Online", "streamURL": "https://onlineradiobox.com/json/ie/cruize/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/81734.png", "desc": " dance, top40, 90s", "longDesc": "we are live 24/7 playing dance 90s and chart music and everything else from 80s to the latest dance club tunes" },
{ "name": "Solid Gold Radio Ireland", "streamURL": "https://my.radiolize.com/radio/8270/radio.mp3", "imageURL": "https://traderblog.net/images/ireland/83035.v5.png", "desc": " oldies", "longDesc": "The greatest hits of all time non-stop bringing you back the oldies" },
{ "name": "NLR Roots Radio", "streamURL": "https://music.wixstatic.com/mp3/4af815_0eee90188b8e45e581c8e6c5def15524.mp3", "imageURL": "https://traderblog.net/images/ireland/7138.v2.png", "desc": " dubstep, reggae", "longDesc": "Dublins 87.6 FM promotes the Roots Reggae Music Art-form and all the positive derivatives that it was intended to portray by way of Ska and Roots Rock Reggae. Our programming has an extended play-list from such talented Reggae artists as Peter Tosh, Bob Marley, Toots and the Maytals, Jimmy Cliff, Burning Spear, Bunny Wailer, Garnet Silk, Sly and Robbie, Tanya Stephens, Third World, Lucky Dube and Cocoa Tea just to name a few. A perfect selection of Reggae Tunes is added to our daily play-list to keep your mind stimulated and always leaving you in a Skanking Mood." },
{ "name": "Dundalk Bay and North Dublin Bay Marine", "streamURL": "https://audio12.broadcastify.com/yvzkj1htfgd69x7.mp3", "imageURL": "https://traderblog.net/images/ireland/67330.v32.png", "desc": " talk", "longDesc": "Raspberry Pi streaming marine VHF covering the Dundalk Bay and North Dublin Bay Area." },
{ "name": "PC Radio", "streamURL": "https://onlineradiobox.com/json/ie/pc/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7332.v1.png", "desc": " rock, pop, country, oldies", "longDesc": "Here at PC RADIO we play all the best songs from the 60s all the way through to the 00s.We are a non stop music station wanting you the listener to get in touch with your request or if you only want to say hello." },
{ "name": "OpenTempo FM", "streamURL": "https://onlineradiobox.com/json/ie/opentempo/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7801.v2.png", "desc": " talk, eclectic", "longDesc": "OpenTempoFM is a weekend based Radio Station in Waterford, Ireland, bringing an eclectic and appealing set of shows every weekend touching just about every Genre that Conventional Radio Stations Don't." },
{ "name": "Radio Siamsa", "streamURL": "https://cast02.siamsa.ie/radio/8000/radio.mp3", "imageURL": "https://traderblog.net/images/ireland/83584.v3.png", "desc": " folk", "longDesc": "Traditional Irish music from Dublin, Ireland." },
{ "name": "Imagine Radio 96.7 FM", "streamURL": "https://onlineradiobox.com/json/ie/ashbourne/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/2034.v11.png", "desc": " pop, news, talk", "longDesc": "Independent local news and music station covering Ashbourne,Uttoxeter, the Derbyshire Dales and Staffordshire Moorland borders." },
{ "name": "v4radio", "streamURL": "https://onlineradiobox.com/json/ie/v4radio/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7459.png", "desc": " indian, malayalam", "longDesc": "V4radio.com is an Internet radio network based in Dublin,Ireland offering a variety of channels for your enjoyment. It is owned,operated by and yet maintained by various talented individuals located all over the world. Our radio programs are produced *by* music lovers and *for* music lovers, and the work put in is labour of love." },
{ "name": "UCC", "streamURL": "https://onlineradiobox.com/json/ie/ucc/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7930.v2.png", "desc": " pop, talk", "longDesc": "The station has been broadcasting to the students and wider community of Cork since 1995. The station has an average of 80 volunteers each year during term time. UCC 98.3FM broadcasts a 60% talkЦ40% music ratio per week, and has received a number of awards and nominations for its work over the years." },
{ "name": "Life FM", "streamURL": "https://onlineradiobox.com/json/ie/life/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/8024.v1.png", "desc": " christian, gospel", "longDesc": "LifeFM is a not-for-profit Christian Community Radio station serving the areas of Cork City and County. Our hope is to bring a mix of music and programming unlike anything ever heard before in Ireland; but beyond that, the real purpose of LifeFM is to bring hope to the people of Cork." },
{ "name": "Liffey Sound FM", "streamURL": "https://onlineradiobox.com/json/ie/liffeysound/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7913.v1.png", "desc": " pop, news, talk", "longDesc": "Liffey Sound FM is committed to serving its community irrespective of creed, class, colour or race; to giving a voice to those not served by the mainstream broadcasting services; to educating, informing and inspiring people in our community and to promoting a sense of community and civic pride." },
{ "name": "Barrowside Online", "streamURL": "https://onlineradiobox.com/json/ie/barrowside/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/8144.v2.png", "desc": " pop, news, talk", "longDesc": "Barrowside Online is an internet radio station from Carlow, Ireland, providing Community News, Talk and Fresh and Classic chart, dance, rock and indie from the e 80's right through to today, live from the greater Barrow Valley region with great music and rolling local content every day." },
{ "name": "Freewheel Radio", "streamURL": "https://freewheel.radioca.st/stream", "imageURL": "https://traderblog.net/images/ireland/80250.v2.png", "desc": " rock, indie, alternative", "longDesc": "Playing Rock, Indie, Alternative and any manner of decent tune from Sligo, Ireland" },
{ "name": "Kiss Waterford", "streamURL": "https://onlineradiobox.com/json/ie/kiss/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7808.v1.png", "desc": " pop, top40", "longDesc": "Kiss FM Waterford is an independent Online Radio Station aimed at the Youth of Ireland." },
{ "name": "Raidio Ri-Ra", "streamURL": "https://onlineradiobox.com/json/ie/rr/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7356.v3.png", "desc": " pop, top40, adult contemporary", "longDesc": "Radio Ri-Ra is an internet radio station from Dublin, Ireland providing Adult Contemporary and Top 40 music. Is e Raidio Ri-Ra an t-aon chairtstaisiun raidio lanGhaeilge don aos og in Eirinn, agus seinneann muid na hamhrain is deanai o na cairteacha." },
{ "name": "URadio", "streamURL": "https://onlineradiobox.com/json/ie/uradio/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7335.v1.png", "desc": " rock, alternative", "longDesc": "#1 Irish Pop-Rock Station" },
{ "name": "Athlone Community Radio", "streamURL": "https://onlineradiobox.com/json/ie/athlonecommunity/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/8048.v3.png", "desc": " alternative", "longDesc": "Athlone Community Radio Ltd aims to operate a Community Radio Station for the benefit of the community of Athlone which aims to entertain, engage and inform its listenership. Its activities and programming are based on community ownership, access and participation, and aims to reflect the special interests and needs of this community, in line with the community ethos of the BAI licence and the AMARC charter. Our overall aim is to establish a Community radio station for the benefit of the community of Athlone, in line with the community ethos of the BAI licence and the AMARC charter." },
{ "name": "Copper Coast Radio", "streamURL": "https://azura.streams.ovh/radio/8260/radio.mp3", "imageURL": "https://traderblog.net/images/ireland/7462.v10.png", "desc": " rock, news, talk, weather", "longDesc": "Broadcasting from the beautiful south east of Ireland. We bring you up to date with all the local happenings from the coast and play your feel good favorites." },
{ "name": "CRC FM", "streamURL": "https://onlineradiobox.com/json/ie/crcfm/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7504.v2.png", "desc": " news, sports", "longDesc": "CRCfm is a community radio station licenced by the Broadcasting Authority of Ireland to broadcast 24 hours per day to the 30,000 people who live in and around Castlebar, Co Mayo in Ireland. Our brand of radio is different to any other in this area." },
{ "name": "Radio Corca Baiscinn", "streamURL": "https://onlineradiobox.com/json/ie/corcabaiscinn/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7640.v1.png", "desc": " rock, pop, talk, hip-hop, sports, education", "longDesc": "Raidio Corca Baiscinn is a broadcast radio station from Kilkee, Ireland providing local information, entertainment and training resources for the people of West Clare. Our programming is as diverse as our volunteer base and includes debate, farming, historical documentaries, sports, radio drama, soundscape and a wide range of music shows from trad to hip hop, 90% of which are volunteer produced and presented." },
{ "name": "Raidio na Life", "streamURL": "https://onlineradiobox.com/json/ie/raidinalife/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7143.v1.png", "desc": " news, talk, adult contemporary", "longDesc": "Is staisiun raidio pobail sainspeise e Raidio na Life a bunaiodh in 1993. Cuireann muid seirbhis raidio Ghaeilge ar fail do Bhaile Atha Cliath ar 106.4 FM agus do dhaoine ar fud an domhain ar raidionalife.ie le tacaiocht o Fhoras na Gaeilge." },
{ "name": "Ballinrobe Community Radio", "streamURL": "https://onlineradiobox.com/json/ie/ballinrobecommunity/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7924.v2.png", "desc": " pop, news, talk", "longDesc": "The aim of the radio station is to give the community a platform where they can share their voices. The station plans to improve access to local information and community events and to ensure that there is a sense of connectedness in our community between people of all ages, culture and ethics backgrounds. Our goal is to get behind local musicians, become a sustainable business, provide media training and ensure that we become a stronghold for the community by bringing  people from all backgrounds together." },
{ "name": "Community Radio Youghal", "streamURL": "https://onlineradiobox.com/json/ie/cry/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7835.v1.png", "desc": " folk, top40", "longDesc": "Community Radio Youghal is a Community Radio Station that broadcasts to Youghal Town and the surrounding areas of East Cork and West Waterford on 104FM. We broadcast 7 days a week, 52 weeks a year. Our programming includes Current Affairs, Sport, Inclusiveness, the Arts, Women's Issues, Local History and Specialist Music." },
{ "name": "Wired FM", "streamURL": "https://onlineradiobox.com/json/ie/wiredfm/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7911.v1.png", "desc": " dance, rock, pop", "longDesc": "Wired FM is dedicated to the student community of Limerick. All its DJ's are student volunteers and it is run as a partner ship between Limerick Institute of Technology, The LImerick School of Art and Design, and Mary Immaculate College, University of Limerick. We are always open to new ideas for programmes and volunteers are always welcome to get involved." },
{ "name": "TCR FM", "streamURL": "https://onlineradiobox.com/json/ie/tcr/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7748.v1.png", "desc": " rock, pop, news, talk", "longDesc": "Broadcasting from studios on Queen Street, TCR FM is Tramore's Community Radio Station. They aim to inform, educate and entertain. TCR FM provides a wide variety of programming including local news and event information, specialist music and special interest programmes." },
{ "name": "Breeze AM", "streamURL": "https://onlineradiobox.com/json/ie/breezeam/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/8082.v2.png", "desc": " classic, christmas, adult contemporary", "longDesc": "Breeze FM is an internet radio station from Dublin, Ireland, providing Traditional Standards Christmas songs and music. Broadcasting round the clock we have a great mix of quality non stop music sweeps of your favourite love songs." },
{ "name": "Freedom Radio", "streamURL": "https://onlineradiobox.com/json/ie/freedom/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7914.png", "desc": " dance, pop", "longDesc": "Freedom Radio is Rainbow Radio for all the people on the Island of Ireland and elsewhere in the World! Exciting music for your lifestyle, clutter free 24/7 The real sound of a modern 21st century Ireland, available on your Tablet and Computer right now!" },
{ "name": "Smash!", "streamURL": "https://onlineradiobox.com/json/ie/smash/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/82012.v2.png", "desc": " dance, electronic, house, top40", "longDesc": "Non-Stop rhythm &amp; dance!" },
{ "name": "Radio Limerick Online", "streamURL": "https://streamingv2.shoutcast.com/rlo", "imageURL": "https://traderblog.net/images/ireland/84155.v3.png", "desc": " oldies", "longDesc": "Live music &amp; chat from Limerick city, Ireland 24/7." },
{ "name": "Flirt FM", "streamURL": "https://onlineradiobox.com/json/ie/flirt/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7637.v2.png", "desc": " rock, alternative", "longDesc": "Flirt FM 101.3 is the community of interest radio station for Galway city, based in NUI Galway. WeТve been giving students a voice since September 1995. On air weekdays throughout the year, we have a full-time term schedule of 100 hours, and a reduced academic holiday schedule of 60 hours." },
{ "name": "Ballina Killaloe Local Radio", "streamURL": "https://streamer.radio.co/s776d00065/listen", "imageURL": "https://traderblog.net/images/ireland/80846.v6.png", "desc": " pop, folk, country", "longDesc": "Streaming from Ballina-Killaloe  where Tipperary meets Clare in the republic of Ireland. Bringing too you,  the latest news and sports news of the area and music from Irish Traditional , American country, Pop and more" },
{ "name": "Atlantic Radio Ireland", "streamURL": "https://onlineradiobox.com/json/ie/atlanticradioireland/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/71801.v5.png", "desc": " pop, news, talk", "longDesc": "Atlantic Radio Ireland is alternative community radio from West Cork, Ireland" },
{ "name": "Irorszagi Magyarok Info Radio", "streamURL": "https://onlineradiobox.com/json/ie/rorszagimagyarok/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/47926.v1.png", "desc": " pop, news, talk, folk, entertainment", "longDesc": "Celunk az Irorszagban elo Magyaroknak hiteles hirforrast nyujtani, szorakoztato, politikai, hatter musorok keszitese es sugarzasa. Valasztekos musorok, szorakoztato, vetelkedo magazinok, auto-motor szerelesi tanacsok, gasztronomiai musorok, jogi tanacsok, orvosi, etrend tanacsok. Irorszagi magyar vallalkozasok bemutatasa, aktualis hazai hirek, erdekessegek." },
{ "name": "Western Waves Community Radio", "streamURL": "https://onlineradiobox.com/json/ie/westernwaves/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/8161.png", "desc": " talk, education", "longDesc": "Western Waves FM is a Community Radio Station based in Bundoran, Co. Donegal, Ireland producing special interest content for the western Irish seaboard." },
{ "name": "Event FM", "streamURL": "https://onlineradiobox.com/json/ie/eventfm/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7124.v3.png", "desc": " rock, pop, talk", "longDesc": "Event FM is an internet radio station from Dublin, Ireland providing Live shows and Variety music." },
{ "name": "The Foundry FM", "streamURL": "https://onlineradiobox.com/json/ie/thefoundryfm/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7500.v2.png", "desc": " r'n'b, pop, hip-hop, top40", "longDesc": "Foundry FM Niteclub Radio The First of its Kind in Ireland!Tune in and listen to live streams from the club or day-time Foundry FM. The FoundryТs play list includes the very best in commercial music and caters to everyoneТs needs. The nightclub has 5 resident D.Js including D.J Michael Byrne, Today FMТs D.J Bob Conway, D.J Matt Givens, D.J Mark Collins and D.J Gerry Cormicken. It has also hosted National D.Js Ray Shah, Mr. Spring and Nicky Hayes." },
{ "name": "Polish Radio Ireland", "streamURL": "https://c11.radioboss.fm:18067/stream", "imageURL": "https://traderblog.net/images/ireland/84744.v2.png", "desc": " top40, culture", "longDesc": "People with Music. Ireland's first Polish music broadcaster." },
{ "name": "Triplag Radio Chill Out", "streamURL": "https://onlineradiobox.com/json/ie/triplagchillout/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/8143.v2.png", "desc": " trance", "longDesc": "Triplag Music created in June 2007 on a base of successful Triplag webradio is a record label and community of artists dedicated to releasing full power night time psychedelic trance music. cTriplag is a full power shamanic web radio and a chill out dub stream. ... Triplag Chillout." },
{ "name": "FRQ.FM", "streamURL": "https://onlineradiobox.com/json/ie/frq/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/67383.v4.png", "desc": " pop, talk, top40, hits", "longDesc": "Ireland's ONLY dedicated Ad free News free Radio Station. (Grab the app for FREE)A brand new type of radio station, because itТs not a УradioФ station.FRQ is a digital only station, with the best new music and brand new talent." },
{ "name": "Owenea FM 100.8", "streamURL": "https://onlineradiobox.com/json/ie/owenea/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/81309.v2.png", "desc": " pop, talk, country", "longDesc": "Located in Ardara, Owenea FM is a community radio station that serves the southwest of Donegal. Its programming focuses mostly on culture, sport, music, arts and local and regional matters." },
{ "name": "YAG FM", "streamURL": "", "imageURL": "https://traderblog.net/images/ireland/7269.v2.png", "desc": " dance, electronic, house, pop", "longDesc": "The idea behind the station was to give young people the opportunity to experience the medium of radio be it presenting a show or producing a show or just helping out in the radio studio." },
{ "name": "Christmas FM", "streamURL": "http://streamdb7web.securenetsystems.net/ce/XMASFMM", "imageURL": "https://traderblog.net/images/ireland/7938.v5.png", "desc": " christmas", "longDesc": "Christmas FM is IrelandТs all Christmas music and holiday music station. The station brings the Magic of Christmas to Ireland on the radio each year and to the world via this website and mobile apps for iOS and Android.." },
{ "name": "Halloween FM", "streamURL": "https://streamdb9web.securenetsystems.net/v5/HWFM2", "imageURL": "https://traderblog.net/images/ireland/82102.v3.png", "desc": " hits", "longDesc": "Halloween FM is Irelands' Halloween station, live at HalloweenFM.ie. We're your music Monster for Halloween." },
{ "name": "AGM African Gospel Media", "streamURL": "https://onlineradiobox.com/json/ie/agm/play?platform=web", "imageURL": "https://traderblog.net/images/ireland/7338.v2.png", "desc": " christian, gospel", "longDesc": "African Gospel Media Radio is a Christian 24 hour Internet Radio Station. We are Faith based Christian Club. We preached and spread the gospel through music. Hence the wordings of gospel songs are all from the bible and are based on the song writerТs personal experiences with God. Reaching the heart of the people all over the world with the message of Hope, Faith, etc, to those who are suffering from a Broken hearted, Depression, Deceived, Divorce, Mourning, etc that the solution to their challenges in life is in Jesus Christ." }
]
}
