{
"station":
[
{ "name": "Life Chill Music", "streamURL": "https://onlineradiobox.com/json/lt/lifechillmusic/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/76936.v3.png", "desc": " lounge, downtempo, chill-out", "longDesc": "Life Chill music is a radio station providing chillout, downtempo and lounge music. EXCLUSIVE and DELUXE music 24/7. Beautiful music makes life beautiful!" },
{ "name": "Mano FM", "streamURL": "https://onlineradiobox.com/json/lt/mano/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/30274.v2.png", "desc": " pop, folk", "longDesc": "MANO FM Ц 2014 savo veikla pradejusi radijo stotis Kaune, kuri stengiasi patenkinti kiekvieno klausytojo norus. Transliuodama tiek hitus, tiek senesnius kurinius, kurie konkreciu metu yra/buvo patys populiariausi Ц MANO FM tampa universalia visiems tinkancia radijo stotimi. Anksciau per radijo imtuvus prieinama tik Kaune ir jo rajone, siuo metu klausoma internetu visoje Lietuvoje." },
{ "name": "Beveik Radijas", "streamURL": "https://onlineradiobox.com/json/lt/beveikradijas/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/30147.v4.png", "desc": " rock, alternative", "longDesc": "Mastyk alternatyviai!BEVEIK RADIJAS - tai internetinis radijas jaunam, mylinciam ROCK stiliaus muzika, zmogui! Junkis prie musu! Laukiam!" },
{ "name": "Radijo Stotis Kelyje", "streamURL": "https://onlineradiobox.com/json/lt/stotiskelyje/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/29988.v2.png", "desc": " pop, news, entertainment", "longDesc": "Radijo stoties УKelyjeФ saukiniai pirma karta nuskambejo 2000 metais Kaune, 105,9 MHz dazniu ir tai buvo pirmoji radijo stotis Lietuvoje, skirta visiems, esantiems kelyje. Greit ji tapo populiariausia ir klausomiausia radijo stotimi Kaune. 2003 metais УKelyjeФ jau skambejo  Vilniuje (107,7 MHz ) ir Klaipedoje (99,8 MHz), kur taip pat greit uzkariavo kelius, radijo imtuvus ir klausytoju sirdis." },
{ "name": "Radijo stotis A2", "streamURL": "https://onlineradiobox.com/json/lt/stotisa2/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/30272.v1.png", "desc": " pop, news, folk", "longDesc": "Listen online to Radijo stotis A2  in Vilnius, Lithuania." },
{ "name": "Radio Stotis Tau", "streamURL": "https://onlineradiobox.com/json/lt/stotistau/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/30128.v4.png", "desc": " pop, top40, adult contemporary", "longDesc": "Radijas ДTAUУ Ц seniausia Kauno radijo stotis, transliuojanti Kauno mieste ir 70 kilometru spinduliu aplink Kauna bei internetu visame pasaulyje. Sis radijas pradejo transliuoti vidutiniu bangu diapazone 1993 metais ir vadinosi Radijo studija ДTauУ, kuriai vadovavo Arvydas Linartas. Po pusmecio transliaciju stoties darbas nutruko. Netrukus buvo pastatytas nuosavas FM bangu siustuvas, ir 1994 metu gruodzio 22 diena ДTAUУ vel pradejo transliuoti 102,9 MHz FM dazniu. Dabar radijo stotis priklauso UAB ДArtvydasУ." },
{ "name": "Vaiku Radijas", "streamURL": "https://onlineradiobox.com/json/lt/vaiku/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/30267.v1.png", "desc": " children", "longDesc": "Vaiku Radijas - ДMazoji muzika mazyliams ir ju teveliamsУ supazindins su naujomis ankstyvam amziui skirtomis dainomis, kurios prisideda prie vaiku lavinimo" },
{ "name": "FixFM", "streamURL": "https://onlineradiobox.com/json/lt/fix/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/30155.v2.png", "desc": " r'n'b, pop, hip-hop", "longDesc": "FixFM, tai yra pelno nesiekiantis jaunu zmoniu projektas. Radijas transliuojamas internetu, todel yra pasiekiamas bet kuriame pasaulio taske, kur yra interneto rysys. Kaip ir viskas turi pradzia, taip ir FixFM turi savo susikurima. FixFM savo veikla pradejo 2008 metu, balandzio 26 diena. Nuo pat pirmuju zingsniu stengiames uzkariauti klausytoju sirdeles, ne tik puikia muzika, bet ir viskuo, ka galime pateikti klausytojams." },
{ "name": "Neringa FM", "streamURL": "https://onlineradiobox.com/json/lt/neringa/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/29981.v1.png", "desc": " soundtrack", "longDesc": "Radijo stotis Neringa FM yra istaiga, veikianti muzikos, sporto, kulturos ir reklamos srityse, uzsiimanti visuomenes svietimu ir informavimu, renginiu organizavimu ir ivairiu socialiniu projektu vykdymu." },
{ "name": "Radio Pukas 2", "streamURL": "https://onlineradiobox.com/json/lt/pukas2/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/30005.v2.png", "desc": " pop, jazz, classic", "longDesc": "Radijo stotis УPukas-2Ф transliuoja didziuosiuose Lietuvos miestuose klasika tapusius geriausius pasaulines muzikos kurinius intelektualesniems klausytojams: dziaza, bliuza ir klasikine muzika. Transliavima radijo stotis pradejo 2002 m. liepos 1 d." },
{ "name": "Upsas Radio", "streamURL": "https://onlineradiobox.com/json/lt/upsas/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/30236.v2.png", "desc": " pop, top40, 90s", "longDesc": "UPSAS Ц tai radijas skirtas tiems, kurie visur keliauja su muzikiniais taktais. Jeigu ir tu nei dienos nepraleidi be muzikos, neisivaizduoji, kaip galima nezinoti naujausiu hitu ir nesunkiai isvardintum visus С90uju ДgabalusУ Ц tokiu atveju UPSAS kaip radijas tik tau. Tai i muzika orientuotas radijas, kurio tikslas, kad kasdienybe teketu taktu ritmu." },
{ "name": "Top Hits Radio Lithuania", "streamURL": "", "imageURL": "https://traderblog.net/images/lithuania/29958.v1.png", "desc": " pop, top40", "longDesc": "Lithuanian online radio station. All the hits non-stop, only pure music. Listen live at www.tophitsradio.lt" },
{ "name": "Start FM", "streamURL": "https://onlineradiobox.com/json/lt/start/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/30141.v2.png", "desc": " rock, alternative", "longDesc": "Start FM Ц pirmoji ir vienintele radijo stotis Lietuvoje, grojanti tik nekomercine muzika. Radijas Дnuo-ikiУ igyvendintas be komerciniu remeju. Nuo pat ikurimo 2005 metais negrojame jokios reklamos, nepardavinejame eterio laiko ir patys neparsiduodame. 2009 metu pabaigoje radijo automatizavimui ir transliacijoms naudojame tik atviro kodo programas." },
{ "name": "Play Radio", "streamURL": "https://onlineradiobox.com/json/lt/play/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/74270.v4.png", "desc": " dance, rock, hip-hop, top40, adult contemporary, hits", "longDesc": "Play Radio - more hits!" },
{ "name": "Taurages Radijas", "streamURL": "https://onlineradiobox.com/json/lt/taurages/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/30233.v2.png", "desc": " dance, house, disco", "longDesc": "ДTaurages radijas? 98,2 FM - Lietuvos regioniniu radijo stociu asociacijos narys." },
{ "name": "RadijoGAMA", "streamURL": "https://onlineradiobox.com/json/lt/gama/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/30143.v2.png", "desc": " talk, folk, christian", "longDesc": "Radijo stotis ДRadijogamaУ | FM 99,0 MHz Klaipedoje ir Vakaru Lietuvoje ДZodziai Ц is minties, muzika Ц is sirdies!Visuomeniskumas, pozityvi informacija, ДteisingaУ muzika, atviras, tolerantiskas poziuris i zmogu." },
{ "name": "Sveikatos Radijas", "streamURL": "https://onlineradiobox.com/json/lt/sveikatosradijas/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/30230.v1.png", "desc": " pop, eclectic", "longDesc": "Sveikatos radijas - tai sveika.Internetinis Sveikatos radijas yra skirtas pacientams ir medikams. Radijo transliavimo sistema sumontuota ivairiu miestu gydymo istaigose, taciau dar ne visur - tai musu siekis." },
{ "name": "RS2 Radio", "streamURL": "https://onlineradiobox.com/json/lt/rs2/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/30186.v1.png", "desc": " pop, folk", "longDesc": "ДRS2 - radijo stotis aktyviems, smalsiems, subrendusiems, linksmiems, kurybingiems visos Siaures Lietuvos gyventojams.ДRS2 - tai ДAntroji radijo stotis, girdima 97,8 FM dazniu. Musu klausosi Siauliu, Radviliskio, Joniskio, Panevezio, Telsiu bei Kelmes gyventojai - radijo stoties transliavimo aprepties teritorija yra 80-90 km spinduliu aplink Siaulius.Puse (50%) transliuojamos muzikos sudaro geriausi praejusiu desimtmeciu hitai, trecdali (30%) - visu laiku rokas, likusi dalis - ivairi kitu stiliu muzika" },
{ "name": "Tonite Radio", "streamURL": "", "imageURL": "https://traderblog.net/images/lithuania/30182.v2.png", "desc": " disco, pop, jazz, soul, funk", "longDesc": "Tonite Radio is an internet radio station from Lithuania, providing House music: Deep, Soulful, Funky, Jackin, Disco, Progressive Е Nu-Disco, Nu-Jazz, Nu-Skool etc." },
{ "name": "radio.audiomastering.lt", "streamURL": "https://onlineradiobox.com/json/lt/audiomasteringlt/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/30146.v5.png", "desc": " electronic, dubstep, ambient, relax", "longDesc": "Lithuanian radiostation, providing a big variety of music. УIt's not true that I had nothing on. I had the radio on.Ф ? Marilyn Monroe" },
{ "name": "Power Hit Radio", "streamURL": "https://powerhit.ls.lv/PHR_AAC", "imageURL": "https://traderblog.net/images/lithuania/29972.v6.png", "desc": " pop, top40", "longDesc": "Sokiu muzikos hitu radijo ДPower Hit RadioУ galima klausytis Vilniuje, Kaune, Klaipedoje ir Utenoje bei siuos miestus supanciuose rajonuose." },
{ "name": "Radijo stotis &#34;RADUGA&#34;", "streamURL": "https://radio.m-1.fm/raduga/high", "imageURL": "https://traderblog.net/images/lithuania/30154.v2.png", "desc": " news, folk, top40", "longDesc": "–адио Ђ–адугаї вещает на частоте 100,8 FM в  лайпеде с 1 сент€бр€ 2001 года. Ёто перва€ литовска€ радиостанци€, круглосуточно вещающа€ на русском €зыке." },
{ "name": "Lietus Radio Vilnius - M-1 Radio", "streamURL": "https://radio.m-1.fm/M-1H", "imageURL": "https://traderblog.net/images/lithuania/30130.v1.png", "desc": " top40", "longDesc": "Live Fun!Radijo stotis M-1 - pirmoji komercine radijo stotis nepriklausomoje Lietuvoje bei visoje Rytu Europoje.M-1 buvo ir yra muzikos, kokybes, populiarumo, siuolaikiskumo, laisves ir geros nuotaikos simbolis.Pastaraisiais metais M-1 islaiko pirmaujancias pozicijas Lietuvos radijo stociu rinkoje, kurioje veikia daugiau kaip 30 radijo stociu." },
{ "name": "RadioCentras", "streamURL": "https://onlineradiobox.com/json/lt/centras/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/30139.v1.png", "desc": " pop, folk", "longDesc": "Skleisti gera nuotaika!Radijo stotis ДRadiocentrasУ Ц pirmoji privati ir ilgiausiai nenutrukstamai veikianti radijo stotis Lietuvoje, transliuojanti is Vilniaus nuo 1991 metu sausio 31 dienos.Siuo metu pramogine Ц muzikine ДRadiocentroУ radijo programa gali girdeti 19 Lietuvos miestu ir ju apylinkiu gyventojai. Radijo stoties siustuvu tinklas dengia daugiau nei 96% salies teritorijos ir pasiekia daugiau nei puse milijono radijo klausytoju." },
{ "name": "Saules Radijas FM", "streamURL": "https://onlineradiobox.com/json/lt/saules/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/30144.v1.png", "desc": " pop, top40", "longDesc": "Didziausias regioninis radijas siaures Lietuvoje ДSaules radijasУ ikurtas pries 25 metus. Klausytojus pasiekiame 102,5 FM dazniu arba internetu is musu svetaines. Kodel turetumete klausytis ДSaules radijoУ? Nes mes kitokie. Mes nekopijuojame didziuju radijo stociu. Grojame tik naujausia ir populiariausia muzika, o gurmanams siulome muzikos stiliu ivairove vakarinese ДSaules radijoУ programose." },
{ "name": "Radio Maria", "streamURL": "https://onlineradiobox.com/json/lt/marialithuania/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/29919.v3.png", "desc": " talk, christian, children", "longDesc": "Radio Maria Lithuania - Marijos Radijas, FM 95.7, Kaunas . Listen live plus station schedule, song playlist, location and contact information online." },
{ "name": "Dark Side", "streamURL": "", "imageURL": "https://traderblog.net/images/lithuania/76814.v5.png", "desc": " electronic, rock, gothic", "longDesc": "Radio for EBM, industrial, gothic styles lovers." },
{ "name": "XFM", "streamURL": "https://onlineradiobox.com/json/lt/xfm/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/30238.v1.png", "desc": " pop, talk, christian, top40", "longDesc": "Musu misija:Radijo stotis XFM oriai tarnauja zmonems dora muzika ir geros naujienos skelbimu apie Dieva ir Jo pasauli. Radijas darba pradejo 2004 m. rugpjucio 2 diena, FM 93,3 MHz dazniu, o nuo 2005 m. geguzes 1 d. Ц naujuoju FM 91,4 MHz dazniu. Zymiai padidinome siustuvo galia ir dabar stotis girdima 50 Ц 70 km aplink Klaipeda (Nidoje, Gargzduose, Kretingoje, Plungeje, Siluteje, Plateliuose, Palangoje, Sventojoje, autostradoje Klaipeda - Vilnius iki 75 km)." },
{ "name": "Radijo stotis FM99", "streamURL": "https://onlineradiobox.com/json/lt/stotis99/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/30145.v2.png", "desc": " news, talk, sports", "longDesc": "Radijo stotis ДFM99 pirma karta i klausytojus kreipesi 1993 metu sausio 6 diena Alytuje. Savo veikla pradejusi kaip miesto radijas, dabar tai vienintele regionine radijo stotis Pietu Lietuvoje, transliuojanti savo programa is Alytaus (99,0 MHz) ir Druskininku (97,2 MHz). ДFM99У girdima Alytuje, Druskininkuose, Marijampoleje, Lazdijuose, Prienuose, Birstone, Kybartuose, Garliavoje ir kitur. ДFM99У programa transliuoja ir internetu." },
{ "name": "HOT FM", "streamURL": "", "imageURL": "https://traderblog.net/images/lithuania/30240.v1.png", "desc": " dance, pop, top40", "longDesc": "HOT FM Ц top non stop formato radijo stotis.HOT FM muzika - tai paskutiniu 15 metu Lietuvos ir uzsienio atlikeju kuriniai, jau tape hitais. Eterio pagrindas Ц patys aktualiausi sios dienos hitai." },
{ "name": "Kubo Radijas - Muzika kitu kampu !", "streamURL": "https://onlineradiobox.com/json/lt/nonstopdancemusic/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/79873.v7.png", "desc": " dance, electronic, pop", "longDesc": "Internetine Radijo Stotis, Non stop dance music" },
{ "name": "Baltupiu Radijas", "streamURL": "https://onlineradiobox.com/json/lt/baltupiu988/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/30149.v1.png", "desc": " pop, news, talk", "longDesc": "Baltupiu mokyklos radijas...Baltupiu Radijas 98.8 is a broadcast radio station from Vilnius, Lithuania providing Lithuanian music and programs." },
{ "name": "BitRadio", "streamURL": "https://onlineradiobox.com/json/lt/bit/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/30020.png", "desc": " dance, electronic, house, r'n'b, pop", "longDesc": "Geriausi muzikos hitai internete!BITRADIO yra pirmoji jaunimui kurta radijo stotis.Musu gimimo metai Ц 2011, musu formatas Ц УPOP/RNB/ELECTRO/DANCEФ,musu noras ir tikslas Ц groti kuo daugiau kokybiskos ir jaunimo pripazintos muzikos, kalbeti apie muzika, siulyti kuo daugiau pramogu,suteikti galimybe jauniems Lietuvos elektronines muzikos kurejams, skleistigera nuotaika, pristatyti ivairiausius Lietuvos DJs, pakalbeti apie visusvakarelius Lietuvoje ir tapti geriausiu TAVO draugu!" },
{ "name": "FRED FILM RADIO", "streamURL": "https://onlineradiobox.com/json/lt/fredfilm/play?platform=web", "imageURL": "https://traderblog.net/images/lithuania/46856.v2.png", "desc": " news, talk, entertainment", "longDesc": "FRED Film Radio - the only multi lingual online radio station that brings you the insight on film festivals and film events all around the world!" }
]
}
