{
"station":
[
    { "name": "Flava", "streamURL": "https://ais-nzme.streamguys1.com/nz_010_aac", "imageURL": "https://traderblog.net/images/zealand/1097.v2.png", "desc": " r'n'b, hip-hop", "longDesc": "Flava Radio stations are the most recognized internet based, onward thinking, innovative equipment which is the reason why most of the people loves this station. Turn your own little brown eyes along with 30 severely acclaimed performers through almost all points, across the world along with Flava Radio. Which will be making use of their music." },
{ "name": "Radio Dunedin", "streamURL": "https://livestream.mediaworks.nz/radio_origin/Radio_Dunedin/playlist.m3u8", "imageURL": "https://traderblog.net/images/zealand/1144.v2.png", "desc": " news, talk, 80s, 70s, 60s", "longDesc": "The station is aimed primarily at the 40+ age bracket, with a community focus, local news, and playing music primarily from the 1960s to 1980s. It is rated number one for share of commercial radio listening in Dunedin in the Radio Audience Measurement Survey" },
{ "name": "Star FM", "streamURL": "https://rhema-radio.streamguys1.com/rhema-star.mp3", "imageURL": "https://traderblog.net/images/zealand/1145.v1.png", "desc": " talk, christian", "longDesc": "Star offers a unique Сeasy listeningТ experience with a blend of contemporary praise and worship, classic favourites and hymns. ItТs the Christian music youТve loved for years." },
{ "name": "Niu FM", "streamURL": "https://playerservices.streamtheworld.com/api/livestream-redirect/NIUFM.mp3", "imageURL": "https://traderblog.net/images/zealand/1107.v2.png", "desc": " pop, talk", "longDesc": "The Pacific Media Network is a New Zealand radio network and pan-Pasifika national broadcasting network owned and operated by the National Pacific Radio Trust. Its Niu FM radio network, Pacific Radio News Service and Auckland-based Radio 531pi station combined are accessible to an estimated 92 percent of the country's Pacific population." },
{ "name": "The Heat", "streamURL": "https://onlineradiobox.com/json/nz/theheat/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29395.v1.png", "desc": " r'n'b, pop, rap, hip-hop, 90s, 00s, reggae", "longDesc": "We play nothing but the best RnB, Pop, Reggae &amp; Hip Hop hits from the 90's &amp; 2000's with Hot 70's &amp; 80's Flash Backs along with a sprinkling of the new stuff right here in the lake city Rotorua!" },
{ "name": "Life FM", "streamURL": "https://rhema-radio.streamguys1.com/rhema-lifefm.mp3", "imageURL": "https://traderblog.net/images/zealand/29181.v1.png", "desc": " talk, christian, gospel", "longDesc": "New Zealand's Christian radio network features music, programs, and discussion. A member of the Rhema Broadcasting Group." },
{ "name": "Retro Hit Radio", "streamURL": "https://onlineradiobox.com/json/nz/retrohit/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/65534.v4.png", "desc": " classic, 90s, 80s, hits", "longDesc": "We're a radio station from Auckland, NewZealand playing #80s and #90s retro hits that Rocked The Block!" },
{ "name": "The Cheese", "streamURL": "https://onlineradiobox.com/json/nz/884cheese/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1065.png", "desc": " pop, 90s, 80s", "longDesc": "Playing hits of the 80s, 90s and Today! We are a low power FM radio station broadcasting from central Lower Hutt. You can listen in to us on 87.9FM or tune in via the internet or Cable TV. We celebrated 5 years on air July 2011. Help us celebrate, become a friend!" },
{ "name": "TAB Trackside Radio", "streamURL": "https://onlineradiobox.com/json/nz/tabtrackside/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29351.v1.png", "desc": " news, talk, sports, adult contemporary, racing", "longDesc": "Trackside Radio is our national radio network broadcasting racing, racing news, sports news, talk and information. Coverage starts from 6am every day." },
{ "name": "Rhema Radio", "streamURL": "https://rhema-radio.streamguys1.com/rhema.mp3", "imageURL": "https://traderblog.net/images/zealand/29172.v1.png", "desc": " talk, christian, gospel", "longDesc": "New Zealand based Christian radio station. It's all about music and talk that really matter." },
{ "name": "Radio Samoa", "streamURL": "https://onlineradiobox.com/json/nz/radiosamoa/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1149.v4.png", "desc": " pop, news, talk, folk", "longDesc": "Radio Samoa in its 16th year of service to the Samoan community and is enjoying a close working relationship with its clients and has the full support of the community it serves. It has built a strong relationship with the community through integrity and delivering quality programs to enhance the status of the Samoan Community not only in New Zealand but globally through its website streaming. In its philosophy Уa well informed community is an empowered communityФ" },
{ "name": "Dave FM", "streamURL": "https://onlineradiobox.com/json/nz/dave/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/74612.v3.png", "desc": " top40, 90s, 80s, 70s", "longDesc": "Dave FM is the home of your Classic Hits Collection! Our format of uninterrupted Classic Hits from the 70's, 80Тs and 90's means weТre a great place to escape with music you love without being interrupted by waffling DJ's, commercials or long news bulletins! We're not-for-profit (we do it for the love of it!) and we're based in New Zealand. We LOVE hearing from our listeners. If you'd like to get in touch, drop us a line! studio@davefm.net" },
{ "name": "Most FM", "streamURL": "https://onlineradiobox.com/json/nz/mostfm/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1174.v1.png", "desc": " pop, top40, alternative rock", "longDesc": "The Most 100.4 FM is a hit radio station broadcasting from New Plymouth, New Zealand. It is a 24 hours live online radio channel playing Top 40/Pop, Alternative Rock etc genres of music throughout the day." },
{ "name": "The Generator FM", "streamURL": "https://onlineradiobox.com/json/nz/thegenerator/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/73368.v2.png", "desc": " rock, heavy metal, classic rock, hard rock, progressive rock", "longDesc": "It's Rock You Live On" },
{ "name": "Radio X", "streamURL": "https://playerservices.streamtheworld.com/api/livestream-redirect/SAM02AAC65_SC", "imageURL": "https://traderblog.net/images/zealand/72734.v2.png", "desc": " rock, classic rock", "longDesc": "Just great rock minus the bullshit" },
{ "name": "Spellbound Radio", "streamURL": "https://s3.radio.co/s3620d3fd0/listen", "imageURL": "https://traderblog.net/images/zealand/1179.v6.png", "desc": " rock, blues, alternative", "longDesc": "Welcome to Spellbound Radio -  Your Blues Connection.  The station has been designed to give you the best radio experience no matter whether you are living in New Zealand or anywhere else in the world." },
{ "name": "Sweet Sounz", "streamURL": "https://onlineradiobox.com/json/nz/sweetsounz/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1180.v2.png", "desc": " soul, funk, reggae", "longDesc": "Sweet Sounz FM is not popular for only playing reggae music but because its a complete package of entertainment which is a core attraction of Sweet Sounz FM Like every other online radio medium they are also visioned to be one of the most popular one in New Zealand To be one of the most popular radio in their field Sweet Sounz FM always tries to bring some listener preferred songs in their daily music charts." },
{ "name": "Coast Access", "streamURL": "https://live.accessmedia.nz/Coast.stream_aac/playlist.m3u8", "imageURL": "https://traderblog.net/images/zealand/1085.v2.png", "desc": " oldies", "longDesc": "Coast FM Auckland is a hit radio station in New Zealand. This radio station is broadcasting from Auckland, New Zealand and playing oldies. It is a 24 hours live online radio station, popular among the people of New Zealand." },
{ "name": "ZFM Non-Stop", "streamURL": "https://onlineradiobox.com/json/nz/zfmnonstop/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1184.png", "desc": " pop, top40", "longDesc": "Hits, hits and more hits! ZFM was the first station we impacted out to the world, totally advertisement free! Ц It is our lead station which has a basic saying; If its new, weТre playing it!" },
{ "name": "Groove FM", "streamURL": "https://onlineradiobox.com/json/nz/groove1077/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/50960.v2.png", "desc": " blues, lounge, jazz, soul, funk, swing", "longDesc": "Groove is New Zealand's only Cafe Style Jazz Radio Station. Also the only locally owned &amp; operated, independent commercial radio station in Wellington. We specialise in Lounge, Swing, Classic Jazz, Blues, Acid Jazz, Funk, Soul and anything with a Groove." },
{ "name": "Radio Tarana", "streamURL": "http://player.avc-group.co.nz:8081/Tarana_Player/player.html", "imageURL": "https://traderblog.net/images/zealand/34373.png", "desc": " pop, news, talk, folk, indian", "longDesc": "New Zealand's Premier Hindi On-line Radio. Entertaining New Zealanders for 20 Years. Listen online" },
{ "name": "432radio", "streamURL": "https://streaming.radio.co/s02a09ea60/listen", "imageURL": "https://traderblog.net/images/zealand/70178.v4.png", "desc": " electronic, house, disco, techno, hip-hop, soul, funk, drum'n'bass", "longDesc": "432radio is a radio station focusing on the underground electronic music. We stream on our website and android and ios apps. we have live djs and bring the best tunage to you!" },
{ "name": "The Country", "streamURL": "https://onlineradiobox.com/json/nz/thecountry/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29339.png", "desc": " news, talk", "longDesc": "It began in 1994 as a five minute rural feature on an independently owned Southland radio station. Today it has grown to an hour, become an integral part of the farming day and can be heard throughout the country on Newstalk ZB, Radio Sport, Hokonui and affiliates. It's your agribusiness lunch hour with a generous side-serving of news, sport and politics. You can also go from on-farm to on-line at thecountry.co.nz" },
{ "name": "Switch FM Gisborne", "streamURL": "https://onlineradiobox.com/json/nz/switch/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/74836.v3.png", "desc": " dance, electronic, rock, alternative", "longDesc": "Gisbornes locally owned and operated FM radio station Switch FM playing a random mix of music genres." },
{ "name": "Static FM", "streamURL": "https://onlineradiobox.com/json/nz/staticfm/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1133.v1.png", "desc": " rock, pop, news", "longDesc": "Static 88.1fm is AUTТs understudy radio station, run by the 34 year three understudies of the Bachelor of Communication Studies majoring in radio. The understudies are included in the regular operation of the radio station, including dealing with the station, adding to the play rundown, composition and delivering all components of on-air substance furthermore advancing the station." },
{ "name": "Radio One", "streamURL": "https://onlineradiobox.com/json/nz/radioone91fm/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1127.png", "desc": " pop, news", "longDesc": "Radio One 91fm is your radio station, home of the intrepid audiophile. The southern sister of the bNets is on campus on Level 1 above the OUSA archway. We take you to the school and bank your cheque with all the freshest music, the latest news, and the skinny on the places to be." },
{ "name": "Mix FM", "streamURL": "https://stream.mixfm.nz/", "imageURL": "https://traderblog.net/images/zealand/76620.v3.png", "desc": " rock, pop, hits", "longDesc": "Mix FM is a contemporary hits station with a blend of pop/rock music ranging from the 80s through to today's latest hits. From the studio in Grenada Village, Mix FM broadcasts to the northern suburbs of Wellington, New Zealand." },
{ "name": "New Zealand Net Radio", "streamURL": "https://www.nznetradio.net.nz:8443/stream.mp3", "imageURL": "https://traderblog.net/images/zealand/70050.v5.png", "desc": " classic, adult contemporary, hits", "longDesc": "All about the Music! Based in Whangarei, Northland in New Zealand we enjoy playing a range of our favourite pop and rock, mostly from the 80s until today but with a few classic gold tracks mixed in. We hope you enjoy our blend, streaming ad free 24/7 through New Zealand." },
{ "name": "Sunshine FM", "streamURL": "https://onlineradiobox.com/json/nz/sunshinefm/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29387.png", "desc": " classic rock, blues, jazz, classic, oldies", "longDesc": "Nestled in the heart of Kaitaia is SUNSHINE 104.3 FM, a busy local radio station that serves the Far North of New Zealand and covers from north of Mangamuka to Cape Reinga, and across to Mangonui on the east coast. Sunshine FM have a friendly, professional and commercial approach to broadcasting. Since first going to air in February 1998, we have received great support from the local business community, local service clubs, emergency services and of course our listeners. The audience ranges in age from about 30 to 50 years or anyone who likes СClassic Hits from the 60Тs to todayТ. Broadcasting goes 24 hours, Monday to Sunday, with News, sport and weather provided every hour on the hour. Sunshine also promotes Maori language and customs to the wider community, and this adds a significant cultural dynamic to our product. The advertising content has a community specific focus. How can you can be involved? You are welcome to participate or send us feedback about any of our music, promotions or events. If youТre keen to be on the radio, please get in touch as weТre always looking for volunteers to be part of our vibrant team." },
{ "name": "Sun FM", "streamURL": "https://onlineradiobox.com/json/nz/sunfm/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29390.v3.png", "desc": " pop, 90s, 00s", "longDesc": "Sun FM 106.5 FM is  a local community radio station based in Whakatane, and broadcasts from its studios in Louvain Street out to the Bay of Plenty region. Profile Ц We play hits from the 90Тs to today, keeping the entertainment up and the ads down, with the flavour distinctively localЕ itТs a formula you wonТt find anywhere else." },
{ "name": "Big River", "streamURL": "https://onlineradiobox.com/json/nz/bigriver/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29396.v1.png", "desc": " pop, top40, community", "longDesc": "BIG RIVER FM is a community-owned and run radio station based in Dargaville, Northland, New Zealand. The station transmits throughout parts of the Kaipara region on 98.6 MHz FM and in Ruawai and Aranga on 88.2 MHz FM." },
{ "name": "100.3 FM South Canterbury", "streamURL": "https://onlineradiobox.com/json/nz/1003fsouthcanterbury/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/76807.v4.png", "desc": " rock, pop, adult contemporary, variety", "longDesc": "Playing the music anthems of the 70's, 80Тs, 90's, 2000's and now. We are an independent radio station located in Central Timaru, in the heart of the South Canterbury region of New ZealandТs South Island." },
{ "name": "SANZLive Radio", "streamURL": "https://s3.radio.co/s47a56becc/listen", "imageURL": "https://traderblog.net/images/zealand/79228.v2.png", "desc": " house, r'n'b, pop, jazz, soul, funk, smooth jazz, african", "longDesc": "South Africa NZ live Radio is a Not For Profit organization we broadcasts every day from Auckland, New Zealand .We are all South African expats. Our show reflects our passion for our music our food and our culture. We also promote upcoming artist, Radio with a distinctive South Africa Flavour and promote fund raising events of NOT FOR PROFIT and CHARITY organizations" },
{ "name": "Radio Ngati Porou", "streamURL": "https://onlineradiobox.com/json/nz/ngatiporou/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29378.v1.png", "desc": " talk, folk, maori", "longDesc": "Radio Ngati Porou covers an area that has a population of nearly 44 thousand people, around 20 thousand being of Maori Heritage." },
{ "name": "Radio Southland", "streamURL": "https://onlineradiobox.com/json/nz/southland/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1128.png", "desc": " pop, talk", "longDesc": "We are Radio Southland 96.4 FM Ц SouthlandТs only locally-owned, community access radio station. This means that anyone in the community can have a voice on-air." },
{ "name": "Te Arawa Radio", "streamURL": "https://onlineradiobox.com/json/nz/tearawa/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29369.v5.png", "desc": " talk, folk, maori", "longDesc": "Te Reo Irirangi o Te Arawa was built up in the mid 1980s under the lead of the Te Arawa Trust Board. It wasnТt until November 1990 that Te Reo Irirangi o Te Arawa turned into a consolidated element under the Charitable Trust Act." },
{ "name": "Radio Waatea", "streamURL": "https://onlineradiobox.com/json/nz/waatea/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29382.v2.png", "desc": " news, talk, folk, maori", "longDesc": "Radio Waatea is AucklandsТ only Maori radio station that provides an extensive bi-lingual broadcast to its listeners. Based at Nga Whare Waatea marae in Mangere, it is located in the middle of the biggest Maori population in Aotearoa." },
{ "name": "Fresh FM", "streamURL": "https://onlineradiobox.com/json/nz/freshfm/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1099.png", "desc": " pop, news, talk", "longDesc": "Fresh FM is a Community Access station, broadcasting content made By, For and About people in our region. Our programme mix includes discussions, drama, music and documentaries that reflect the top of the South Island." },
{ "name": "Hokonui Radio", "streamURL": "https://onlineradiobox.com/json/nz/hokonui/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29340.v2.png", "desc": " country", "longDesc": "Home of The Country with Jamie MacKay. Playing one great song after another." },
{ "name": "Radio Active", "streamURL": "https://streaming.radio.co/s6ef1e80ce/listen", "imageURL": "https://traderblog.net/images/zealand/1119.v2.png", "desc": " rock, pop, talk", "longDesc": "Radio Active is an alternative radio station broadcasting in Wellington, New Zealand on 88.6FM (formally 89 FM) as well as www.radioactive.fm." },
{ "name": "Tahu FM", "streamURL": "https://onlineradiobox.com/json/nz/tahu/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29385.v1.png", "desc": " rock, pop, talk, folk, maori", "longDesc": "We play all kinds of good music... From Maori to other Indigenous Sounds From Reggae to Electronic. From NZ Roots to World Music. From Motown Soul to Neo-Soul and Blues From Urban/RnB to Pop and Dance." },
{ "name": "SKI FM", "streamURL": "https://onlineradiobox.com/json/nz/skifmnetwork/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29349.png", "desc": " pop, top40, adult contemporary", "longDesc": "From Taihape to Taupo and beyond! 24/7 the Ski FM Network plays the hottest hit music all year round. We are a contemporary hit radio station and reach 71,200 local population in the central North Island region and a further potential 2.3 million listeners a year, who travel along the busy State Highways (including the Desert Road)" },
{ "name": "Bayrock", "streamURL": "https://radio.e-cast.co.nz/bayrock/stream.m3u8", "imageURL": "https://traderblog.net/images/zealand/71085.v3.png", "desc": " rock", "longDesc": "Bayrock - real music and more of it." },
{ "name": "Nga Iwi FM", "streamURL": "https://onlineradiobox.com/json/nz/ngaiwi/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29367.v2.png", "desc": " r'n'b, pop, talk, folk, maori", "longDesc": "To Empower The Voice of Hauraki and Hear it in all its beauty throughout all of its Tribal Regions. here to broadcast out loud and Proud of New ZealandТs number one community Ц Paeroa. You can rely on Nga Iwi FM" },
{ "name": "AWA FM", "streamURL": "https://onlineradiobox.com/json/nz/awafm/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29342.v2.png", "desc": " pop, news, talk, maori", "longDesc": "Started in 1991 to promote the Maori language in the Whanganui dialect to the whole Whanganui Region, from the mountains in the Central Plateau to the sea through Whanganui City." },
{ "name": "Radio Kahungunu", "streamURL": "https://onlineradiobox.com/json/nz/kahungunu/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29374.v1.png", "desc": " talk, folk, maori", "longDesc": "Mission:  To operate a Maori radio broadcasting service that will fulfil the Vision" },
{ "name": "Plains FM", "streamURL": "https://onlineradiobox.com/json/nz/plainsfm/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1108.png", "desc": " rock, pop", "longDesc": "PLAINS FM 96.9 airs audio content by, for and about Cantabrians - our interests, concerns and passions. This model of citizen-made media provides a democratic voice for our region." },
{ "name": "Tuwharetoa FM", "streamURL": "https://onlineradiobox.com/json/nz/tuwharetoa/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29393.v1.png", "desc": " talk, folk, maori", "longDesc": "Tuwharetoa FM broadcasts a diverse range of locally and nationally produced programs, both music and spoken word, in hi-fi stereo. Tuwharetoa FM broadcasters believe in providing real music variety, so listeners can enjoy a vast catalogue of known and unknown tracks." },
{ "name": "Kia Ora", "streamURL": "https://onlineradiobox.com/json/nz/kiaora/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29357.v2.png", "desc": " talk, adult contemporary, maori", "longDesc": "Kia Ora FM 89.8 was established on 10 July 1992 as part of the National Governments policies to contribute to the preservation of our Te Reo me ona Tikanga. Kia Ora FM 89.8 is owned and operated by Tanenuiarangi Manawatu Incorporated, the Iwi Authority for Rangitaane O Manawatu." },
{ "name": "Manawatu People&#39;s Radio", "streamURL": "https://onlineradiobox.com/json/nz/accessmanawatu/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1083.v2.png", "desc": " news, talk, entertainment", "longDesc": "Manawatu People's Radio is a station for all of the peoples of Manawatu. We work hard to be a safe space for everyone, and to celebrate and promote diversity. We aspire to see a whole country who share these values." },
{ "name": "TumekeFM", "streamURL": "https://onlineradiobox.com/json/nz/tumeke/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29394.v1.png", "desc": " talk, folk, maori", "longDesc": "Te Reo Irirangi o Te Manuka Tutahi Trust, trading as The Sun on 96.9 and 106.5 FM is based in Whakatane, and broadcasts from its studios in Louvain Street out to the Bay of Plenty region." },
{ "name": "One Double-X", "streamURL": "https://radio.e-cast.co.nz/1xxone/stream.m3u8", "imageURL": "https://traderblog.net/images/zealand/71136.v2.png", "desc": " pop, news", "longDesc": "Based in sunny Whakatane, New Zealand, we broadcast to the Eastern &amp; Central Bay Of Plenty on 90.5FM Whakatane, 1242AM &amp; on 93.0FM Ohope Beach." },
{ "name": "Power Hit FM 87.8", "streamURL": "https://onlineradiobox.com/json/nz/powerhit/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/76631.png", "desc": " pop, top40, variety", "longDesc": "Less talk, more music Ц playing all the hits, all the time." },
{ "name": "MFM Radio", "streamURL": "https://onlineradiobox.com/json/nz/mfm/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29362.v3.png", "desc": " talk, folk, maori", "longDesc": "Te Reo Irirangi o Maniapoto (MFM) is one of 21 Iwi Radio Satations who broadcast independently throughout Aotearoa on frequencies which are specifically reserved for the promotion of the Maori language and culture. From humble beginnings in a small room along Te Kumi Road, Te Kuiti, we have a rich heritage dating back 25 years. At MFM our work ethic embraces and upholds our well known slogan, 'whanake ake which means to develop and prosper." },
{ "name": "Gaia FM", "streamURL": "https://onlineradiobox.com/json/nz/gaiafm/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1172.v1.png", "desc": " jazz, soul", "longDesc": "Gaia FM can be received in most parts of Tauranga and Mt. Maunganui on 87.8Mhz or 107.1Mhz FM, however, being low power, an aerial of some kind will be required in most areas. A piece of wire roughly 2 metres in length connected to the 300ohm connection on your home stereo is often sufficient. 300ohm indoor ribbon antennas can usually be purchased from electronic supply stores." },
{ "name": "Radio Kidnappers", "streamURL": "https://onlineradiobox.com/json/nz/radiokidnappers/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1122.png", "desc": " pop, news, folk", "longDesc": "Radio Kidnappers 1431 AM 104.7 FM Hastings, Community radio. Hastings, New Zealand. Radio Kidnappers is Radio Station based in Hastings that covers Entertainment and News &amp; Current Affairs ." },
{ "name": "FLEET FM", "streamURL": "https://onlineradiobox.com/json/nz/fleetfm/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1098.png", "desc": " pop, talk", "longDesc": "Fleet FM is a low-power non-commercial co-operative radio station which has previously broadcast permanently in Auckland and Wellington, New Zealand. It broadcast in Auckland on 88.3FM and in Wellington on 107.3FM. It was founded on 18 July 2003. The station was unique in that it is being run as a completely voluntary project and is advert free. This helps to ensure the Fleet disk jockey complete artistic control. The station's listenership crosses through traditional Auckland demographics reaching a diverse audience particularly those involved in the Arts and creative industries. Fleet has held a variety of music and art related events, such as the infamous Convoy gigs and Camp Fleet, when on New Years the radio station takes over a classic Kiwi school camp. Fleet members are often exhibiting art about town and sometimes in conjunction with the Pelvic Trust." },
{ "name": "Maranui FM", "streamURL": "https://onlineradiobox.com/json/nz/maranuifm/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1103.png", "desc": " rock, pop, news", "longDesc": "Maranui FM is a broadcast radio station in Wellington, New Zealand, providing School news and information, as well as local Indie music and sports events from Lyall Bay School." },
{ "name": "Radio Tautoko", "streamURL": "https://onlineradiobox.com/json/nz/tautoko/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29381.png", "desc": " talk, folk, maori", "longDesc": "Te Reo Takiwa o Tautoko was an aggregate exertion of Iwi, from nearby hapu and whanau, to set up a Radio Station as a method for offering voice to the general population inside of the Hokianga and encompassing groups and as a guarantee to the restoration of Te Reo me ona Tikanga. Built up in 1983 Te Whare Awhina o te Iwi Community Trust turned into the spine to the goals of the nearby Iwi." },
{ "name": "Q97", "streamURL": "https://radio.e-cast.co.nz/q97/stream.m3u8", "imageURL": "https://traderblog.net/images/zealand/71137.v3.png", "desc": " hits", "longDesc": "Eastern Bay of Plenty - New Zealand's Newest Radio Station. New Hits Now. Never more than 60 seconds away from music. 97.7FM &amp; 99.3FM." },
{ "name": "Wellington Access Radio", "streamURL": "https://onlineradiobox.com/json/nz/wellingtonaccessrad/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1136.v1.png", "desc": " language, nz music", "longDesc": "Wellington Access Radio is the station thatТs by, for and about our community. WeТre a non-profit, grass roots organisation that celebrates all things Wellington." },
{ "name": "Radio Control", "streamURL": "https://onlineradiobox.com/json/nz/radiocontrol/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1175.png", "desc": " rock, progressive rock", "longDesc": "Format of the station is very original and versatile. The playlist of the radio is also very rich in various kinds of progressive rock music in which this radio is special in. Many lovers of progressive rock music of the country loves to be with Radio Control 99.4 FM radio all day long." },
{ "name": "H1T", "streamURL": "", "imageURL": "https://traderblog.net/images/zealand/54288.v5.png", "desc": " pop, top40, hits", "longDesc": "Your new H1T source! From New Zealand to the world, the latest hits as well as flashbacks" },
{ "name": "95b FM", "streamURL": "https://onlineradiobox.com/json/nz/95bfm/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1082.v2.png", "desc": " rock", "longDesc": "95b FM is aimed to be the leader and broadcaster of contemporary music for the mass amount of listeners. 95b FM alos consults with their listeners and even with students for the developing process of their radio station. The radio interacts with students and takes their opinion because the core of the radio is connected with students and their interest." },
{ "name": "Humm FM", "streamURL": "https://cp12.serverse.com/proxy/hummfm?mp=/live", "imageURL": "https://traderblog.net/images/zealand/1159.v1.png", "desc": " pop, indian", "longDesc": "Humm Fm is an Auckland based FM radio station. It's an upbeat, modern and fast tracked music station, that plays the music for the today's generation... We are humming the new tune." },
{ "name": "Channel Z", "streamURL": "https://onlineradiobox.com/json/nz/channelz/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/75406.v1.png", "desc": " indie, alternative, modern rock", "longDesc": "New ZealandТs favourite alternative and modern rock station." },
{ "name": "Radio 531pi", "streamURL": "https://playerservices.streamtheworld.com/api/livestream-redirect/531PIAAC_SC", "imageURL": "https://traderblog.net/images/zealand/1118.v1.png", "desc": " pop, news", "longDesc": "Since 1993 Radio 531pi has been serving our Pacific communities a mix of news, views, information and talk back all blended with a music mix you'll hear nowhere else." },
{ "name": "Neo Radio", "streamURL": "https://onlineradiobox.com/json/nz/neo/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/76536.v1.png", "desc": " pop, retro, 80s", "longDesc": "NZ based Radio Station playing Synthwave, Retrowave and music inspired by the 1980's" },
{ "name": "The Flea FM", "streamURL": "https://onlineradiobox.com/json/nz/fleafm/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1176.png", "desc": " pop, talk", "longDesc": "Radio The Flea is broadcasting from Auckland, New Zealand. This is a famous radio channel in New Zealand. It is a 24 hours live online radio station playing various popular songs around the clock." },
{ "name": "RDU FM", "streamURL": "https://onlineradiobox.com/json/nz/rdu985/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1177.v2.png", "desc": " blues, jazz, soul, funk", "longDesc": "Rolling since 1976, RDU98.5fm is now the only bastion of alternative radio in Christchurch.RDU 98.5 FM is the peopleТs Choice online radio and fm radio station. They are Playing Soul, Funk, Jazz, Electronic, Blues and World music. They give you sounds like no-one else can. RDU 98.5 FM broadcasts to the greater New Zealand area and beyond. RDU 98.5 FM provide the best of specialist music, community and arts programs." },
{ "name": "Turanga FM", "streamURL": "https://onlineradiobox.com/json/nz/turanga/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29392.png", "desc": " pop, talk, maori", "longDesc": "Te Reo Irirangi o Turanganui-a-kiwa or Turanga FM is the Iwi Radio Station for the Gisborne Area Broadcasting on 91.7FM / 95.7FM &amp; 98.1FM. The Station has a wide &amp; diverse music format catering to the listening tastes of many while still maintaining its prime mission statement of preserving &amp; promoting the maori culture &amp; language." },
{ "name": "AndHow.FM", "streamURL": "https://onlineradiobox.com/json/nz/andhow/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/75435.v1.png", "desc": " rock, alternative rock, indie rock, modern rock", "longDesc": "An independent, world-class, always eclectic, indie, alternative, modern, retro/vintage rock &amp; more FM and internet radio station. Jamming the free world, one person at a time since 1998." },
{ "name": "Base FM", "streamURL": "https://onlineradiobox.com/json/nz/basefm/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1084.v2.png", "desc": " dance, pop", "longDesc": "Base FM 107.3 is broadcasting from Auckland, New Zealand. This radio station is playing Electic, Funk, Hip Hop etc genres of music 24 hours live online.  It is now getting much popularity among the young generation in New Zealand" },
{ "name": "Just Jazz", "streamURL": "https://justjazz.radioca.st/stream", "imageURL": "https://traderblog.net/images/zealand/67799.v6.png", "desc": " jazz", "longDesc": "Just Jazz plays  jazz in all its genres; jazz, jazz funk, blues, trad jazz, smooth jazzЕWe are open to all kinds of jazz. We love jazz." },
{ "name": "Bollybop", "streamURL": "https://onlineradiobox.com/json/nz/bollybop/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29318.v1.png", "desc": " bollywood, hindu, punjabi", "longDesc": "bollybop is Tauranga's first and only 24/7 Indian Radio Station, playing the latest Bollywood, Hindi and Punjabi Hits." },
{ "name": "East FM", "streamURL": "https://onlineradiobox.com/json/nz/howickvillage/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1101.png", "desc": " rock, pop, news", "longDesc": "East FM is a community radio station broadcasting on 88.1fm in and around Howick, and on 107.1fm in Botany/FlatBush areas." },
{ "name": "Tai FM", "streamURL": "https://onlineradiobox.com/json/nz/taifm/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29388.png", "desc": " r'n'b, hip-hop, reggae", "longDesc": "Tai FM has a youth focus playing R'n'B, Hip Hop, Reggae and the best of the Old Skool. Tune in when yourТe in Kaitaia, on 106.7FM. Otherwise tune in online and listen from anywhere in the world. Tune in with Riah on the Drive Time Show as she has some awesome prizes up for GRABS!!! Yes thats right...thanks to Ami Holifield we have 3 Double Passes to the Opononi Gig being held on the 8th of January 2016 featuring Katchafire | Sons of Zion | The Black Seeds | Ladi6 | Kora also we have tees and a major prize pack filled with all the bands merchandise, cds, tees and more but you got to tune in to win" },
{ "name": "Heads FM", "streamURL": "https://onlineradiobox.com/json/nz/heads1064/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1170.v1.png", "desc": " pop, news, talk", "longDesc": "NZ's ONLY solar powered commercial radio station broadcasting from Mangawhai Head" },
{ "name": "RAG-FM 107.7 Raglan New Zealand", "streamURL": "https://onlineradiobox.com/json/nz/rag/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/52181.v3.png", "desc": " rock'n'roll, country, oldies", "longDesc": "RAG-FM У Top Music Top of the Dial Ф is a LPFM radio station broadcasting on the westerly air waves, Snuggled in the heart of Raglan on the West Coast of the North Island in New Zealand." },
{ "name": "Coromandel&#39;s C95 FM", "streamURL": "https://onlineradiobox.com/json/nz/coromandelsc95/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/80106.v1.png", "desc": " hits", "longDesc": "Live and local 24/7 Coromandel radio" },
{ "name": "Moana Radio", "streamURL": "https://onlineradiobox.com/json/nz/moana/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29365.v2.png", "desc": " talk, folk, maori", "longDesc": "Moana Radio broadcasts from Tauranga on two frequencies, 98.2FM and 1440AM. This allows us to reach an audience from Katikati to Opotiki on 1440AM, and from Katikati to Pukehina on 98.2FM. We also have an international audience via online streaming at  www.moanaradio.co.nz. This allows our expatriate Tauranga whanau to stay in touch with their community, wherever they are in world." },
{ "name": "Radio Tama-Ohi", "streamURL": "https://onlineradiobox.com/json/nz/tamaohi877/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/76360.v3.png", "desc": " news, talk, community", "longDesc": "Radio Tama-Ohi is a Tongan Community Radio Station fully installed, owned and operated 24/7 by Tongans under the Tama-Ohi Charitable Trust." },
{ "name": "Te Upoko o te Ika Radio", "streamURL": "https://onlineradiobox.com/json/nz/teupokooteika/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29391.v3.png", "desc": " dance, rock, pop, talk, classic, culture", "longDesc": "Te Upoko o te Ika Radio live broadcasting from New Zealand. Te Upoko o te Ika Radio broadcast various kind of latest pop, rock, classic, talk, culture, dance, electronic etc. Te Upoko o te Ika Radio streaming music and programs both in online. Te Upoko o te Ika Radio is 24 hour 7 day live Online radio." },
{ "name": "Ngati Hine FM", "streamURL": "https://onlineradiobox.com/json/nz/ngatihine/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29376.v1.png", "desc": " talk, folk, maori", "longDesc": "Ngati Hine FM falls under the umbrella of the Ngati Hine wellbeing trust and was set up to serve for our kin of Ngati Hine and the more prominent tribe of Ngapuhi." },
{ "name": "KDAB Radio", "streamURL": "https://listen.shoutcast.com/MixKDAB", "imageURL": "https://traderblog.net/images/zealand/70559.v3.png", "desc": " rock, pop", "longDesc": "5000 songs on rotating." },
{ "name": "Te Korimako o Taranaki", "streamURL": "https://onlineradiobox.com/json/nz/tekorimakootaranaki/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29389.v2.png", "desc": " r'n'b, talk, hip-hop, oldies, reggae, maori", "longDesc": "Te Korimako o Taranaki 94.8 FM Ц your tribal heartbeat. Te Korimako o Taranaki 94.8 FM are situated in New Plymouth and are the Taranaki RegionТs select Home for Te Reo Maori, Tikanga Maori and Kaupapa Maori reporting in real time influxes of Taranaki. Te Korimako o Taranaki 94.8 FM sort incorporates Reggae, Hip Hop, RТnТB, Old and New School Jams to take into account everybo." },
{ "name": "COMMUNITY RADIO", "streamURL": "https://onlineradiobox.com/json/nz/community/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/50963.png", "desc": " pop, news, talk", "longDesc": "Most of the music in the Waves of the Pacific are originated from different islands such as Tonga, Samoa, Fiji, Vanuatu, New Calendonia etc.Tune in from your home 24 hours a day." },
{ "name": "World FM", "streamURL": "https://onlineradiobox.com/json/nz/worldfmwel/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1137.png", "desc": " rock, pop, talk", "longDesc": "World FM is a low power FM (LPFM) radio station based in Tawa, Wellington, New Zealand.Our aim is to play a mix of some of the best world music, Kiwi classics, and a selection of radio programming from around the world." },
{ "name": "Te Hiku Radio", "streamURL": "https://onlineradiobox.com/json/nz/tehiku/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29386.png", "desc": " talk, folk, maori", "longDesc": "Te Hiku 97.1 FM is part of the iwi communities of Te Hiku o Te Ika/the Far North, and belongs collectively to itТs five iwi. Te Hiku FM and was born out of the dreams and aspirations of our kuia and kaumatua (elders), as a way to retain Maori language communication within our whanau, hapu and iwi. The iwi radio format is packed with local news, interactive talkback and Waiata in Te Reo Maori. The station promotes the use of Te Reo Maori as a means of everyday communication, and whilst targeted at native speakers, listening to the station is a great way to improve Te Reo Maori for beginners, and second language learners. How do you get involved? Te Hiku FM is always keen to hear your views and encourages listeners to contribute to topical discussion. If you have a panui to share with the iwi or a kaupapa that you would like to talk about then please contact Maria Tauroa." },
{ "name": "Atiawa Toa FM", "streamURL": "https://onlineradiobox.com/json/nz/atiawatoa/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29341.v1.png", "desc": " talk, folk, adult contemporary, maori", "longDesc": "Atiawa Toa FM is one of New Zealand's premier Iwi radio stations. It's a department of Te Runanganui o Taranaki Whanui and this year celebrated its 16th birthday. A fully commercial enterprise, it successfully competes in the Greater Wellington market, broadcasting to the Wellington region via 2 transmitters; one on the eastern hills of Lower Hutt and the other overlooking Porirua city." },
{ "name": "The ONE - Jesus Radio", "streamURL": "https://s7.myradiostream.com:59715/stream", "imageURL": "https://traderblog.net/images/zealand/82605.v21.png", "desc": " pop, easy listening, christian, gospel, religious", "longDesc": "No ads. No DJs. Just the Gospel - Everyday!" },
{ "name": "Pirate Radio", "streamURL": "https://onlineradiobox.com/json/nz/pirate/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/79281.png", "desc": " trance, house, drum'n'bass", "longDesc": "Electro , Techno , Drum and Bass , Trance , House on the Pirate Radio" },
{ "name": "KFM", "streamURL": "https://onlineradiobox.com/json/nz/kfm/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/1102.png", "desc": " jazz, soul", "longDesc": "Kfm 106.9 has been broadcasting a quality sound for a discerning ear for the last twelve years. We are a low frequency station which promotes social consciousness and genres not championed by our mainstream counterparts." },
{ "name": "Radio Tainui", "streamURL": "https://onlineradiobox.com/json/nz/tainui/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29380.v1.png", "desc": " talk, folk, maori", "longDesc": "Radio Tainui is an international online radio station playing a fresh, uplifting and eclectic music format for a global audience. Radio Tainui are an independent station for the online generation, connecting those who already have a strong connection with New Zealand." },
{ "name": "Planet FM", "streamURL": "https://cp12.shoutcheap.com:18220/strem", "imageURL": "https://traderblog.net/images/zealand/29398.v1.png", "desc": " jazz, talk, oldies, community", "longDesc": "Planet FM is a not-for-profit community based radio station. We offer a radio broadcast facility to community groups and individuals who otherwise have little or no access to the airwaves." },
{ "name": "Raukawa FM", "streamURL": "https://onlineradiobox.com/json/nz/raukawa/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/29383.v1.png", "desc": " talk, folk, maori", "longDesc": "We are an Iwi Radio Station located in the South Waikato Area here in the heart of Tokoroa. Also Know as Tok (pronounced toke) Town Emare-Rose Nikora (right) temporarily stepped out of Kohanga in 1990 to establish the Raukawa Trustboard and went on to establish the Raukawa Radio Station in 1990. Te Reo Irirangi O Ngati Raukawa began broadcasting on 23 of October 1990, with keen motivated people that were determind on making this a radio station that people would want to listen, learn and contribute to." },
{ "name": "Hutt Radio", "streamURL": "https://stream.zeno.fm/br149pzanbruv", "imageURL": "https://traderblog.net/images/zealand/80929.v2.png", "desc": " hits, community", "longDesc": "Community radio plus the hits of the 60s, 70s, 80s, 90s and today. News, current events and community information for the Hutt Valley." },
{ "name": "Twisted Radio", "streamURL": "https://onlineradiobox.com/json/nz/twisted/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/51381.v2.png", "desc": " eclectic", "longDesc": "No ads. No bullshit. Just great tunes. We are an internet based radio station. We have been broadcasting since May 2004. We play an eclectic mix of music. Bring the noise!" },
{ "name": "Kaos FM NZ", "streamURL": "https://onlineradiobox.com/json/nz/kaos/play?platform=web", "imageURL": "https://traderblog.net/images/zealand/84809.v2.png", "desc": " rock, heavy metal, classic rock, hard rock, alternative rock, indie rock", "longDesc": "KAOS FM NZ. Radio That Rocks. Active Rock. Classic Rock. Kiwi Rock. International Rock. Streaming 24/7. Listen Now online or Download our App from Google Play." },
{ "name": "Melo FM", "streamURL": "https://stream.radiojar.com/uwrvb9q8fseuv", "imageURL": "https://traderblog.net/images/zealand/75842.png", "desc": "", "longDesc": "Melo plays soul, funk and disco 24/7 - Make it Melo!" }
]
}
