{
"station":
[
    { "name": "Radio 105 Bombarder", "streamURL": "https://onlineradiobox.com/json/mk/bombarder/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/13643.v3.png", "desc": " news, sports, culture, entertainment", "longDesc": "ќва е официЉалната веб страна на –адио 105 јктуел Ѕомбардер од Ѕитола на коЉа што можете да наЉдете информации за нас а исто така преку оваа страна ви е овозможено слушаЬе на –адио 105 во живо директно од нашето студио. ќва радио постои веЭе 25 години, зрачи на бранова должина од 100,5 ћHz FM и Ља покрива териториЉата на град Ѕитола и повеЭето општини околу неа а исто така можете да Ља следите и преку интернет" },
{ "name": "Radio 5 Coki", "streamURL": "https://onlineradiobox.com/json/mk/5coki/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/13997.v1.png", "desc": " news, talk, variety", "longDesc": "Ѕогатата фонотека на –адио 5 вероЉатно е наЉголемата и наЉавтентична збирка на аудио материЉали кои сведочат за историЉата и растежот на ѕрилеп во изминатите 9 години. –адиото го бележеше животот на прилепчани, му овозможуваше да ги слушнат новостите и важните настани истовремено, но и влиЉаеше на текот на настаните. ”ште повеЭе: –адиото беше и се уште е гласот на прилепчани! £а одразуваше колективната свест на прилепчани и нивните желби за подобруваЬе на животот во градот што го сакаат и е нивен. ѕо доаГаЬето на интернетот и првите интернет проваЉдери, се склучи договор за онлаЉн стриминг на програмот на –адио 5 преку интернет, по што беше покриен и оноЉ сегмент Ц диЉаспората, коЉ беше многу битен за прошируваЬе на македонската култура и овдешните прилики на македонците ширум светот. ƒенес –адио 5 е современ електронски медиум со мошне високи содржински и технички принципи на радио форматот, по коЉ се издвоЉува од сите други радио станици во ѕрилеп. ¬о време кога комерциЉалноста, а со тоа и и кичот навлезе во многу пори од животот, и многумина продаваат шунд спакован во украсна фолиЉа, ние и натаму се стремиме да го издвоиме она што е вредно и траЉно. Ќашата музичка програма е комбинациЉа на различни музички стилови, стари и нови, од странски и домашни евергрини, но секако незаборавни музички нумери. Ќе ги следиме трендовите по секоЉа цена, туку ги селектираме по вредност и музиката и информациите што ги пласираме на нашите мегахерци. »збегнуваме локални трачеви, навреди на личности, прекинуваЬе на музики нумери со зборуваЬе, напорни и долги информативни програми, непотребно долги разговори и коментари со пласираЬе на лични ставови на новинарите, а се стремиме кон етика во информациите и говорот, го поддржуваме македонскиот литературен Љазик и култура, и пред се ги следиме желбите на прилепчани. “ука сме кога им требаме, го креваме гласот за да ги заштитиме нивните права, и до денес останавме верни на првичната идеЉа - –адио 5 да биде пулсот на прилепчани, нивните очи и уши." },
{ "name": "Radio HIT", "streamURL": "https://onlineradiobox.com/json/mk/hit/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/13960.png", "desc": " dance, house, pop", "longDesc": "Ѕидете дел од новата радио генерациЉа на интернет! ѕрво комерциЉално интернет радио во ћакедониЉа Ќ»≈ ’»“ќ¬»“≈ √» ¬–“»ћ≈ Ќј »Ќ“≈–Ќ≈“!!!" },
{ "name": "Radio Fama", "streamURL": "https://onlineradiobox.com/json/mk/fama/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/13712.v1.png", "desc": " pop, folk", "longDesc": "Radio FAMA  - Tetove ju sherben dhe i mbulon me radio sinjal kualitativ qytetet Tetove dhe Gostivar ne numer afersisht 350.000 degjues potencial. Si nje nga radio-stacionet e para private ne keto ane ( prej 28.06.1994 vj.) dhe njera nga radiot qe posedon licence per emitim programi ne gjuhen shqipe qe nga viti 1998 dhe me nje eksperience te pasur ka fituar nje degjushmeri te madhe . Ne nuk jemi te vetmit , por jemi gjithmone ne sherbimin tuaj , prandaj nese percaktoheni te reklamoheni ne radion tone ne dhe degjusit tane ju pergezojme per zgjedhjen e bere , dhe ju deshirojme sukses ne biznesin tuaj." },
{ "name": "Radio Akord", "streamURL": "https://onlineradiobox.com/json/mk/akord/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/13812.png", "desc": " pop, adult contemporary", "longDesc": "Ќа фреквенциЉа од 96.5 MHZ во  ичево, 24 часа на ден, се емитува музика по избор на слусателите,наЉнови хитови од македонската и странската музичка сцена и промоциЉа на албуми. —екоЉдневен радио сервис коЉ ве информира за сите настани од градот,околината ипошироко. ƒенес –адио ј ќ–ƒ со своЉот сигнал Ља покрива целата териториЉа на општина  ичево и околината, а исто така програмата на ј ќ–ƒ –адио може да се следи и преку интернет на нашата веб страница www.radioakord.com ¬ие сте на вистинската радио-фреквенциЉа,контактираЉте не редовно, ¬и стоиме на услуга. —осема спонтано, проследено од нашите желби да навлеземе во светот на музиката настана - ј ќ–ƒ - звукот на музичките ноти проткаени со гласот на народот!" },
{ "name": "Kanal 103", "streamURL": "https://onlineradiobox.com/json/mk/kanal103/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/13717.v1.png", "desc": " alternative rock", "longDesc": "»скра светлина во мрачните лавиринти на ћ–“¬, наЉголема Ъубов и зависност, гордост, наЉдоброто радио на целиот свет, стотроЉка." },
{ "name": "Radio Zhelina", "streamURL": "https://onlineradiobox.com/json/mk/zhelina/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/13708.v3.png", "desc": " pop, top40", "longDesc": "Radio Zhelina, Nje hap me afer vendlindjes tuaj..." },
{ "name": "Radio 106", "streamURL": "https://onlineradiobox.com/json/mk/106fm/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/13817.png", "desc": " adult contemporary, hits", "longDesc": "106-ка е позната по презентираЬе на наЉновите хитови, кои ги слушате секогаш прво на 106.6 фм, а потоа на сите други фреквенции. ѕокраЉ наЉновите хитови, неизбежно, тука се и старите добри класики, кои се внимателно одбрани. 106-ка нуди и други интересни програмски содржини за кои повеЭе Эе дознаете со разгледуваЬето на страницата." },
{ "name": "Ekspres Radio", "streamURL": "https://onlineradiobox.com/json/mk/ekspres/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/13958.v1.png", "desc": " pop, news, top40", "longDesc": "≈кипата на ≈кспрес радио е професионална и секогаш водечка цел на вработените во ≈кспрес радио е дека слушателот и деловниот партнер секогаш се во право и секогаш се исполнуваат нивните бараЬа. «а музиката што се емитува на нашата програма се внимава таа да биде квалитетна. Ќа ≈кспрес радио се емитуваат хитови од забавна македонска и од екс Љугословенските простори. —екоЉ работен ден од 07 до 10 часот се емитува утринска програма коЉа претставува еден вид на градски информатор и слушателите се запознаваат со се она што се случувало и Эе се случува во градот. ¬о периодот од 10 до 15 часот секоЉдневно од студиото на ≈кспрес радио се реализира отворената програма во коЉа се третираат теми од областа на музиката, спортот, филмот, медицината, занимливости како и голем броЉ на теми од секоЉдневието на нашите граГани. ¬о состав на отворената програма се и ћинутите за спорт на радио коЉ се емитуваат во 11:30. ¬о нашата програмска шема влегуваат и вестите што се преземаат од ћакедонското –адио во: 08, 10, 12 и 14 часот." },
{ "name": "Radio PRO FM", "streamURL": "https://onlineradiobox.com/json/mk/pro/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/13977.png", "desc": " folk, ethnic", "longDesc": "–адио ДPro FMФ е приватна радиостаница, коЉа емитува 24 часовна програма на албански и турски Љазици за √остивар, “етово и регионот." },
{ "name": "Radio Kometa", "streamURL": "https://onlineradiobox.com/json/mk/kometa/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/13974.v2.png", "desc": " news, easy listening, dj", "longDesc": "–адио  омета √остивар со своЉата 13 годишна работа постои како радио со една зацртана цел-да им служи на слушателите наЉповеЭе за забава и редовно информираЬе за сите дневни актуелности новости и информации.–адио  омета √остивар на вашиот радио приемник Эе го уловите на фрекфенциЉа од 106,4 мегахерци фм стерео во ѕолошкиот регион √остивар,ћаврово,“етово, на www.radiokometa.com.mk и на повеЭе саЉтови на интернет,како интернет радио со голема популарност и слушаност каЉ нашите иселеници во странство.ѕрограмската шема се состои од музика, емисии од забавен карактер,актуелни вести подготвени од екипата на –адио  омета,бизнис информации,спортски вести,топ листи и контакти со слушатели." },
{ "name": "Star Radio", "streamURL": "https://onlineradiobox.com/json/mk/star/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/81465.v2.png", "desc": " rock, pop, balada", "longDesc": "ѕрво професионално интернет радио од ћакедониЉа кое започна да емитува програма на 14 декември 2011 година. ѕрезентираме ≈кс £у забавна музика. јкцент даваме на ретро баладите." },
{ "name": "I Love Heavy Metal", "streamURL": "https://streamingv2.shoutcast.com/IloveHeavyMetal", "imageURL": "https://traderblog.net/images/macedonia/13671.v5.png", "desc": " hard rock, metal, hardcore", "longDesc": "I love Heavy Metal is an Internet Radio station broadcasting from Skopje, Macedonia, providing Death Metal, Gothic Metal,Heavy Metal, Trash Metal and Metal Music." },
{ "name": "Play Radio", "streamURL": "https://onlineradiobox.com/json/mk/play/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/13724.png", "desc": " pop, top40", "longDesc": "Play Radio 90.4 has a great team, good number of listeners and better playlists with trending music what else is needed just tune in to the radio and start listening to the great top 40 and pop music based radio presentation. Play Radio 90.4 always plays top of the line top chart music for their music lover listeners." },
{ "name": "Radio TIM Bitola", "streamURL": "https://onlineradiobox.com/json/mk/timbitola/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/83090.v4.png", "desc": " folk", "longDesc": "Tim radio sekogas cekor pred drugite mzuika za site vas nie ke postoeme samo za vas za site vas" },
{ "name": "Radio Sportsko", "streamURL": "https://onlineradiobox.com/json/mk/sportsko/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/13984.v2.png", "desc": " pop, sports, hits", "longDesc": " онцепциЉата на —портското радио 90.3 фм е пред се, брзо и точно информираЬе за сите спортски настани во ћакедониЉа, но и надвор од нашите граници. Ќа тоЉ принцип е изградена и програмската шема на радиото, коЉа опфаЭа голем броЉ на содржини кои го привлекуваат вниманието на слушателите во текот на целиот ден. омплетната програма се емитува во живо, со повремени снимени прилози од главните настани во земЉата. ¬одителите на своЉ начин ги донесуваат наЉновите вести до слушателот, низ highlight блок-содржини кои се куси и содржаЉни. Ќа секоЉ час се емитуваат спортски вести, кои се сублимат на вестите во текот на еден час. ¬ечерната спортска програма и ¬икенд програмата, пак, опфаЭа многу повеЭе фудбалски натпревари во живо. ѕокраЉ фудбалските средби, во живо се следат и останатите спортови, како хокеЉот, кошарката, ракометот, одбоЉката ... —портското радио 90.3 фм има и стилска музичка концепциЉа. ѕотпрена главно на хитовите од минатото, но со доволен простор и за наЉновите музички хитови. Ќеколку емисии во живо, интервЉуа со познати спортски и Љавни личности и секогаш присуство во живо на врвните настани во земЉата, но и надвор од нашите граници. ¬ршиме преноси од фудбалските натпревари на нашата репрезентациЉа, имаме наши репортери на настапите на сите наши репрезентации на домашен терен. —е обидуваме да им понудиме на слушателите секогаш свежи и точни содржини. ƒосега имаме и одличен успех со слушаноста, а тоа е само мотив повеЭе за натамошна успешна работа." },
{ "name": "Radio 5fm", "streamURL": "https://onlineradiobox.com/json/mk/5fm/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/13719.v2.png", "desc": " adult contemporary, hits", "longDesc": "–адио 5‘ћ постои од 18 ‘евруари 2001 година, кога доби лиценца за емитуваЬе програма на локално ниво. —поред форматот, –адио 5‘ћ е говорно - музичко радио со претежно забавен општ формат. —поред музичката понуда, 5‘ћ е Adault Contemporary Hit Radio (ACHR). ѕредавателниот пункт се наоГа во месноста —в. »лиЉа, на надморска висина од 555 метри. –адио 5‘ћ зрачи на фреквенциЉа од 107,1 MHz, со Љачина на предавател од 100W. ƒотурот на сигналот од студиото до предавателниот пункт е дигитален. ѕокраЉ ¬елес, сигналот на –адио 5‘ћ стигнува и до —вети Ќиколе, Ћозово, √радско, „ашка, Ѕогомила и делови од —копЉе. ќсвен терестиЉално, –адио 5‘ћ зрачи и на интернет, во дигитален AAC формат. ¬о текот на своето работеЬе, –адио 5‘ћ стана лидер во медиумскиот простор на ¬елес. ƒневниот реЉтинг на слушаност изнесува 25% на териториЉата на ќпштина ¬елес, а одредени сегменти од програмата достигнуваат реЉтинг и преку 40%. –адио 5‘ћ прерасна во школо за радио новинарство и радио водителство." },
{ "name": "002.Evergreen Radio Mak", "streamURL": "https://streamingV2.shoutcast.com/EVERGREENRadioMAK", "imageURL": "https://traderblog.net/images/macedonia/78651.v6.png", "desc": " pop, retro, 90s, 80s, 70s, oldies, 60s, hits", "longDesc": "„лен на мрежата ≈вергреен радио станица на »нтернет. ЌаЉдобра стара музика од '60 .- '90." },
{ "name": "Radio MX", "streamURL": "https://onlineradiobox.com/json/mk/mx/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/13976.png", "desc": " news, culture, education, entertainment", "longDesc": "MX - –адио е радио станица коЉа емитува сигнал на подрачЉето на ќхрид, —труга, ƒебар,  ичево. ”ште од првото вклучуваЬе и испраЭаЬе на првиот сигнал во далечната 1997 година, како аматерска радио станица, стремежот беше да се постигне нешто до перфекциЉа. «апочнавме со опрема коЉа не задоволуваше ниту 1% од тоа што требаше да биде. Ќо со добиваЬето на концесиЉа, односно дозвола за работа, тоа го свативме дека една права радио станица треба да изгледа баш како нашата. —ега ћ’ - –адио прерасна во професионална радио станица со професионалци и професионална опрема.  ога спомнуваме професионална опрема подразбираме опрема како што е R.V.R., DB Electronica, SONY, VISION, D&amp;R, TASKAM и многу други познати светски брендови. —ите овие фирми се застапени во предавателниот и во техничкиот дел на оваа радиостаница. ћожеме да се пофалиме со наЉголема слушаност во овоЉ регион. ѕриоритет на нашата радио станица е да шириме култура, едукациЉа и забава. —о успешната работа стигнати сме до ова ниво на развиеност, без никакви донации на невладини или владини организации и сл. “оа покажува дека сме либерална и непартиски обоена радио станица." },
{ "name": "Radio MOF", "streamURL": "https://onlineradiobox.com/json/mk/mof/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/13993.v4.png", "desc": " variety", "longDesc": "–адио ћќ‘ е интернет радио кое продуцира и споделува музички и информативни содржини кои се достапни на http://www.radiomof.mk. ѕоведени од фактот дека е ограничен просторот во коЉ младите можат да се изразат, креираме медиум коЉ е отворена станица за промоциЉа на младинската, културната и креативната заедница." },
{ "name": "Radio Kavadarci", "streamURL": "https://onlineradiobox.com/json/mk/kavadarci/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/13991.v3.png", "desc": " folk", "longDesc": "«а оние кои веруваат во моЭта на радиото... www.radiokavadarci.mk" },
{ "name": "Radio Bubamara", "streamURL": "https://onlineradiobox.com/json/mk/bubamara/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/13644.v3.png", "desc": " folk, adult contemporary, entertainment", "longDesc": "¬о почетоците на транзициЉата мрачните сили на олигархиЉата, во 1994 година го формираа –јƒ»ќ Ѕ”Ѕјћј–ј, кое имаше за цел со своЉата програма да Ља затруе прогресивната работничка класа нудеЉЭи им забава, деноноЭно слушаЬе радио, политички говори и препишани програми. √олемата популарност на радиото на многу невработени им Ља олесни можноста да не одат на работа, да не се надеваат на работен стаж, синдикат и плата. ¬о изминативе 10 години –јƒ»ќ Ѕ”Ѕјћј–ј Ља постигна своЉата цел и Ља доби посакуваната таргет група од 400 000 невработени, 80 000 акционери, 100 богати политичари и 7000 Mакедонци со бугарски пасош." },
{ "name": "Metropolis Radio", "streamURL": "https://onlineradiobox.com/json/mk/metropolis/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/13964.png", "desc": " electronic, trance, house, rock, pop, rap, hip-hop, country, soft", "longDesc": "ќд декември 2007 г. во етерот официЉално Эе профункционира новото радио ДћетрополисФ, коЉ е подарок на слушателите по повод петгодишнината од постоеЬето на Д—ити радиоФ. Д—итиФ групациЉата неодамна го презеде националното радио, радио Д–осФ, на чии фреквенции" },
{ "name": "Radio Holidej", "streamURL": "https://onlineradiobox.com/json/mk/holidej/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/14006.v3.png", "desc": " entertainment, variety", "longDesc": "–адио ’олидеЉ е  радиостаница коЉа емитува 24 часовна програма од сопствено емитувачко студио поврзано со линк и предавателна опрема лоцирана на перифериЉата на градот ѕрилеп. —поред природата на програмскиот сервис ние сме говорно Ц музичко радио со претежно забавен општ формат. √оворниот дел на програмата ги остварува трите значаЉни функции: информативна, образовна и забавна.  –адио ’олидеЉ емитува Уинфо вестиУ во кои се третираат значаЉни настани и случуваЬа од градот и агенциски вести од земЉата и светот.—е емитуваат и емисии кои имаат забавно Ц образовна функциЉа, интерактивни програми, инфо сервиси и музика за сите генерации од сите жанрови." },
{ "name": "Radio Bravo", "streamURL": "https://onlineradiobox.com/json/mk/bravo/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/13869.v1.png", "desc": " pop, top40", "longDesc": "јвгуст 2002, го означи почетокот на наЉдоброто радио во кумановскиот етер Ц Ѕ–ј¬ќ –адио. ќд ден на ден –адио Ѕ–ј¬ќ се повеЭе го освоЉуваше епитетот на наЉслушано радио кое нуди повеЭе од квалитетен, препознатлив музички програм." },
{ "name": "Mk Radio 1", "streamURL": "https://onlineradiobox.com/json/mk/mkradio1/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/81518.v2.png", "desc": " pop, folk", "longDesc": "Exyu Radio station !" },
{ "name": "Radio Dervendi", "streamURL": "https://onlineradiobox.com/json/mk/dervendi/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/74280.v3.png", "desc": " albanian", "longDesc": "Radio Dervendi - Tetovo - Macedonia" },
{ "name": "Radio Demir Hisar", "streamURL": "https://onlineradiobox.com/json/mk/demirhisar/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/14004.v1.png", "desc": " news, talk, variety", "longDesc": "–адио ƒемир ’исар е интернет радио кое продуцира и споделува музички и информативни содржини кои се достапни на http://rdh.mk/" },
{ "name": "–адио  уманово ћакедониЉа", "streamURL": "https://onlineradiobox.com/json/mk/kumanovo/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/83615.v1.png", "desc": " folk", "longDesc": "ƒобро ƒоЉдовте на радио  уманово" },
{ "name": "Radio Bocka", "streamURL": "https://onlineradiobox.com/json/mk/bocka/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/13852.png", "desc": " pop, folk, rap", "longDesc": "Macedonian Music Mix Radio Bocka Station." },
{ "name": "Radio Mix", "streamURL": "https://onlineradiobox.com/json/mk/mix/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/84122.v1.png", "desc": " pop", "longDesc": "»нтернет музичка радио станица од —копЉе,ћакедониЉа kоЉа што нуди вистинско музичко освежуваЬе,забава и музичка едукациЉа." },
{ "name": "Teen Radio", "streamURL": "https://onlineradiobox.com/json/mk/teen/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/13858.png", "desc": " entertainment", "longDesc": "“ин интернет радио и портал. —лушаЉ, да не пропуштиш." },
{ "name": "–адио 1", "streamURL": "https://onlineradiobox.com/json/mk/radio1/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/81436.v1.png", "desc": " pop, folk", "longDesc": "Ќовото интернет радио во ћакедониЉа - –адио" },
{ "name": "Super Radio", "streamURL": "https://onlineradiobox.com/json/mk/superradio/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/13668.v1.png", "desc": " dance, electronic, pop, top40", "longDesc": "—упер радио Ља започна своЉата приказна во далечната 1992 година, веднаш по осамостоЉуваЬето на –епублика ћакедониЉа. ”спеавме успешно да ги поминеме сите детски медиумски болести со кои се сретнуваа сите медиуми кои Ља започнаа своЉата приказна некаде на почетокот на 90-тите години. —о огромното искуство стекнато низ год" },
{ "name": "Kanal 98", "streamURL": "https://onlineradiobox.com/json/mk/kanal98/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/81795.v1.png", "desc": " pop, folk", "longDesc": "»нтернет –адио и »нтернет “елевизиЉа -  анал 98" },
{ "name": "Radio Merova", "streamURL": "https://onlineradiobox.com/json/mk/merova/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/13814.png", "desc": " chill-out, alternative, 90s", "longDesc": "Radio Merova is often a live on the net Macedonian radio stations inside Macedonia. Radio Merova sent out a day live system with Internet. Radio Merova eye-sight would be to signify Macedonia traditions globally, the company concentrating on the actual fans which talk Macedonian and also live both within the land and also in another country. Simply Macedonia content tend to be transmitting by way of this section so far." },
{ "name": "Radio Sokolarci", "streamURL": "https://onlineradiobox.com/json/mk/sokolarci/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/81838.v10.png", "desc": " folk", "longDesc": "—лушаЉте го –адио —околарци" },
{ "name": "Radio Joker", "streamURL": "https://onlineradiobox.com/json/mk/mibrala/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/83929.v7.png", "desc": " folk", "longDesc": "ƒобро ƒоЉдовте на –адио Покер" },
{ "name": "Biser Radio Orovnik", "streamURL": "https://onlineradiobox.com/json/mk/biserorovnik/play?platform=web", "imageURL": "https://traderblog.net/images/macedonia/84378.v3.png", "desc": " folk", "longDesc": "Folk Radio - Biser Radio Orovnik" }
]
}
