{
"station":
[
    { "name": "Radio NET FM", "streamURL": "https://onlineradiobox.com/json/si/radionetfm/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/25184.v2.png", "desc": " pop, folk, oldies", "longDesc": "Radio NET FM 99.8 je oddaja radijska postaja iz Maribora, Slovenije, ki zagotavlja novice in aktualne informacije o sportu, vremenu in dogodke, in Oldies." },
{ "name": "Radio Murski Val", "streamURL": "https://onlineradiobox.com/json/si/murskival/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/25106.v1.png", "desc": " pop, news, talk, folk", "longDesc": "Podjetje za informiranje Murska Sobota, d.o.o je izdajatelj regionalnega casopisa Vestnik in internetnega portala www.pomurje.si. Prvi zametki danasnjega podjetja, ki zaposluje 25 delavcev in ima blizu sto zunanjih strokovnih in drugih sodelavcev, segajo v leto 1958, ko je podjetje prevzelo izdajanje takratnega regionalnega casopisa Pomurski Vestnik, ki izhaja ze 60 let. Danes je Vestnik glavna blagovna znamka podjetja, ki podpira razvoj novih blagovnih znamk. Med njimi je trenutno najpomembnejsi internetni portal www.pomurje.si, ki ob informativnih in zabavnih vsebinah vkljucuje se turisticni portal regije." },
{ "name": "Radio Capris", "streamURL": "https://onlineradiobox.com/json/si/capris/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/25204.v4.png", "desc": " rock, pop, news, top40, entertainment", "longDesc": "Nov koncept programa ponuja izkljucno samo tisto, kar si poslusalci zelijo slisati. Pozitivne in resnicne zgodbe iz regije, lokalne informacije, objektivno obvescanje in sproscena zabava so del vseh programskih pasov na Radiu Capris." },
{ "name": "Radio Slovenske Gorice", "streamURL": "https://onlineradiobox.com/json/si/slovenskegorice/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/26844.v2.png", "desc": " pop, news, talk, folk", "longDesc": "Radio Slovenske gorice ni navaden radio. Smo radijska postaja posebnega pomena! PPP! Regionalna radijska postaja! Za ta status se moramo truditi. Pripravljati moramo vec, kot bi bilo treba, ce ga ne bi imeli. V nasem programu tako najdejo mesto vsebine, ki jih na drugih radijskih postajah ni. Porocamo o delu lokalnih skupnosti, o kulturnem in sportnem dogajanju, o delu in zivljenju v vrtcih, solah, v nasem programu najdejo svoje mesto tudi verske oddaje." },
{ "name": "Radio Krka", "streamURL": "https://onlineradiobox.com/json/si/krka/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/25203.v1.png", "desc": " rock, pop, rock'n'roll, news, oldies", "longDesc": "Tune in to Vroce 106,6, Planinski Koticek, or shows including Horoskop, and many more." },
{ "name": "Radio Celje", "streamURL": "https://onlineradiobox.com/json/si/radiocelje/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/25183.v3.png", "desc": " pop, news, talk, folk", "longDesc": "Zelo veliko je radio naredil za druzabno zivljenje in s svojimi akcijami vzpostavil tudi nekaj tradicionalnih prireditev, od javnih radijskih oddaj, prenosov slovesnosti, otroskih prireditev (Metuljcek, Full Cool Demo Top), obiskov v porodnisnici, soorganizacije Tedna domacega filma, porocanja o Dnevih komedijeЕ Danes oddajamo 24 ur na dan na frekvencah 95.1, 100.3, 95.9 in 90.6 MHz." },
{ "name": "Radio Tomi", "streamURL": "https://onlineradiobox.com/json/si/radiotomi/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/26285.png", "desc": " pop, 80s, oldies", "longDesc": "Radio Tomi - najvecje uspesnice 80-ih let Vse te informacije, ki jih povezuje zares dobra starejsa glasba, so vsak dan strnjene v polurni oddaji ДNekoc je bila glasba ...У. Oddajo vodi Samo Glavan, prisluhnete pa ji lahko vsak dan ob 10:00 in 20:00 uri." },
{ "name": "Slovenec", "streamURL": "https://onlineradiobox.com/json/si/slovenec/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/71542.v20.png", "desc": " dance, rock, pop, folk", "longDesc": "Radio Slovenec Ц le najboljsa slovenska glasba!  The best music of 80, 90s ! Radio Slovenec je moderna radijska postaja, ki vrti izbor najboljse slovenske glasbe. Od septembra 2016 dalje navdusuje ljubitelje dobre glasbe vseh starosti, katerih srce bije za slovensko glasbo. S pomocjo svetovnega spleta pa je prisoten prakticno kjerkoli na svetu." },
{ "name": "002.Evergreen Radio Slo", "streamURL": "https://streamingV2.shoutcast.com/EVERGREENRadioSLO", "imageURL": "https://traderblog.net/images/slovenia/78650.v6.png", "desc": " pop, retro, 90s, 80s, 70s, oldies, 60s, hits", "longDesc": "Radijska postaja, Clan Network Evergreen Radio Stations Online. Najboljsa stara glasba iz '60. - '90." },
{ "name": "Radio Maxi", "streamURL": "https://onlineradiobox.com/json/si/maxi/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/25120.v1.png", "desc": " pop, news, talk, folk", "longDesc": "Radio Maxi deluje od 12. avgusta 1995. V vsem tem casu se je nasa ekipa s prvotnih 7 clanov povecala kar za nekajkrat, saj v tem trenutku pri oblikovanju programa sodeluje vec kot 30 sodelavcev. Radio Maxi je iz lokalnega radia po slisnosti presel v regionalnega, saj s svojimi oddajniki pokriva obmocje celotne SV Slovenije. Poslusate nas lahko na frekvencah 90.0, 95.7, 98.7 in 107.7 MHz. Programska zasnova je pestra in prilagojena potrebam poslusalcev. Radio Maxi ima aktualen informativni program, odmevne kulturne in sportne oddaje, zadostno mero zabavnih in nagradnih vsebin. Skrbimo za to, da poslusalcem ponudimo ravno pravsnjo kombinacijo informacij, glasbe in zabave." },
{ "name": "Radio Ekspres", "streamURL": "https://onlineradiobox.com/json/si/ekspres/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/25188.v1.png", "desc": " rock, r'n'b, pop, news, top40, oldies", "longDesc": "Na Radiu Ekspres vam predvajamo glasbo, ki jo imamo vsi radi. Najljubsa nam je glasba iz let nase mladosti, iz 80-ih in 90-ih let, za raznolikost in svezino pa poskrbimo s predvajanjem najlepsi uspesnic danasnjih dni." },
{ "name": "Radio Zeleni", "streamURL": "https://onlineradiobox.com/json/si/radiozeleni/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/25211.v4.png", "desc": " pop, news, folk", "longDesc": "Radio Zeleni val, 93.1 MHz 97.0 MHz 105.3 MHz Poln pozitive!" },
{ "name": "Radio Dur", "streamURL": "https://playerservices.streamtheworld.com/api/livestream-redirect/SP_R2067050.aac", "imageURL": "https://traderblog.net/images/slovenia/26839.v1.png", "desc": " rock, country, oldies", "longDesc": "Dediscina RadiaDur 13. julija 2016 smo prejeli Radijsko dovoljenje za nov program, imenovan RETRO RADIO. Kandidirali smo za pridobitev dovoljenja za digitalno oddajanje programa za pokrivanje cele Slovenije. 19. julija smo se na odpiranju ponudb lahko prepricali, da je bila nasa vloga formalno brezhibna. Ce bomo v casu do 19. septembra prejeli Odlocbo o dodelitvi digitalnega kanala, bomo malo pred letosnjim Bozicem zaceli oddajati v DAB* tehniki." },
{ "name": "Radio METEOR", "streamURL": "https://eu6.fastcast4u.com/proxy/radiometeor?mp=/stream", "imageURL": "https://traderblog.net/images/slovenia/25192.v3.png", "desc": " rock, pop, country", "longDesc": "Slucajno surfate na internetu in bi radi poslusali glasbo po vasem okusu? NI PROBLEMA! Za dobro glasbo in razpolozenje poskrbi Radio METEOR." },
{ "name": "Radio 2", "streamURL": "https://onlineradiobox.com/json/si/radio2/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/71311.v2.png", "desc": " pop, talk, hits", "longDesc": "Radio 2 je slovenska radijska postaja, ki predvaja samo tvoje najljubse hite." },
{ "name": "Radio HIT", "streamURL": "https://onlineradiobox.com/json/si/radiohit/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/25215.v2.png", "desc": " rock, pop, news, top40", "longDesc": "NAJVEC HITOV VSAKO URO - EDINI PRAVI HIT RADIO" },
{ "name": "Radio Student", "streamURL": "https://onlineradiobox.com/json/si/tudent/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/25181.png", "desc": " rock, pop, top40", "longDesc": "One of the oldest and the biggest independent and non-commercial radio stations in Europe. Forever young." },
{ "name": "Radio Stajerski Val", "streamURL": "https://onlineradiobox.com/json/si/radiostajerskival/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/26445.png", "desc": " pop, news, top40", "longDesc": "Najstarejsi slovenski regionalni radio tvita o dogodkih v Obsotelju, na Kozjanskem, Celjskem, Konjiskem, Bistriskem in se kje. Stay tuned!" },
{ "name": "Radio MARS", "streamURL": "https://onlineradiobox.com/json/si/radiomar/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/25165.png", "desc": " rock, r'n'b, pop, news, talk, culture, to40", "longDesc": "Kakovost glasba, zanimive informacije o kulturi in znanosti novice za vas na nasem radiu Mars" },
{ "name": "Radio 94", "streamURL": "https://onlineradiobox.com/json/si/radio94/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/26860.v1.png", "desc": " pop, news, talk, top40", "longDesc": "Radio 94 je regionalna radijska programska mreza, ki s sedmimi frekvencami pokriva predvsem obmocje primorsko Ц notranjskih obcin (Postojna, Pivka, Ilirska Bistrica, Cerknica, Loska dolina, Bloke) in Logatca, pa tudi precejsen del Ljubljanske kotline. V vec kot dvajsetih letih delovanja se je razvil v sodoben radijski program, ki pa ohranja predvsem osnovno, lokalno usmerjeno poslanstvo. Kot edini tovrstni radio v primorsko notranjski regiji nudi najbolj celovite in tocne informacije o dogajanju na vseh podrocjih. Vsak dan namrec porocamo o vseh dogodkih, ki so pomembni za zivljenje ljudi v lokalni skupnosti in sirse, regionalno." },
{ "name": "Radio Veseljak", "streamURL": "https://onlineradiobox.com/json/si/veseljak/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/25107.png", "desc": " pop, news, folk", "longDesc": "24 ur slovenske glasbe-Radio Veseljak" },
{ "name": "Muravideki Magyar Radio", "streamURL": "https://mp3.rtvslo.si/mmr", "imageURL": "https://traderblog.net/images/slovenia/48257.png", "desc": " folk, hits", "longDesc": "Muravideki Magyar Radio - A regio hangja..." },
{ "name": "VAL 202", "streamURL": "https://mp3.rtvslo.si/val202", "imageURL": "https://traderblog.net/images/slovenia/25109.png", "desc": " rock, pop, news, talk, country, oldies", "longDesc": "Val 202, drugi program Radia Slovenija, je sodoben informativni, glasbeni, sportni in interaktivni radijski program. Na Snapchatu smo val202si." },
{ "name": "Rock Maribor", "streamURL": "https://onlineradiobox.com/json/si/rockmaribor/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/26867.v1.png", "desc": " rock, metal, country, oldies", "longDesc": "Rock Maribor je nova radijska postaja v Mariboru, ki predvaja samo 100% rock. Vse drugo je brez veze." },
{ "name": "Radio Kum", "streamURL": "https://onlineradiobox.com/json/si/radiokum/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/26440.png", "desc": " pop, news, talk, top40", "longDesc": "Nocni dobre glasbe in informacij o regiji" },
{ "name": "Radio Triglav", "streamURL": "https://onlineradiobox.com/json/si/radiotriglav/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/25217.v2.png", "desc": " rock, pop, news, top40", "longDesc": "Priljubljen radio z lepo glasbo za vas" },
{ "name": "Radio Ptuj", "streamURL": "https://onlineradiobox.com/json/si/radioptuj/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/25150.png", "desc": " rock, pop, news, talk, top40", "longDesc": "Radio Ptuj je najbolj poslusana radijska postaja Spodnjega Podravja ter uveljavljena blagovna znamka v slovenskem prostoru. Pripravljamo aktualne, skrbno preverjene in zanimive novice za dobro informiranost nasih poslusalcev vseh starostnih, izobrazbenih in socialnih struktur. Glasbo izbiramo tako, da je zanimiva za vse starostne skupine od 15 do 75 let. Na Radiu Ptuj vrtimo vse - od rocka do domace zabavne glasbe" },
{ "name": "Radio 24 SI", "streamURL": "https://onlineradiobox.com/json/si/radio24si/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/26346.v4.png", "desc": " rock, pop, top40", "longDesc": "Radio 24 je lokalni primorski radio, ki skrbi za glasbo katero ne slisimo drugje." },
{ "name": "Radio Europa 05", "streamURL": "https://onlineradiobox.com/json/si/europa05/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/25195.png", "desc": " rock, metal, country, oldies", "longDesc": "Prvi rock radio v Sloveniji. Radio z vsebino in dobro glasbo, ki vas bo pripravila, da se boste zopet pocutili mladi ali da se nikoli ne boste postarali." },
{ "name": "Moj Radio", "streamURL": "https://onlineradiobox.com/json/si/moj/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/25242.v4.png", "desc": " rock, pop, news, top40, oldies", "longDesc": "Moj Radio obstaja v etru Saleske doline od leta 2000. Pred letom 2000 smo se urili na kabelsko razdelilnem sistemu v obcini Velenje. Ekipo nasega radija sestavlja ze od zacetka vecina novih moderatorskih imen, producentov, organizatorjev..., ki pa so se kasneje uveljavili tudi v sirsem medijskem prostoru Slovenije. Oddajamo program v RDS EON tehniki na frekvenci 107 MHz ter 102.6 MHz in dosegamo najvecjo poslusanost nase pokritosti, kar zagotavlja institucija za uradna statisticna merjenja Ц Mediana RM. Zadnja leta belezimo porast poslusalcev in tako spadamo v sam vrh regionalnih medijev" },
{ "name": "Radio Terminal", "streamURL": "https://onlineradiobox.com/json/si/radioterminal/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/26425.v1.png", "desc": " rock, pop, top40", "longDesc": "Spletni radio z urbano duso. Internet radio with an urban soul. Your music destination." },
{ "name": "Katoliski radio MIR Slovenija", "streamURL": "https://listen.radioking.com/radio/84823/stream/123070", "imageURL": "https://traderblog.net/images/slovenia/82763.v2.png", "desc": " christian", "longDesc": "Radio, kjer je Bog vedno na pr(a)vem mestu. Radio, gdje je Bog uvjek na pr(a)vome mjestu." },
{ "name": "Primorski val", "streamURL": "https://onlineradiobox.com/json/si/primorskival/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/25438.png", "desc": " pop, news, talk, top40", "longDesc": "PRIMORSKI VAL je prva slovenska radijska mreza s statusom regionalnega programa posebnega pomena. V njej sta zdruzili moci dve radijski postaji Severne Primorske Ц Radio Odmev in Alpski val. Gre za dve prepoznavni imeni v slovenskem medijskem prostoru. Radio Odmev je eden najstarejsih elektronskih medijev v Sloveniji, saj je ze praznoval 45. rojstni dan. Tudi Alpski val ni od vceraj, saj je slavil 25. rojstni dan." },
{ "name": "Radio Sora", "streamURL": "https://onlineradiobox.com/json/si/sora/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/25206.png", "desc": " rock, pop, news, top40", "longDesc": "Sedimo v Skofji Loki in vrtimo slovensko in tujo raznoliko glasbo zacinjeno s pretezno lokalnimi informacijami." },
{ "name": "Radio Velenje", "streamURL": "https://onlineradiobox.com/json/si/velenje/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/25194.png", "desc": " rock, pop, top40", "longDesc": "24 ur zadetkov na svetu najboljse za vas" },
{ "name": "Radio Golubica", "streamURL": "https://onlineradiobox.com/json/si/radiogolubica/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/26289.png", "desc": " folk, oldies, bosnian", "longDesc": "Posjetite nasu web stranicu gdje vas ceka dobra muzika, vedro i veselo raspolozenje zabavna , narodna i izvorna muzika uz najbolju i najveseliju ekipu" },
{ "name": "Radio Robin", "streamURL": "https://onlineradiobox.com/json/si/rarobin/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/26456.v1.png", "desc": " rock, pop, oldies", "longDesc": "Radio Robin je severnoprimorska radijska postaja s sedezem v Novi Gorici (Industrijska cesta 5). Oddaja na frekvencah 99,50 MHz (podrocje mesta Nova Gorica) in 100,00 MHz (podrocje severne primorske). Z ustvarjanjem programa je pricel leta 1994. Nekaj let pozneje je pridobil status programa posebnega pomena (lokalna radijska postaja), ki narekuje njegovo programsko usmeritev, tako kvantitativno kot tudi vsebinsko (20% lastne produkcije mora biti vsebinsko vezano na podrocje slisnosti programa in se mora nanasati na informativne, kulturne, izobrazevalne, religiozne vsebine...). Prav zaradi vsebin je radijski program zanimiv predvsem za aktivno in dinamicno populacijo prebivalstva (18-60 let, obeh spolov, z razlicno izobrazbeno strukturo) na podrocju svoje slisnosti, saj le ta, poleg glasbe in zabave zeli slisati tudi kvalitetno informacijo, zlasti lokalno, saj jo potrebuje za vsakdanje delo in aktivnosti. V glasbenem smislu radijski program poskusa zadovoljiti okus ciljne skupine poslusalstva s poudarkom na tako imenovanih pop glasbenih zvrsteh. Radio Robin s svojim signalom pokriva Gorisko statisticno regijo; podrocja Vipavske doline, Goriskih brd, Krasa, Banjske planote, Sosko dolino in Italijansko Gorisko pokrajino." },
{ "name": "Radio Ognjisce", "streamURL": "https://onlineradiobox.com/json/si/radioognjice/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/26391.png", "desc": " news, talk, christian, gospel, religious", "longDesc": "Smo katoliska nacionalna radijska postaja, katere glas prek interneta seze v vsak koticek sveta." },
{ "name": "FRED FILM RADIO", "streamURL": "https://onlineradiobox.com/json/si/fredfilm/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/46842.v2.png", "desc": " news, talk, entertainment", "longDesc": "FRED Film Radio - the only multi lingual online radio station that brings you the insight on film festivals and film events all around the world!" },
{ "name": "Radio Prlek", "streamURL": "https://onlineradiobox.com/json/si/prlek/play?platform=web", "imageURL": "https://traderblog.net/images/slovenia/25246.png", "desc": " pop, news, top40", "longDesc": "Smo lokalna radijska postaja s sedezem v Ormozu. S svojo frekvenco pokrivamo dobrsen del severovzhodne Slovenije, cemur je tudi prilagojen nas program. Spadamo med ene najstarejsih radijskih postaj v Sloveniji, saj iz Ormoskega gradu neprekinjeno oddajamo ze od leta 1970. Program je namenjen predvsem poslusalcem od 15-50 leta starosti in temu primerna je tudi nasa glasbena shema, v kateri ne manjka uspesnic iz zlatih osemdesetih, skladb, ki so zaznamovala devetdeseta, do najnovejsih hitov." }
]
}
